var LAreaData=[
  {
    "name": "北京",
    "id": 110000,
    "child": [
      {
        "name": "北京",
        "id": 110100,
        "child": [
          {
            "name": "东城",
            "id": 110101
          },
          {
            "name": "西城",
            "id": 110102
          },
          {
            "name": "朝阳",
            "id": 110105
          },
          {
            "name": "丰台",
            "id": 110106
          },
          {
            "name": "石景山",
            "id": 110107
          },
          {
            "name": "海淀",
            "id": 110108
          },
          {
            "name": "门头沟",
            "id": 110109
          },
          {
            "name": "房山",
            "id": 110111
          },
          {
            "name": "通州",
            "id": 110112
          },
          {
            "name": "顺义",
            "id": 110113
          },
          {
            "name": "昌平",
            "id": 110114
          },
          {
            "name": "大兴",
            "id": 110115
          },
          {
            "name": "怀柔",
            "id": 110116
          },
          {
            "name": "平谷",
            "id": 110117
          },
          {
            "name": "密云",
            "id": 110228
          },
          {
            "name": "延庆",
            "id": 110229
          }
        ]
      }
    ]
  },
  {
    "name": "天津",
    "id": 120000,
    "child": [
      {
        "name": "天津",
        "id": 120100,
        "child": [
          {
            "name": "和平",
            "id": 120101
          },
          {
            "name": "河东",
            "id": 120102
          },
          {
            "name": "河西",
            "id": 120103
          },
          {
            "name": "南开",
            "id": 120104
          },
          {
            "name": "河北",
            "id": 120105
          },
          {
            "name": "红桥",
            "id": 120106
          },
          {
            "name": "东丽",
            "id": 120110
          },
          {
            "name": "西青",
            "id": 120111
          },
          {
            "name": "津南",
            "id": 120112
          },
          {
            "name": "北辰",
            "id": 120113
          },
          {
            "name": "武清",
            "id": 120114
          },
          {
            "name": "宝坻",
            "id": 120115
          },
          {
            "name": "滨海",
            "id": 120116
          },
          {
            "name": "宁河",
            "id": 120221
          },
          {
            "name": "静海",
            "id": 120223
          },
          {
            "name": "蓟县",
            "id": 120225
          }
        ]
      }
    ]
  },
  {
    "name": "河北",
    "id": 130000,
    "child": [
      {
        "name": "石家庄",
        "id": 130100,
        "child": [
          {
            "name": "长安",
            "id": 130102
          },
          {
            "name": "桥东",
            "id": 130103
          },
          {
            "name": "桥西",
            "id": 130104
          },
          {
            "name": "新华",
            "id": 130105
          },
          {
            "name": "井陉矿",
            "id": 130107
          },
          {
            "name": "裕华",
            "id": 130108
          },
          {
            "name": "井陉",
            "id": 130121
          },
          {
            "name": "正定",
            "id": 130123
          },
          {
            "name": "栾城",
            "id": 130124
          },
          {
            "name": "行唐",
            "id": 130125
          },
          {
            "name": "灵寿",
            "id": 130126
          },
          {
            "name": "高邑",
            "id": 130127
          },
          {
            "name": "深泽",
            "id": 130128
          },
          {
            "name": "赞皇",
            "id": 130129
          },
          {
            "name": "无极",
            "id": 130130
          },
          {
            "name": "平山",
            "id": 130131
          },
          {
            "name": "元氏",
            "id": 130132
          },
          {
            "name": "赵县",
            "id": 130133
          },
          {
            "name": "辛集",
            "id": 130181
          },
          {
            "name": "藁城",
            "id": 130182
          },
          {
            "name": "晋州",
            "id": 130183
          },
          {
            "name": "新乐",
            "id": 130184
          },
          {
            "name": "鹿泉",
            "id": 130185
          }
        ]
      },
      {
        "name": "唐山",
        "id": 130200,
        "child": [
          {
            "name": "路南",
            "id": 130202
          },
          {
            "name": "路北",
            "id": 130203
          },
          {
            "name": "古冶",
            "id": 130204
          },
          {
            "name": "开平",
            "id": 130205
          },
          {
            "name": "丰南",
            "id": 130207
          },
          {
            "name": "丰润",
            "id": 130208
          },
          {
            "name": "滦县",
            "id": 130223
          },
          {
            "name": "滦南",
            "id": 130224
          },
          {
            "name": "乐亭",
            "id": 130225
          },
          {
            "name": "迁西",
            "id": 130227
          },
          {
            "name": "玉田",
            "id": 130229
          },
          {
            "name": "曹妃甸",
            "id": 130230
          },
          {
            "name": "遵化",
            "id": 130281
          },
          {
            "name": "迁安",
            "id": 130283
          }
        ]
      },
      {
        "name": "张家口",
        "id": 130700,
        "child": [
          {
            "name": "桥东",
            "id": 130702
          },
          {
            "name": "桥西",
            "id": 130703
          },
          {
            "name": "宣化区",
            "id": 130705
          },
          {
            "name": "下花园",
            "id": 130706
          },
          {
            "name": "宣化县",
            "id": 130721
          },
          {
            "name": "张北",
            "id": 130722
          },
          {
            "name": "康保",
            "id": 130723
          },
          {
            "name": "沽源",
            "id": 130724
          },
          {
            "name": "尚义",
            "id": 130725
          },
          {
            "name": "蔚县",
            "id": 130726
          },
          {
            "name": "阳原",
            "id": 130727
          },
          {
            "name": "怀安",
            "id": 130728
          },
          {
            "name": "万全",
            "id": 130729
          },
          {
            "name": "怀来",
            "id": 130730
          },
          {
            "name": "涿鹿",
            "id": 130731
          },
          {
            "name": "赤城",
            "id": 130732
          },
          {
            "name": "崇礼",
            "id": 130733
          }
        ]
      },
      {
        "name": "承德",
        "id": 130800,
        "child": [
          {
            "name": "双桥",
            "id": 130802
          },
          {
            "name": "双滦",
            "id": 130803
          },
          {
            "name": "鹰手营子矿",
            "id": 130804
          },
          {
            "name": "承德",
            "id": 130821
          },
          {
            "name": "兴隆",
            "id": 130822
          },
          {
            "name": "平泉",
            "id": 130823
          },
          {
            "name": "滦平",
            "id": 130824
          },
          {
            "name": "隆化",
            "id": 130825
          },
          {
            "name": "丰宁",
            "id": 130826
          },
          {
            "name": "宽城",
            "id": 130827
          },
          {
            "name": "围场",
            "id": 130828
          }
        ]
      },
      {
        "name": "沧州",
        "id": 130900,
        "child": [
          {
            "name": "新华",
            "id": 130902
          },
          {
            "name": "运河",
            "id": 130903
          },
          {
            "name": "沧县",
            "id": 130921
          },
          {
            "name": "青县",
            "id": 130922
          },
          {
            "name": "东光",
            "id": 130923
          },
          {
            "name": "海兴",
            "id": 130924
          },
          {
            "name": "盐山",
            "id": 130925
          },
          {
            "name": "肃宁",
            "id": 130926
          },
          {
            "name": "南皮",
            "id": 130927
          },
          {
            "name": "吴桥",
            "id": 130928
          },
          {
            "name": "献县",
            "id": 130929
          },
          {
            "name": "孟村",
            "id": 130930
          },
          {
            "name": "泊头",
            "id": 130981
          },
          {
            "name": "任丘",
            "id": 130982
          },
          {
            "name": "黄骅",
            "id": 130983
          },
          {
            "name": "河间",
            "id": 130984
          }
        ]
      },
      {
        "name": "廊坊",
        "id": 131000,
        "child": [
          {
            "name": "安次",
            "id": 131002
          },
          {
            "name": "广阳",
            "id": 131003
          },
          {
            "name": "固安",
            "id": 131022
          },
          {
            "name": "永清",
            "id": 131023
          },
          {
            "name": "香河",
            "id": 131024
          },
          {
            "name": "大城",
            "id": 131025
          },
          {
            "name": "文安",
            "id": 131026
          },
          {
            "name": "大厂",
            "id": 131028
          },
          {
            "name": "霸州",
            "id": 131081
          },
          {
            "name": "三河",
            "id": 131082
          }
        ]
      },
      {
        "name": "衡水",
        "id": 131100,
        "child": [
          {
            "name": "桃城",
            "id": 131102
          },
          {
            "name": "枣强",
            "id": 131121
          },
          {
            "name": "武邑",
            "id": 131122
          },
          {
            "name": "武强",
            "id": 131123
          },
          {
            "name": "饶阳",
            "id": 131124
          },
          {
            "name": "安平",
            "id": 131125
          },
          {
            "name": "故城",
            "id": 131126
          },
          {
            "name": "景县",
            "id": 131127
          },
          {
            "name": "阜城",
            "id": 131128
          },
          {
            "name": "冀州",
            "id": 131181
          },
          {
            "name": "深州",
            "id": 131182
          }
        ]
      },
      {
        "name": "秦皇岛",
        "id": 130300,
        "child": [
          {
            "name": "海港",
            "id": 130302
          },
          {
            "name": "山海关",
            "id": 130303
          },
          {
            "name": "北戴河",
            "id": 130304
          },
          {
            "name": "青龙",
            "id": 130321
          },
          {
            "name": "昌黎",
            "id": 130322
          },
          {
            "name": "抚宁",
            "id": 130323
          },
          {
            "name": "卢龙",
            "id": 130324
          }
        ]
      },
      {
        "name": "邯郸",
        "id": 130400,
        "child": [
          {
            "name": "邯山",
            "id": 130402
          },
          {
            "name": "丛台",
            "id": 130403
          },
          {
            "name": "复兴",
            "id": 130404
          },
          {
            "name": "峰峰矿",
            "id": 130406
          },
          {
            "name": "邯郸",
            "id": 130421
          },
          {
            "name": "临漳",
            "id": 130423
          },
          {
            "name": "成安",
            "id": 130424
          },
          {
            "name": "大名",
            "id": 130425
          },
          {
            "name": "涉县",
            "id": 130426
          },
          {
            "name": "磁县",
            "id": 130427
          },
          {
            "name": "肥乡",
            "id": 130428
          },
          {
            "name": "永年",
            "id": 130429
          },
          {
            "name": "邱县",
            "id": 130430
          },
          {
            "name": "鸡泽",
            "id": 130431
          },
          {
            "name": "广平",
            "id": 130432
          },
          {
            "name": "馆陶",
            "id": 130433
          },
          {
            "name": "魏县",
            "id": 130434
          },
          {
            "name": "曲周",
            "id": 130435
          },
          {
            "name": "武安",
            "id": 130481
          }
        ]
      },
      {
        "name": "邢台",
        "id": 130500,
        "child": [
          {
            "name": "桥东",
            "id": 130502
          },
          {
            "name": "桥西",
            "id": 130503
          },
          {
            "name": "邢台",
            "id": 130521
          },
          {
            "name": "临城",
            "id": 130522
          },
          {
            "name": "内丘",
            "id": 130523
          },
          {
            "name": "柏乡",
            "id": 130524
          },
          {
            "name": "隆尧",
            "id": 130525
          },
          {
            "name": "任县",
            "id": 130526
          },
          {
            "name": "南和",
            "id": 130527
          },
          {
            "name": "宁晋",
            "id": 130528
          },
          {
            "name": "巨鹿",
            "id": 130529
          },
          {
            "name": "新河",
            "id": 130530
          },
          {
            "name": "广宗",
            "id": 130531
          },
          {
            "name": "平乡",
            "id": 130532
          },
          {
            "name": "威县",
            "id": 130533
          },
          {
            "name": "清河",
            "id": 130534
          },
          {
            "name": "临西",
            "id": 130535
          },
          {
            "name": "南宫",
            "id": 130581
          },
          {
            "name": "沙河",
            "id": 130582
          }
        ]
      },
      {
        "name": "保定",
        "id": 130600,
        "child": [
          {
            "name": "南市",
            "id": 130604
          },
          {
            "name": "满城",
            "id": 130621
          },
          {
            "name": "清苑",
            "id": 130622
          },
          {
            "name": "涞水",
            "id": 130623
          },
          {
            "name": "阜平",
            "id": 130624
          },
          {
            "name": "徐水",
            "id": 130625
          },
          {
            "name": "定兴",
            "id": 130626
          },
          {
            "name": "唐县",
            "id": 130627
          },
          {
            "name": "高阳",
            "id": 130628
          },
          {
            "name": "容城",
            "id": 130629
          },
          {
            "name": "涞源",
            "id": 130630
          },
          {
            "name": "望都",
            "id": 130631
          },
          {
            "name": "安新",
            "id": 130632
          },
          {
            "name": "易县",
            "id": 130633
          },
          {
            "name": "曲阳",
            "id": 130634
          },
          {
            "name": "蠡县",
            "id": 130635
          },
          {
            "name": "顺平",
            "id": 130636
          },
          {
            "name": "博野",
            "id": 130637
          },
          {
            "name": "雄县",
            "id": 130638
          },
          {
            "name": "涿州",
            "id": 130681
          },
          {
            "name": "定州",
            "id": 130682
          },
          {
            "name": "安国",
            "id": 130683
          },
          {
            "name": "高碑店",
            "id": 130684
          },
          {
            "name": "新市",
            "id": 130602
          },
          {
            "name": "北市",
            "id": 130603
          }
        ]
      }
    ]
  },
  {
    "name": "山西",
    "id": 140000,
    "child": [
      {
        "name": "太原",
        "id": 140100,
        "child": [
          {
            "name": "小店",
            "id": 140105
          },
          {
            "name": "迎泽",
            "id": 140106
          },
          {
            "name": "杏花岭",
            "id": 140107
          },
          {
            "name": "尖草坪",
            "id": 140108
          },
          {
            "name": "万柏林",
            "id": 140109
          },
          {
            "name": "晋源",
            "id": 140110
          },
          {
            "name": "清徐",
            "id": 140121
          },
          {
            "name": "阳曲",
            "id": 140122
          },
          {
            "name": "娄烦",
            "id": 140123
          },
          {
            "name": "古交",
            "id": 140181
          }
        ]
      },
      {
        "name": "大同",
        "id": 140200,
        "child": [
          {
            "name": "城区",
            "id": 140202
          },
          {
            "name": "矿区",
            "id": 140203
          },
          {
            "name": "南郊",
            "id": 140211
          },
          {
            "name": "新荣",
            "id": 140212
          },
          {
            "name": "阳高",
            "id": 140221
          },
          {
            "name": "天镇",
            "id": 140222
          },
          {
            "name": "广灵",
            "id": 140223
          },
          {
            "name": "灵丘",
            "id": 140224
          },
          {
            "name": "浑源",
            "id": 140225
          },
          {
            "name": "左云",
            "id": 140226
          },
          {
            "name": "大同",
            "id": 140227
          }
        ]
      },
      {
        "name": "阳泉",
        "id": 140300,
        "child": [
          {
            "name": "城区",
            "id": 140302
          },
          {
            "name": "矿区",
            "id": 140303
          },
          {
            "name": "郊区",
            "id": 140311
          },
          {
            "name": "平定",
            "id": 140321
          },
          {
            "name": "盂县",
            "id": 140322
          }
        ]
      },
      {
        "name": "长治",
        "id": 140400,
        "child": [
          {
            "name": "长治",
            "id": 140421
          },
          {
            "name": "襄垣",
            "id": 140423
          },
          {
            "name": "屯留",
            "id": 140424
          },
          {
            "name": "平顺",
            "id": 140425
          },
          {
            "name": "黎城",
            "id": 140426
          },
          {
            "name": "壶关",
            "id": 140427
          },
          {
            "name": "长子",
            "id": 140428
          },
          {
            "name": "武乡",
            "id": 140429
          },
          {
            "name": "沁县",
            "id": 140430
          },
          {
            "name": "沁源",
            "id": 140431
          },
          {
            "name": "潞城",
            "id": 140481
          },
          {
            "name": "城区",
            "id": 140482
          },
          {
            "name": "郊区",
            "id": 140483
          }
        ]
      },
      {
        "name": "晋城",
        "id": 140500,
        "child": [
          {
            "name": "城区",
            "id": 140502
          },
          {
            "name": "沁水",
            "id": 140521
          },
          {
            "name": "阳城",
            "id": 140522
          },
          {
            "name": "陵川",
            "id": 140524
          },
          {
            "name": "泽州",
            "id": 140525
          },
          {
            "name": "高平",
            "id": 140581
          }
        ]
      },
      {
        "name": "朔州",
        "id": 140600,
        "child": [
          {
            "name": "朔城",
            "id": 140602
          },
          {
            "name": "平鲁",
            "id": 140603
          },
          {
            "name": "山阴",
            "id": 140621
          },
          {
            "name": "应县",
            "id": 140622
          },
          {
            "name": "右玉",
            "id": 140623
          },
          {
            "name": "怀仁",
            "id": 140624
          }
        ]
      },
      {
        "name": "晋中",
        "id": 140700,
        "child": [
          {
            "name": "榆次",
            "id": 140702
          },
          {
            "name": "榆社",
            "id": 140721
          },
          {
            "name": "左权",
            "id": 140722
          },
          {
            "name": "和顺",
            "id": 140723
          },
          {
            "name": "昔阳",
            "id": 140724
          },
          {
            "name": "寿阳",
            "id": 140725
          },
          {
            "name": "太谷",
            "id": 140726
          },
          {
            "name": "祁县",
            "id": 140727
          },
          {
            "name": "平遥",
            "id": 140728
          },
          {
            "name": "灵石",
            "id": 140729
          },
          {
            "name": "介休",
            "id": 140781
          }
        ]
      },
      {
        "name": "运城",
        "id": 140800,
        "child": [
          {
            "name": "盐湖",
            "id": 140802
          },
          {
            "name": "临猗",
            "id": 140821
          },
          {
            "name": "万荣",
            "id": 140822
          },
          {
            "name": "闻喜",
            "id": 140823
          },
          {
            "name": "稷山",
            "id": 140824
          },
          {
            "name": "新绛",
            "id": 140825
          },
          {
            "name": "绛县",
            "id": 140826
          },
          {
            "name": "垣曲",
            "id": 140827
          },
          {
            "name": "夏县",
            "id": 140828
          },
          {
            "name": "平陆",
            "id": 140829
          },
          {
            "name": "芮城",
            "id": 140830
          },
          {
            "name": "永济",
            "id": 140881
          },
          {
            "name": "河津",
            "id": 140882
          }
        ]
      },
      {
        "name": "忻州",
        "id": 140900,
        "child": [
          {
            "name": "忻府",
            "id": 140902
          },
          {
            "name": "定襄",
            "id": 140921
          },
          {
            "name": "五台",
            "id": 140922
          },
          {
            "name": "代县",
            "id": 140923
          },
          {
            "name": "繁峙",
            "id": 140924
          },
          {
            "name": "宁武",
            "id": 140925
          },
          {
            "name": "静乐",
            "id": 140926
          },
          {
            "name": "神池",
            "id": 140927
          },
          {
            "name": "五寨",
            "id": 140928
          },
          {
            "name": "岢岚",
            "id": 140929
          },
          {
            "name": "河曲",
            "id": 140930
          },
          {
            "name": "保德",
            "id": 140931
          },
          {
            "name": "偏关",
            "id": 140932
          },
          {
            "name": "原平",
            "id": 140981
          }
        ]
      },
      {
        "name": "临汾",
        "id": 141000,
        "child": [
          {
            "name": "尧都",
            "id": 141002
          },
          {
            "name": "曲沃",
            "id": 141021
          },
          {
            "name": "翼城",
            "id": 141022
          },
          {
            "name": "襄汾",
            "id": 141023
          },
          {
            "name": "洪洞",
            "id": 141024
          },
          {
            "name": "古县",
            "id": 141025
          },
          {
            "name": "安泽",
            "id": 141026
          },
          {
            "name": "浮山",
            "id": 141027
          },
          {
            "name": "吉县",
            "id": 141028
          },
          {
            "name": "乡宁",
            "id": 141029
          },
          {
            "name": "大宁",
            "id": 141030
          },
          {
            "name": "隰县",
            "id": 141031
          },
          {
            "name": "永和",
            "id": 141032
          },
          {
            "name": "蒲县",
            "id": 141033
          },
          {
            "name": "汾西",
            "id": 141034
          },
          {
            "name": "侯马",
            "id": 141081
          },
          {
            "name": "霍州",
            "id": 141082
          }
        ]
      },
      {
        "name": "吕梁",
        "id": 141100,
        "child": [
          {
            "name": "离石",
            "id": 141102
          },
          {
            "name": "文水",
            "id": 141121
          },
          {
            "name": "交城",
            "id": 141122
          },
          {
            "name": "兴县",
            "id": 141123
          },
          {
            "name": "临县",
            "id": 141124
          },
          {
            "name": "柳林",
            "id": 141125
          },
          {
            "name": "石楼",
            "id": 141126
          },
          {
            "name": "岚县",
            "id": 141127
          },
          {
            "name": "方山",
            "id": 141128
          },
          {
            "name": "中阳",
            "id": 141129
          },
          {
            "name": "交口",
            "id": 141130
          },
          {
            "name": "孝义",
            "id": 141181
          },
          {
            "name": "汾阳",
            "id": 141182
          }
        ]
      }
    ]
  },
  {
    "name": "内蒙古",
    "id": 150000,
    "child": [
      {
        "name": "呼和浩特",
        "id": 150100,
        "child": [
          {
            "name": "新城",
            "id": 150102
          },
          {
            "name": "回民",
            "id": 150103
          },
          {
            "name": "玉泉",
            "id": 150104
          },
          {
            "name": "赛罕",
            "id": 150105
          },
          {
            "name": "土默特左",
            "id": 150121
          },
          {
            "name": "托克托",
            "id": 150122
          },
          {
            "name": "和林格尔",
            "id": 150123
          },
          {
            "name": "清水河",
            "id": 150124
          },
          {
            "name": "武川",
            "id": 150125
          }
        ]
      },
      {
        "name": "包头",
        "id": 150200,
        "child": [
          {
            "name": "东河",
            "id": 150202
          },
          {
            "name": "昆都仑",
            "id": 150203
          },
          {
            "name": "青山",
            "id": 150204
          },
          {
            "name": "石拐",
            "id": 150205
          },
          {
            "name": "白云矿区",
            "id": 150206
          },
          {
            "name": "九原",
            "id": 150207
          },
          {
            "name": "土默特右",
            "id": 150221
          },
          {
            "name": "固阳",
            "id": 150222
          },
          {
            "name": "达尔罕茂明安联合",
            "id": 150223
          }
        ]
      },
      {
        "name": "乌海",
        "id": 150300,
        "child": [
          {
            "name": "海勃湾",
            "id": 150302
          },
          {
            "name": "海南",
            "id": 150303
          },
          {
            "name": "乌达",
            "id": 150304
          }
        ]
      },
      {
        "name": "赤峰",
        "id": 150400,
        "child": [
          {
            "name": "红山",
            "id": 150402
          },
          {
            "name": "元宝山",
            "id": 150403
          },
          {
            "name": "松山",
            "id": 150404
          },
          {
            "name": "阿鲁科尔沁",
            "id": 150421
          },
          {
            "name": "巴林左",
            "id": 150422
          },
          {
            "name": "巴林右",
            "id": 150423
          },
          {
            "name": "林西",
            "id": 150424
          },
          {
            "name": "克什克腾",
            "id": 150425
          },
          {
            "name": "翁牛特",
            "id": 150426
          },
          {
            "name": "喀喇沁",
            "id": 150428
          },
          {
            "name": "宁城",
            "id": 150429
          },
          {
            "name": "敖汉",
            "id": 150430
          }
        ]
      },
      {
        "name": "通辽",
        "id": 150500,
        "child": [
          {
            "name": "科尔沁",
            "id": 150502
          },
          {
            "name": "科尔沁左翼中",
            "id": 150521
          },
          {
            "name": "科尔沁左翼后",
            "id": 150522
          },
          {
            "name": "开鲁",
            "id": 150523
          },
          {
            "name": "库伦",
            "id": 150524
          },
          {
            "name": "奈曼",
            "id": 150525
          },
          {
            "name": "扎鲁特",
            "id": 150526
          },
          {
            "name": "霍林郭勒",
            "id": 150581
          }
        ]
      },
      {
        "name": "鄂尔多斯",
        "id": 150600,
        "child": [
          {
            "name": "东胜",
            "id": 150602
          },
          {
            "name": "达拉特",
            "id": 150621
          },
          {
            "name": "准格尔",
            "id": 150622
          },
          {
            "name": "鄂托克前",
            "id": 150623
          },
          {
            "name": "鄂托克",
            "id": 150624
          },
          {
            "name": "杭锦",
            "id": 150625
          },
          {
            "name": "乌审",
            "id": 150626
          },
          {
            "name": "伊金霍洛",
            "id": 150627
          }
        ]
      },
      {
        "name": "呼伦贝尔",
        "id": 150700,
        "child": [
          {
            "name": "海拉尔",
            "id": 150702
          },
          {
            "name": "扎赉诺尔",
            "id": 150703
          },
          {
            "name": "阿荣",
            "id": 150721
          },
          {
            "name": "莫力达瓦",
            "id": 150722
          },
          {
            "name": "鄂伦春",
            "id": 150723
          },
          {
            "name": "鄂温克",
            "id": 150724
          },
          {
            "name": "陈巴尔虎",
            "id": 150725
          },
          {
            "name": "新巴尔虎左",
            "id": 150726
          },
          {
            "name": "新巴尔虎右",
            "id": 150727
          },
          {
            "name": "满洲里",
            "id": 150781
          },
          {
            "name": "牙克石",
            "id": 150782
          },
          {
            "name": "扎兰屯",
            "id": 150783
          },
          {
            "name": "额尔古纳",
            "id": 150784
          },
          {
            "name": "根河",
            "id": 150785
          }
        ]
      },
      {
        "name": "巴彦淖尔",
        "id": 150800,
        "child": [
          {
            "name": "临河",
            "id": 150802
          },
          {
            "name": "五原",
            "id": 150821
          },
          {
            "name": "磴口",
            "id": 150822
          },
          {
            "name": "乌拉特前",
            "id": 150823
          },
          {
            "name": "乌拉特中",
            "id": 150824
          },
          {
            "name": "乌拉特后",
            "id": 150825
          },
          {
            "name": "杭锦后",
            "id": 150826
          }
        ]
      },
      {
        "name": "乌兰察布",
        "id": 150900,
        "child": [
          {
            "name": "集宁",
            "id": 150902
          },
          {
            "name": "卓资",
            "id": 150921
          },
          {
            "name": "化德",
            "id": 150922
          },
          {
            "name": "商都",
            "id": 150923
          },
          {
            "name": "兴和",
            "id": 150924
          },
          {
            "name": "凉城",
            "id": 150925
          },
          {
            "name": "察哈尔右翼前",
            "id": 150926
          },
          {
            "name": "察哈尔右翼中",
            "id": 150927
          },
          {
            "name": "察哈尔右翼后",
            "id": 150928
          },
          {
            "name": "四子王",
            "id": 150929
          },
          {
            "name": "丰镇",
            "id": 150981
          }
        ]
      },
      {
        "name": "兴安",
        "id": 152200,
        "child": [
          {
            "name": "乌兰浩特",
            "id": 152201
          },
          {
            "name": "阿尔山",
            "id": 152202
          },
          {
            "name": "科尔沁右翼前",
            "id": 152221
          },
          {
            "name": "科尔沁右翼中",
            "id": 152222
          },
          {
            "name": "扎赉特",
            "id": 152223
          },
          {
            "name": "突泉",
            "id": 152224
          }
        ]
      },
      {
        "name": "锡林郭勒",
        "id": 152500,
        "child": [
          {
            "name": "二连浩特",
            "id": 152501
          },
          {
            "name": "锡林浩特",
            "id": 152502
          },
          {
            "name": "阿巴嘎",
            "id": 152522
          },
          {
            "name": "苏尼特左",
            "id": 152523
          },
          {
            "name": "苏尼特右",
            "id": 152524
          },
          {
            "name": "东乌珠穆沁",
            "id": 152525
          },
          {
            "name": "西乌珠穆沁",
            "id": 152526
          },
          {
            "name": "太仆寺",
            "id": 152527
          },
          {
            "name": "镶黄",
            "id": 152528
          },
          {
            "name": "正镶白",
            "id": 152529
          },
          {
            "name": "正蓝",
            "id": 152530
          },
          {
            "name": "多伦",
            "id": 152531
          }
        ]
      },
      {
        "name": "阿拉善",
        "id": 152900,
        "child": [
          {
            "name": "阿拉善左",
            "id": 152921
          },
          {
            "name": "阿拉善右",
            "id": 152922
          },
          {
            "name": "额济纳",
            "id": 152923
          }
        ]
      }
    ]
  },
  {
    "name": "辽宁",
    "id": 210000,
    "child": [
      {
        "name": "沈阳",
        "id": 210100,
        "child": [
          {
            "name": "和平",
            "id": 210102
          },
          {
            "name": "沈河",
            "id": 210103
          },
          {
            "name": "大东",
            "id": 210104
          },
          {
            "name": "皇姑",
            "id": 210105
          },
          {
            "name": "铁西",
            "id": 210106
          },
          {
            "name": "苏家屯",
            "id": 210111
          },
          {
            "name": "东陵",
            "id": 210112
          },
          {
            "name": "于洪",
            "id": 210114
          },
          {
            "name": "辽中",
            "id": 210122
          },
          {
            "name": "康平",
            "id": 210123
          },
          {
            "name": "法库",
            "id": 210124
          },
          {
            "name": "新民",
            "id": 210181
          },
          {
            "name": "沈北",
            "id": 210184
          }
        ]
      },
      {
        "name": "大连",
        "id": 210200,
        "child": [
          {
            "name": "中山",
            "id": 210202
          },
          {
            "name": "西岗",
            "id": 210203
          },
          {
            "name": "沙河口",
            "id": 210204
          },
          {
            "name": "甘井子",
            "id": 210211
          },
          {
            "name": "旅顺口",
            "id": 210212
          },
          {
            "name": "金州",
            "id": 210213
          },
          {
            "name": "长海",
            "id": 210224
          },
          {
            "name": "瓦房店",
            "id": 210281
          },
          {
            "name": "普兰店",
            "id": 210282
          },
          {
            "name": "庄河",
            "id": 210283
          }
        ]
      },
      {
        "name": "鞍山",
        "id": 210300,
        "child": [
          {
            "name": "铁东",
            "id": 210302
          },
          {
            "name": "铁西",
            "id": 210303
          },
          {
            "name": "立山",
            "id": 210304
          },
          {
            "name": "千山",
            "id": 210311
          },
          {
            "name": "台安",
            "id": 210321
          },
          {
            "name": "岫岩",
            "id": 210323
          },
          {
            "name": "海城",
            "id": 210381
          }
        ]
      },
      {
        "name": "抚顺",
        "id": 210400,
        "child": [
          {
            "name": "新抚",
            "id": 210402
          },
          {
            "name": "东洲",
            "id": 210403
          },
          {
            "name": "望花",
            "id": 210404
          },
          {
            "name": "顺城",
            "id": 210411
          },
          {
            "name": "抚顺",
            "id": 210421
          },
          {
            "name": "新宾",
            "id": 210422
          },
          {
            "name": "清原",
            "id": 210423
          }
        ]
      },
      {
        "name": "本溪",
        "id": 210500,
        "child": [
          {
            "name": "平山",
            "id": 210502
          },
          {
            "name": "溪湖",
            "id": 210503
          },
          {
            "name": "明山",
            "id": 210504
          },
          {
            "name": "南芬",
            "id": 210505
          },
          {
            "name": "本溪",
            "id": 210521
          },
          {
            "name": "桓仁",
            "id": 210522
          }
        ]
      },
      {
        "name": "丹东",
        "id": 210600,
        "child": [
          {
            "name": "元宝",
            "id": 210602
          },
          {
            "name": "振兴",
            "id": 210603
          },
          {
            "name": "振安",
            "id": 210604
          },
          {
            "name": "宽甸",
            "id": 210624
          },
          {
            "name": "东港",
            "id": 210681
          },
          {
            "name": "凤城",
            "id": 210682
          }
        ]
      },
      {
        "name": "锦州",
        "id": 210700,
        "child": [
          {
            "name": "古塔",
            "id": 210702
          },
          {
            "name": "凌河",
            "id": 210703
          },
          {
            "name": "太和",
            "id": 210711
          },
          {
            "name": "黑山",
            "id": 210726
          },
          {
            "name": "义县",
            "id": 210727
          },
          {
            "name": "凌海",
            "id": 210781
          },
          {
            "name": "北镇",
            "id": 210782
          }
        ]
      },
      {
        "name": "营口",
        "id": 210800,
        "child": [
          {
            "name": "站前",
            "id": 210802
          },
          {
            "name": "西市",
            "id": 210803
          },
          {
            "name": "鲅鱼圈",
            "id": 210804
          },
          {
            "name": "老边",
            "id": 210811
          },
          {
            "name": "盖州",
            "id": 210881
          },
          {
            "name": "大石桥",
            "id": 210882
          }
        ]
      },
      {
        "name": "阜新",
        "id": 210900,
        "child": [
          {
            "name": "海州",
            "id": 210902
          },
          {
            "name": "新邱",
            "id": 210903
          },
          {
            "name": "太平",
            "id": 210904
          },
          {
            "name": "清河门",
            "id": 210905
          },
          {
            "name": "细河",
            "id": 210911
          },
          {
            "name": "阜新",
            "id": 210921
          },
          {
            "name": "彰武",
            "id": 210922
          }
        ]
      },
      {
        "name": "辽阳",
        "id": 211000,
        "child": [
          {
            "name": "白塔",
            "id": 211002
          },
          {
            "name": "文圣",
            "id": 211003
          },
          {
            "name": "宏伟",
            "id": 211004
          },
          {
            "name": "弓长岭",
            "id": 211005
          },
          {
            "name": "太子河",
            "id": 211011
          },
          {
            "name": "辽阳",
            "id": 211021
          },
          {
            "name": "灯塔",
            "id": 211081
          }
        ]
      },
      {
        "name": "盘锦",
        "id": 211100,
        "child": [
          {
            "name": "双台子",
            "id": 211102
          },
          {
            "name": "兴隆台",
            "id": 211103
          },
          {
            "name": "大洼",
            "id": 211121
          },
          {
            "name": "盘山",
            "id": 211122
          }
        ]
      },
      {
        "name": "铁岭",
        "id": 211200,
        "child": [
          {
            "name": "银州",
            "id": 211202
          },
          {
            "name": "清河",
            "id": 211204
          },
          {
            "name": "铁岭",
            "id": 211221
          },
          {
            "name": "西丰",
            "id": 211223
          },
          {
            "name": "昌图",
            "id": 211224
          },
          {
            "name": "调兵山",
            "id": 211281
          },
          {
            "name": "开原",
            "id": 211282
          }
        ]
      },
      {
        "name": "朝阳",
        "id": 211300,
        "child": [
          {
            "name": "双塔",
            "id": 211302
          },
          {
            "name": "龙城",
            "id": 211303
          },
          {
            "name": "朝阳",
            "id": 211321
          },
          {
            "name": "建平",
            "id": 211322
          },
          {
            "name": "喀左",
            "id": 211324
          },
          {
            "name": "北票",
            "id": 211381
          },
          {
            "name": "凌源",
            "id": 211382
          }
        ]
      },
      {
        "name": "葫芦岛",
        "id": 211400,
        "child": [
          {
            "name": "连山",
            "id": 211402
          },
          {
            "name": "龙港",
            "id": 211403
          },
          {
            "name": "南票",
            "id": 211404
          },
          {
            "name": "绥中",
            "id": 211421
          },
          {
            "name": "建昌",
            "id": 211422
          },
          {
            "name": "兴城",
            "id": 211481
          }
        ]
      }
    ]
  },
  {
    "name": "吉林",
    "id": 220000,
    "child": [
      {
        "name": "长春",
        "id": 220100,
        "child": [
          {
            "name": "南关",
            "id": 220102
          },
          {
            "name": "宽城",
            "id": 220103
          },
          {
            "name": "朝阳",
            "id": 220104
          },
          {
            "name": "二道",
            "id": 220105
          },
          {
            "name": "绿园",
            "id": 220106
          },
          {
            "name": "双阳",
            "id": 220112
          },
          {
            "name": "农安",
            "id": 220122
          },
          {
            "name": "九台",
            "id": 220181
          },
          {
            "name": "榆树",
            "id": 220182
          },
          {
            "name": "德惠",
            "id": 220183
          }
        ]
      },
      {
        "name": "吉林",
        "id": 220200,
        "child": [
          {
            "name": "昌邑",
            "id": 220202
          },
          {
            "name": "龙潭",
            "id": 220203
          },
          {
            "name": "船营",
            "id": 220204
          },
          {
            "name": "丰满",
            "id": 220211
          },
          {
            "name": "永吉",
            "id": 220221
          },
          {
            "name": "蛟河",
            "id": 220281
          },
          {
            "name": "桦甸",
            "id": 220282
          },
          {
            "name": "舒兰",
            "id": 220283
          },
          {
            "name": "磐石",
            "id": 220284
          }
        ]
      },
      {
        "name": "四平",
        "id": 220300,
        "child": [
          {
            "name": "铁西",
            "id": 220302
          },
          {
            "name": "铁东",
            "id": 220303
          },
          {
            "name": "梨树",
            "id": 220322
          },
          {
            "name": "伊通",
            "id": 220323
          },
          {
            "name": "公主岭",
            "id": 220381
          },
          {
            "name": "双辽",
            "id": 220382
          }
        ]
      },
      {
        "name": "辽源",
        "id": 220400,
        "child": [
          {
            "name": "龙山",
            "id": 220402
          },
          {
            "name": "西安",
            "id": 220403
          },
          {
            "name": "东丰",
            "id": 220421
          },
          {
            "name": "东辽",
            "id": 220422
          }
        ]
      },
      {
        "name": "通化",
        "id": 220500,
        "child": [
          {
            "name": "东昌",
            "id": 220502
          },
          {
            "name": "二道江",
            "id": 220503
          },
          {
            "name": "通化",
            "id": 220521
          },
          {
            "name": "辉南",
            "id": 220523
          },
          {
            "name": "柳河",
            "id": 220524
          },
          {
            "name": "梅河口",
            "id": 220581
          },
          {
            "name": "集安",
            "id": 220582
          }
        ]
      },
      {
        "name": "白山",
        "id": 220600,
        "child": [
          {
            "name": "浑江",
            "id": 220602
          },
          {
            "name": "抚松",
            "id": 220621
          },
          {
            "name": "靖宇",
            "id": 220622
          },
          {
            "name": "长白",
            "id": 220623
          },
          {
            "name": "江源",
            "id": 220625
          },
          {
            "name": "临江",
            "id": 220681
          }
        ]
      },
      {
        "name": "松原",
        "id": 220700,
        "child": [
          {
            "name": "宁江",
            "id": 220702
          },
          {
            "name": "前郭",
            "id": 220721
          },
          {
            "name": "长岭",
            "id": 220722
          },
          {
            "name": "乾安",
            "id": 220723
          },
          {
            "name": "扶余",
            "id": 220724
          }
        ]
      },
      {
        "name": "白城",
        "id": 220800,
        "child": [
          {
            "name": "洮北",
            "id": 220802
          },
          {
            "name": "镇赉",
            "id": 220821
          },
          {
            "name": "通榆",
            "id": 220822
          },
          {
            "name": "洮南",
            "id": 220881
          },
          {
            "name": "大安",
            "id": 220882
          }
        ]
      },
      {
        "name": "延边朝鲜族",
        "id": 222400,
        "child": [
          {
            "name": "延吉",
            "id": 222401
          },
          {
            "name": "图们",
            "id": 222402
          },
          {
            "name": "敦化",
            "id": 222403
          },
          {
            "name": "珲春",
            "id": 222404
          },
          {
            "name": "龙井",
            "id": 222405
          },
          {
            "name": "和龙",
            "id": 222406
          },
          {
            "name": "汪清",
            "id": 222424
          },
          {
            "name": "安图",
            "id": 222426
          }
        ]
      }
    ]
  },
  {
    "name": "黑龙江",
    "id": 230000,
    "child": [
      {
        "name": "哈尔滨",
        "id": 230100,
        "child": [
          {
            "name": "道里",
            "id": 230102
          },
          {
            "name": "南岗",
            "id": 230103
          },
          {
            "name": "道外",
            "id": 230104
          },
          {
            "name": "香坊",
            "id": 230106
          },
          {
            "name": "平房",
            "id": 230108
          },
          {
            "name": "松北",
            "id": 230109
          },
          {
            "name": "呼兰",
            "id": 230111
          },
          {
            "name": "依兰",
            "id": 230123
          },
          {
            "name": "方正",
            "id": 230124
          },
          {
            "name": "宾县",
            "id": 230125
          },
          {
            "name": "巴彦",
            "id": 230126
          },
          {
            "name": "木兰",
            "id": 230127
          },
          {
            "name": "通河",
            "id": 230128
          },
          {
            "name": "延寿",
            "id": 230129
          },
          {
            "name": "阿城",
            "id": 230181
          },
          {
            "name": "双城",
            "id": 230182
          },
          {
            "name": "尚志",
            "id": 230183
          },
          {
            "name": "五常",
            "id": 230184
          }
        ]
      },
      {
        "name": "齐齐哈尔",
        "id": 230200,
        "child": [
          {
            "name": "龙沙",
            "id": 230202
          },
          {
            "name": "建华",
            "id": 230203
          },
          {
            "name": "铁锋",
            "id": 230204
          },
          {
            "name": "昂昂溪",
            "id": 230205
          },
          {
            "name": "富拉尔基",
            "id": 230206
          },
          {
            "name": "碾子山",
            "id": 230207
          },
          {
            "name": "梅里斯达斡尔族",
            "id": 230208
          },
          {
            "name": "龙江",
            "id": 230221
          },
          {
            "name": "依安",
            "id": 230223
          },
          {
            "name": "泰来",
            "id": 230224
          },
          {
            "name": "甘南",
            "id": 230225
          },
          {
            "name": "富裕",
            "id": 230227
          },
          {
            "name": "克山",
            "id": 230229
          },
          {
            "name": "克东",
            "id": 230230
          },
          {
            "name": "拜泉",
            "id": 230231
          },
          {
            "name": "讷河",
            "id": 230281
          }
        ]
      },
      {
        "name": "鸡西",
        "id": 230300,
        "child": [
          {
            "name": "鸡冠",
            "id": 230302
          },
          {
            "name": "恒山",
            "id": 230303
          },
          {
            "name": "滴道",
            "id": 230304
          },
          {
            "name": "梨树",
            "id": 230305
          },
          {
            "name": "城子河",
            "id": 230306
          },
          {
            "name": "麻山",
            "id": 230307
          },
          {
            "name": "鸡东",
            "id": 230321
          },
          {
            "name": "虎林",
            "id": 230381
          },
          {
            "name": "密山",
            "id": 230382
          }
        ]
      },
      {
        "name": "鹤岗",
        "id": 230400,
        "child": [
          {
            "name": "向阳",
            "id": 230402
          },
          {
            "name": "工农",
            "id": 230403
          },
          {
            "name": "南山",
            "id": 230404
          },
          {
            "name": "兴安",
            "id": 230405
          },
          {
            "name": "东山",
            "id": 230406
          },
          {
            "name": "兴山",
            "id": 230407
          },
          {
            "name": "萝北",
            "id": 230421
          },
          {
            "name": "绥滨",
            "id": 230422
          }
        ]
      },
      {
        "name": "双鸭山",
        "id": 230500,
        "child": [
          {
            "name": "尖山",
            "id": 230502
          },
          {
            "name": "岭东",
            "id": 230503
          },
          {
            "name": "四方台",
            "id": 230505
          },
          {
            "name": "宝山",
            "id": 230506
          },
          {
            "name": "集贤",
            "id": 230521
          },
          {
            "name": "友谊",
            "id": 230522
          },
          {
            "name": "宝清",
            "id": 230523
          },
          {
            "name": "饶河",
            "id": 230524
          }
        ]
      },
      {
        "name": "大庆",
        "id": 230600,
        "child": [
          {
            "name": "萨尔图",
            "id": 230602
          },
          {
            "name": "龙凤",
            "id": 230603
          },
          {
            "name": "让胡路",
            "id": 230604
          },
          {
            "name": "红岗",
            "id": 230605
          },
          {
            "name": "大同",
            "id": 230606
          },
          {
            "name": "肇州",
            "id": 230621
          },
          {
            "name": "肇源",
            "id": 230622
          },
          {
            "name": "林甸",
            "id": 230623
          },
          {
            "name": "杜尔伯特",
            "id": 230624
          }
        ]
      },
      {
        "name": "伊春",
        "id": 230700,
        "child": [
          {
            "name": "伊春",
            "id": 230702
          },
          {
            "name": "南岔",
            "id": 230703
          },
          {
            "name": "友好",
            "id": 230704
          },
          {
            "name": "西林",
            "id": 230705
          },
          {
            "name": "翠峦",
            "id": 230706
          },
          {
            "name": "新青",
            "id": 230707
          },
          {
            "name": "美溪",
            "id": 230708
          },
          {
            "name": "金山屯",
            "id": 230709
          },
          {
            "name": "五营",
            "id": 230710
          },
          {
            "name": "乌马河",
            "id": 230711
          },
          {
            "name": "汤旺河",
            "id": 230712
          },
          {
            "name": "带岭",
            "id": 230713
          },
          {
            "name": "乌伊岭",
            "id": 230714
          },
          {
            "name": "红星",
            "id": 230715
          },
          {
            "name": "上甘岭",
            "id": 230716
          },
          {
            "name": "嘉荫",
            "id": 230722
          },
          {
            "name": "铁力",
            "id": 230781
          }
        ]
      },
      {
        "name": "佳木斯",
        "id": 230800,
        "child": [
          {
            "name": "向阳",
            "id": 230803
          },
          {
            "name": "前进",
            "id": 230804
          },
          {
            "name": "东风",
            "id": 230805
          },
          {
            "name": "郊区",
            "id": 230811
          },
          {
            "name": "桦南",
            "id": 230822
          },
          {
            "name": "桦川",
            "id": 230826
          },
          {
            "name": "汤原",
            "id": 230828
          },
          {
            "name": "抚远",
            "id": 230833
          },
          {
            "name": "同江",
            "id": 230881
          },
          {
            "name": "富锦",
            "id": 230882
          }
        ]
      },
      {
        "name": "七台河",
        "id": 230900,
        "child": [
          {
            "name": "新兴",
            "id": 230902
          },
          {
            "name": "桃山",
            "id": 230903
          },
          {
            "name": "茄子河",
            "id": 230904
          },
          {
            "name": "勃利",
            "id": 230921
          }
        ]
      },
      {
        "name": "牡丹江",
        "id": 231000,
        "child": [
          {
            "name": "东安",
            "id": 231002
          },
          {
            "name": "阳明",
            "id": 231003
          },
          {
            "name": "爱民",
            "id": 231004
          },
          {
            "name": "西安",
            "id": 231005
          },
          {
            "name": "东宁",
            "id": 231024
          },
          {
            "name": "林口",
            "id": 231025
          },
          {
            "name": "绥芬河",
            "id": 231081
          },
          {
            "name": "海林",
            "id": 231083
          },
          {
            "name": "宁安",
            "id": 231084
          },
          {
            "name": "穆棱",
            "id": 231085
          }
        ]
      },
      {
        "name": "黑河",
        "id": 231100,
        "child": [
          {
            "name": "爱辉",
            "id": 231102
          },
          {
            "name": "嫩江",
            "id": 231121
          },
          {
            "name": "逊克",
            "id": 231123
          },
          {
            "name": "孙吴",
            "id": 231124
          },
          {
            "name": "北安",
            "id": 231181
          },
          {
            "name": "五大连池",
            "id": 231182
          }
        ]
      },
      {
        "name": "绥化",
        "id": 231200,
        "child": [
          {
            "name": "北林",
            "id": 231202
          },
          {
            "name": "望奎",
            "id": 231221
          },
          {
            "name": "兰西",
            "id": 231222
          },
          {
            "name": "青冈",
            "id": 231223
          },
          {
            "name": "庆安",
            "id": 231224
          },
          {
            "name": "明水",
            "id": 231225
          },
          {
            "name": "绥棱",
            "id": 231226
          },
          {
            "name": "安达",
            "id": 231281
          },
          {
            "name": "肇东",
            "id": 231282
          },
          {
            "name": "海伦",
            "id": 231283
          }
        ]
      },
      {
        "name": "大兴安岭",
        "id": 232700,
        "child": [
          {
            "name": "松岭",
            "id": 232702
          },
          {
            "name": "新林",
            "id": 232703
          },
          {
            "name": "呼中",
            "id": 232704
          },
          {
            "name": "呼玛",
            "id": 232721
          },
          {
            "name": "塔河",
            "id": 232722
          },
          {
            "name": "漠河",
            "id": 232723
          },
          {
            "name": "加格达奇",
            "id": 232724
          }
        ]
      }
    ]
  },
  {
    "name": "上海",
    "id": 310000,
    "child": [
      {
        "name": "上海",
        "id": 310100,
        "child": [
          {
            "name": "黄浦",
            "id": 310101
          },
          {
            "name": "徐汇",
            "id": 310104
          },
          {
            "name": "长宁",
            "id": 310105
          },
          {
            "name": "静安",
            "id": 310106
          },
          {
            "name": "普陀",
            "id": 310107
          },
          {
            "name": "闸北",
            "id": 310108
          },
          {
            "name": "虹口",
            "id": 310109
          },
          {
            "name": "杨浦",
            "id": 310110
          },
          {
            "name": "闵行",
            "id": 310112
          },
          {
            "name": "宝山",
            "id": 310113
          },
          {
            "name": "嘉定",
            "id": 310114
          },
          {
            "name": "浦东",
            "id": 310115
          },
          {
            "name": "金山",
            "id": 310116
          },
          {
            "name": "松江",
            "id": 310117
          },
          {
            "name": "青浦",
            "id": 310118
          },
          {
            "name": "奉贤",
            "id": 310120
          },
          {
            "name": "崇明",
            "id": 310230
          }
        ]
      }
    ]
  },
  {
    "name": "江苏",
    "id": 320000,
    "child": [
      {
        "name": "南京",
        "id": 320100,
        "child": [
          {
            "name": "玄武",
            "id": 320102
          },
          {
            "name": "秦淮",
            "id": 320104
          },
          {
            "name": "建邺",
            "id": 320105
          },
          {
            "name": "鼓楼",
            "id": 320106
          },
          {
            "name": "浦口",
            "id": 320111
          },
          {
            "name": "栖霞",
            "id": 320113
          },
          {
            "name": "雨花台",
            "id": 320114
          },
          {
            "name": "江宁",
            "id": 320115
          },
          {
            "name": "六合",
            "id": 320116
          },
          {
            "name": "溧水",
            "id": 320124
          },
          {
            "name": "高淳",
            "id": 320125
          }
        ]
      },
      {
        "name": "无锡",
        "id": 320200,
        "child": [
          {
            "name": "崇安",
            "id": 320202
          },
          {
            "name": "南长",
            "id": 320203
          },
          {
            "name": "北塘",
            "id": 320204
          },
          {
            "name": "锡山",
            "id": 320205
          },
          {
            "name": "惠山",
            "id": 320206
          },
          {
            "name": "滨湖",
            "id": 320211
          },
          {
            "name": "江阴",
            "id": 320281
          },
          {
            "name": "宜兴",
            "id": 320282
          }
        ]
      },
      {
        "name": "徐州",
        "id": 320300,
        "child": [
          {
            "name": "鼓楼",
            "id": 320302
          },
          {
            "name": "云龙",
            "id": 320303
          },
          {
            "name": "贾汪",
            "id": 320305
          },
          {
            "name": "泉山",
            "id": 320311
          },
          {
            "name": "丰县",
            "id": 320321
          },
          {
            "name": "沛县",
            "id": 320322
          },
          {
            "name": "铜山",
            "id": 320323
          },
          {
            "name": "睢宁",
            "id": 320324
          },
          {
            "name": "新沂",
            "id": 320381
          },
          {
            "name": "邳州",
            "id": 320382
          }
        ]
      },
      {
        "name": "常州",
        "id": 320400,
        "child": [
          {
            "name": "天宁",
            "id": 320402
          },
          {
            "name": "钟楼",
            "id": 320404
          },
          {
            "name": "戚墅堰",
            "id": 320405
          },
          {
            "name": "新北",
            "id": 320411
          },
          {
            "name": "武进",
            "id": 320412
          },
          {
            "name": "溧阳",
            "id": 320481
          },
          {
            "name": "金坛",
            "id": 320482
          }
        ]
      },
      {
        "name": "苏州",
        "id": 320500,
        "child": [
          {
            "name": "虎丘",
            "id": 320505
          },
          {
            "name": "吴中",
            "id": 320506
          },
          {
            "name": "相城",
            "id": 320507
          },
          {
            "name": "姑苏",
            "id": 320508
          },
          {
            "name": "常熟",
            "id": 320581
          },
          {
            "name": "张家港",
            "id": 320582
          },
          {
            "name": "昆山",
            "id": 320583
          },
          {
            "name": "吴江",
            "id": 320584
          },
          {
            "name": "太仓",
            "id": 320585
          }
        ]
      },
      {
        "name": "南通",
        "id": 320600,
        "child": [
          {
            "name": "崇川",
            "id": 320602
          },
          {
            "name": "港闸",
            "id": 320611
          },
          {
            "name": "通州",
            "id": 320612
          },
          {
            "name": "海安",
            "id": 320621
          },
          {
            "name": "如东",
            "id": 320623
          },
          {
            "name": "启东",
            "id": 320681
          },
          {
            "name": "如皋",
            "id": 320682
          },
          {
            "name": "海门",
            "id": 320684
          }
        ]
      },
      {
        "name": "连云港",
        "id": 320700,
        "child": [
          {
            "name": "连云",
            "id": 320703
          },
          {
            "name": "新浦",
            "id": 320705
          },
          {
            "name": "海州",
            "id": 320706
          },
          {
            "name": "赣榆",
            "id": 320721
          },
          {
            "name": "东海",
            "id": 320722
          },
          {
            "name": "灌云",
            "id": 320723
          },
          {
            "name": "灌南",
            "id": 320724
          }
        ]
      },
      {
        "name": "淮安",
        "id": 320800,
        "child": [
          {
            "name": "清河",
            "id": 320802
          },
          {
            "name": "淮安",
            "id": 320803
          },
          {
            "name": "淮阴",
            "id": 320804
          },
          {
            "name": "清浦",
            "id": 320811
          },
          {
            "name": "涟水",
            "id": 320826
          },
          {
            "name": "洪泽",
            "id": 320829
          },
          {
            "name": "盱眙",
            "id": 320830
          },
          {
            "name": "金湖",
            "id": 320831
          }
        ]
      },
      {
        "name": "盐城",
        "id": 320900,
        "child": [
          {
            "name": "亭湖",
            "id": 320902
          },
          {
            "name": "盐都",
            "id": 320903
          },
          {
            "name": "响水",
            "id": 320921
          },
          {
            "name": "滨海",
            "id": 320922
          },
          {
            "name": "阜宁",
            "id": 320923
          },
          {
            "name": "射阳",
            "id": 320924
          },
          {
            "name": "建湖",
            "id": 320925
          },
          {
            "name": "东台",
            "id": 320981
          },
          {
            "name": "大丰",
            "id": 320982
          }
        ]
      },
      {
        "name": "扬州",
        "id": 321000,
        "child": [
          {
            "name": "广陵",
            "id": 321002
          },
          {
            "name": "邗江",
            "id": 321003
          },
          {
            "name": "宝应",
            "id": 321023
          },
          {
            "name": "仪征",
            "id": 321081
          },
          {
            "name": "高邮",
            "id": 321084
          },
          {
            "name": "江都",
            "id": 321088
          }
        ]
      },
      {
        "name": "镇江",
        "id": 321100,
        "child": [
          {
            "name": "京口",
            "id": 321102
          },
          {
            "name": "润州",
            "id": 321111
          },
          {
            "name": "丹徒",
            "id": 321112
          },
          {
            "name": "丹阳",
            "id": 321181
          },
          {
            "name": "扬中",
            "id": 321182
          },
          {
            "name": "句容",
            "id": 321183
          }
        ]
      },
      {
        "name": "泰州",
        "id": 321200,
        "child": [
          {
            "name": "海陵",
            "id": 321202
          },
          {
            "name": "高港",
            "id": 321203
          },
          {
            "name": "兴化",
            "id": 321281
          },
          {
            "name": "靖江",
            "id": 321282
          },
          {
            "name": "泰兴",
            "id": 321283
          },
          {
            "name": "姜堰",
            "id": 321284
          }
        ]
      },
      {
        "name": "宿迁",
        "id": 321300,
        "child": [
          {
            "name": "宿城",
            "id": 321302
          },
          {
            "name": "宿豫",
            "id": 321311
          },
          {
            "name": "沭阳",
            "id": 321322
          },
          {
            "name": "泗阳",
            "id": 321323
          },
          {
            "name": "泗洪",
            "id": 321324
          }
        ]
      }
    ]
  },
  {
    "name": "浙江",
    "id": 330000,
    "child": [
      {
        "name": "杭州",
        "id": 330100,
        "child": [
          {
            "name": "上城",
            "id": 330102
          },
          {
            "name": "下城",
            "id": 330103
          },
          {
            "name": "江干",
            "id": 330104
          },
          {
            "name": "拱墅",
            "id": 330105
          },
          {
            "name": "西湖",
            "id": 330106
          },
          {
            "name": "滨江",
            "id": 330108
          },
          {
            "name": "萧山",
            "id": 330109
          },
          {
            "name": "余杭",
            "id": 330110
          },
          {
            "name": "桐庐",
            "id": 330122
          },
          {
            "name": "淳安",
            "id": 330127
          },
          {
            "name": "建德",
            "id": 330182
          },
          {
            "name": "富阳",
            "id": 330183
          },
          {
            "name": "临安",
            "id": 330185
          }
        ]
      },
      {
        "name": "宁波",
        "id": 330200,
        "child": [
          {
            "name": "海曙",
            "id": 330203
          },
          {
            "name": "江东",
            "id": 330204
          },
          {
            "name": "江北",
            "id": 330205
          },
          {
            "name": "北仑",
            "id": 330206
          },
          {
            "name": "镇海",
            "id": 330211
          },
          {
            "name": "鄞州",
            "id": 330212
          },
          {
            "name": "象山",
            "id": 330225
          },
          {
            "name": "宁海",
            "id": 330226
          },
          {
            "name": "余姚",
            "id": 330281
          },
          {
            "name": "慈溪",
            "id": 330282
          },
          {
            "name": "奉化",
            "id": 330283
          }
        ]
      },
      {
        "name": "温州",
        "id": 330300,
        "child": [
          {
            "name": "鹿城",
            "id": 330302
          },
          {
            "name": "龙湾",
            "id": 330303
          },
          {
            "name": "瓯海",
            "id": 330304
          },
          {
            "name": "洞头",
            "id": 330322
          },
          {
            "name": "永嘉",
            "id": 330324
          },
          {
            "name": "平阳",
            "id": 330326
          },
          {
            "name": "苍南",
            "id": 330327
          },
          {
            "name": "文成",
            "id": 330328
          },
          {
            "name": "泰顺",
            "id": 330329
          },
          {
            "name": "瑞安",
            "id": 330381
          },
          {
            "name": "乐清",
            "id": 330382
          }
        ]
      },
      {
        "name": "嘉兴",
        "id": 330400,
        "child": [
          {
            "name": "南湖",
            "id": 330402
          },
          {
            "name": "秀洲",
            "id": 330411
          },
          {
            "name": "嘉善",
            "id": 330421
          },
          {
            "name": "海盐",
            "id": 330424
          },
          {
            "name": "海宁",
            "id": 330481
          },
          {
            "name": "平湖",
            "id": 330482
          },
          {
            "name": "桐乡",
            "id": 330483
          }
        ]
      },
      {
        "name": "湖州",
        "id": 330500,
        "child": [
          {
            "name": "吴兴",
            "id": 330502
          },
          {
            "name": "南浔",
            "id": 330503
          },
          {
            "name": "德清",
            "id": 330521
          },
          {
            "name": "长兴",
            "id": 330522
          },
          {
            "name": "安吉",
            "id": 330523
          }
        ]
      },
      {
        "name": "绍兴",
        "id": 330600,
        "child": [
          {
            "name": "越城",
            "id": 330602
          },
          {
            "name": "绍兴",
            "id": 330621
          },
          {
            "name": "新昌",
            "id": 330624
          },
          {
            "name": "诸暨",
            "id": 330681
          },
          {
            "name": "上虞",
            "id": 330682
          },
          {
            "name": "嵊州",
            "id": 330683
          }
        ]
      },
      {
        "name": "金华",
        "id": 330700,
        "child": [
          {
            "name": "婺城",
            "id": 330702
          },
          {
            "name": "金东",
            "id": 330703
          },
          {
            "name": "武义",
            "id": 330723
          },
          {
            "name": "浦江",
            "id": 330726
          },
          {
            "name": "磐安",
            "id": 330727
          },
          {
            "name": "兰溪",
            "id": 330781
          },
          {
            "name": "义乌",
            "id": 330782
          },
          {
            "name": "东阳",
            "id": 330783
          },
          {
            "name": "永康",
            "id": 330784
          }
        ]
      },
      {
        "name": "衢州",
        "id": 330800,
        "child": [
          {
            "name": "柯城",
            "id": 330802
          },
          {
            "name": "衢江",
            "id": 330803
          },
          {
            "name": "常山",
            "id": 330822
          },
          {
            "name": "开化",
            "id": 330824
          },
          {
            "name": "龙游",
            "id": 330825
          },
          {
            "name": "江山",
            "id": 330881
          }
        ]
      },
      {
        "name": "舟山",
        "id": 330900,
        "child": [
          {
            "name": "定海",
            "id": 330902
          },
          {
            "name": "普陀",
            "id": 330903
          },
          {
            "name": "岱山",
            "id": 330921
          },
          {
            "name": "嵊泗",
            "id": 330922
          }
        ]
      },
      {
        "name": "台州",
        "id": 331000,
        "child": [
          {
            "name": "椒江",
            "id": 331002
          },
          {
            "name": "黄岩",
            "id": 331003
          },
          {
            "name": "路桥",
            "id": 331004
          },
          {
            "name": "玉环",
            "id": 331021
          },
          {
            "name": "三门",
            "id": 331022
          },
          {
            "name": "天台",
            "id": 331023
          },
          {
            "name": "仙居",
            "id": 331024
          },
          {
            "name": "温岭",
            "id": 331081
          },
          {
            "name": "临海",
            "id": 331082
          }
        ]
      },
      {
        "name": "丽水",
        "id": 331100,
        "child": [
          {
            "name": "莲都",
            "id": 331102
          },
          {
            "name": "青田",
            "id": 331121
          },
          {
            "name": "缙云",
            "id": 331122
          },
          {
            "name": "遂昌",
            "id": 331123
          },
          {
            "name": "松阳",
            "id": 331124
          },
          {
            "name": "云和",
            "id": 331125
          },
          {
            "name": "庆元",
            "id": 331126
          },
          {
            "name": "景宁",
            "id": 331127
          },
          {
            "name": "龙泉",
            "id": 331181
          }
        ]
      }
    ]
  },
  {
    "name": "安徽",
    "id": 340000,
    "child": [
      {
        "name": "合肥",
        "id": 340100,
        "child": [
          {
            "name": "瑶海",
            "id": 340102
          },
          {
            "name": "庐阳",
            "id": 340103
          },
          {
            "name": "蜀山",
            "id": 340104
          },
          {
            "name": "包河",
            "id": 340111
          },
          {
            "name": "长丰",
            "id": 340121
          },
          {
            "name": "肥东",
            "id": 340122
          },
          {
            "name": "肥西",
            "id": 340123
          },
          {
            "name": "巢湖",
            "id": 341400
          },
          {
            "name": "庐江",
            "id": 341421
          }
        ]
      },
      {
        "name": "芜湖",
        "id": 340200,
        "child": [
          {
            "name": "镜湖",
            "id": 340202
          },
          {
            "name": "弋江",
            "id": 340203
          },
          {
            "name": "鸠江",
            "id": 340207
          },
          {
            "name": "三山",
            "id": 340208
          },
          {
            "name": "芜湖",
            "id": 340221
          },
          {
            "name": "繁昌",
            "id": 340222
          },
          {
            "name": "南陵",
            "id": 340223
          },
          {
            "name": "无为",
            "id": 341422
          }
        ]
      },
      {
        "name": "蚌埠",
        "id": 340300,
        "child": [
          {
            "name": "龙子湖",
            "id": 340302
          },
          {
            "name": "蚌山",
            "id": 340303
          },
          {
            "name": "禹会",
            "id": 340304
          },
          {
            "name": "淮上",
            "id": 340311
          },
          {
            "name": "怀远",
            "id": 340321
          },
          {
            "name": "五河",
            "id": 340322
          },
          {
            "name": "固镇",
            "id": 340323
          }
        ]
      },
      {
        "name": "淮南",
        "id": 340400,
        "child": [
          {
            "name": "大通",
            "id": 340402
          },
          {
            "name": "田家庵",
            "id": 340403
          },
          {
            "name": "谢家集",
            "id": 340404
          },
          {
            "name": "八公山",
            "id": 340405
          },
          {
            "name": "潘集",
            "id": 340406
          },
          {
            "name": "凤台",
            "id": 340421
          }
        ]
      },
      {
        "name": "马鞍山",
        "id": 340500,
        "child": [
          {
            "name": "花山",
            "id": 340503
          },
          {
            "name": "雨山",
            "id": 340504
          },
          {
            "name": "博望",
            "id": 340506
          },
          {
            "name": "当涂",
            "id": 340521
          },
          {
            "name": "含山",
            "id": 341423
          },
          {
            "name": "和县",
            "id": 341424
          }
        ]
      },
      {
        "name": "淮北",
        "id": 340600,
        "child": [
          {
            "name": "杜集",
            "id": 340602
          },
          {
            "name": "相山",
            "id": 340603
          },
          {
            "name": "烈山",
            "id": 340604
          },
          {
            "name": "濉溪",
            "id": 340621
          }
        ]
      },
      {
        "name": "铜陵",
        "id": 340700,
        "child": [
          {
            "name": "铜官山",
            "id": 340702
          },
          {
            "name": "狮子山",
            "id": 340703
          },
          {
            "name": "郊区",
            "id": 340711
          },
          {
            "name": "铜陵",
            "id": 340721
          }
        ]
      },
      {
        "name": "安庆",
        "id": 340800,
        "child": [
          {
            "name": "迎江",
            "id": 340802
          },
          {
            "name": "大观",
            "id": 340803
          },
          {
            "name": "宜秀",
            "id": 340811
          },
          {
            "name": "怀宁",
            "id": 340822
          },
          {
            "name": "枞阳",
            "id": 340823
          },
          {
            "name": "潜山",
            "id": 340824
          },
          {
            "name": "太湖",
            "id": 340825
          },
          {
            "name": "宿松",
            "id": 340826
          },
          {
            "name": "望江",
            "id": 340827
          },
          {
            "name": "岳西",
            "id": 340828
          },
          {
            "name": "桐城",
            "id": 340881
          }
        ]
      },
      {
        "name": "黄山",
        "id": 341000,
        "child": [
          {
            "name": "屯溪",
            "id": 341002
          },
          {
            "name": "黄山",
            "id": 341003
          },
          {
            "name": "徽州",
            "id": 341004
          },
          {
            "name": "歙县",
            "id": 341021
          },
          {
            "name": "休宁",
            "id": 341022
          },
          {
            "name": "黟县",
            "id": 341023
          },
          {
            "name": "祁门",
            "id": 341024
          }
        ]
      },
      {
        "name": "滁州",
        "id": 341100,
        "child": [
          {
            "name": "琅琊",
            "id": 341102
          },
          {
            "name": "南谯",
            "id": 341103
          },
          {
            "name": "来安",
            "id": 341122
          },
          {
            "name": "全椒",
            "id": 341124
          },
          {
            "name": "定远",
            "id": 341125
          },
          {
            "name": "凤阳",
            "id": 341126
          },
          {
            "name": "天长",
            "id": 341181
          },
          {
            "name": "明光",
            "id": 341182
          }
        ]
      },
      {
        "name": "阜阳",
        "id": 341200,
        "child": [
          {
            "name": "颍州",
            "id": 341202
          },
          {
            "name": "颍东",
            "id": 341203
          },
          {
            "name": "颍泉",
            "id": 341204
          },
          {
            "name": "临泉",
            "id": 341221
          },
          {
            "name": "太和",
            "id": 341222
          },
          {
            "name": "阜南",
            "id": 341225
          },
          {
            "name": "颍上",
            "id": 341226
          },
          {
            "name": "界首",
            "id": 341282
          }
        ]
      },
      {
        "name": "宿州",
        "id": 341300,
        "child": [
          {
            "name": "埇桥",
            "id": 341302
          },
          {
            "name": "砀山",
            "id": 341321
          },
          {
            "name": "萧县",
            "id": 341322
          },
          {
            "name": "灵璧",
            "id": 341323
          },
          {
            "name": "泗县",
            "id": 341324
          }
        ]
      },
      {
        "name": "六安",
        "id": 341500,
        "child": [
          {
            "name": "金安",
            "id": 341502
          },
          {
            "name": "裕安",
            "id": 341503
          },
          {
            "name": "寿县",
            "id": 341521
          },
          {
            "name": "霍邱",
            "id": 341522
          },
          {
            "name": "舒城",
            "id": 341523
          },
          {
            "name": "金寨",
            "id": 341524
          },
          {
            "name": "霍山",
            "id": 341525
          }
        ]
      },
      {
        "name": "亳州",
        "id": 341600,
        "child": [
          {
            "name": "谯城",
            "id": 341602
          },
          {
            "name": "涡阳",
            "id": 341621
          },
          {
            "name": "蒙城",
            "id": 341622
          },
          {
            "name": "利辛",
            "id": 341623
          }
        ]
      },
      {
        "name": "池州",
        "id": 341700,
        "child": [
          {
            "name": "贵池",
            "id": 341702
          },
          {
            "name": "东至",
            "id": 341721
          },
          {
            "name": "石台",
            "id": 341722
          },
          {
            "name": "青阳",
            "id": 341723
          }
        ]
      },
      {
        "name": "宣城",
        "id": 341800,
        "child": [
          {
            "name": "宣州",
            "id": 341802
          },
          {
            "name": "郎溪",
            "id": 341821
          },
          {
            "name": "广德",
            "id": 341822
          },
          {
            "name": "泾县",
            "id": 341823
          },
          {
            "name": "绩溪",
            "id": 341824
          },
          {
            "name": "旌德",
            "id": 341825
          },
          {
            "name": "宁国",
            "id": 341881
          }
        ]
      }
    ]
  },
  {
    "name": "福建",
    "id": 350000,
    "child": [
      {
        "name": "福州",
        "id": 350100,
        "child": [
          {
            "name": "鼓楼",
            "id": 350102
          },
          {
            "name": "台江",
            "id": 350103
          },
          {
            "name": "仓山",
            "id": 350104
          },
          {
            "name": "马尾",
            "id": 350105
          },
          {
            "name": "晋安",
            "id": 350111
          },
          {
            "name": "闽侯",
            "id": 350121
          },
          {
            "name": "连江",
            "id": 350122
          },
          {
            "name": "罗源",
            "id": 350123
          },
          {
            "name": "闽清",
            "id": 350124
          },
          {
            "name": "永泰",
            "id": 350125
          },
          {
            "name": "平潭",
            "id": 350128
          },
          {
            "name": "福清",
            "id": 350181
          },
          {
            "name": "长乐",
            "id": 350182
          }
        ]
      },
      {
        "name": "厦门",
        "id": 350200,
        "child": [
          {
            "name": "思明",
            "id": 350203
          },
          {
            "name": "海沧",
            "id": 350205
          },
          {
            "name": "湖里",
            "id": 350206
          },
          {
            "name": "集美",
            "id": 350211
          },
          {
            "name": "同安",
            "id": 350212
          },
          {
            "name": "翔安",
            "id": 350213
          }
        ]
      },
      {
        "name": "莆田",
        "id": 350300,
        "child": [
          {
            "name": "城厢",
            "id": 350302
          },
          {
            "name": "涵江",
            "id": 350303
          },
          {
            "name": "荔城",
            "id": 350304
          },
          {
            "name": "秀屿",
            "id": 350305
          },
          {
            "name": "仙游",
            "id": 350322
          }
        ]
      },
      {
        "name": "三明",
        "id": 350400,
        "child": [
          {
            "name": "梅列",
            "id": 350402
          },
          {
            "name": "三元",
            "id": 350403
          },
          {
            "name": "明溪",
            "id": 350421
          },
          {
            "name": "清流",
            "id": 350423
          },
          {
            "name": "宁化",
            "id": 350424
          },
          {
            "name": "大田",
            "id": 350425
          },
          {
            "name": "尤溪",
            "id": 350426
          },
          {
            "name": "沙县",
            "id": 350427
          },
          {
            "name": "将乐",
            "id": 350428
          },
          {
            "name": "泰宁",
            "id": 350429
          },
          {
            "name": "建宁",
            "id": 350430
          },
          {
            "name": "永安",
            "id": 350481
          }
        ]
      },
      {
        "name": "泉州",
        "id": 350500,
        "child": [
          {
            "name": "鲤城",
            "id": 350502
          },
          {
            "name": "丰泽",
            "id": 350503
          },
          {
            "name": "洛江",
            "id": 350504
          },
          {
            "name": "泉港",
            "id": 350505
          },
          {
            "name": "惠安",
            "id": 350521
          },
          {
            "name": "安溪",
            "id": 350524
          },
          {
            "name": "永春",
            "id": 350525
          },
          {
            "name": "德化",
            "id": 350526
          },
          {
            "name": "金门",
            "id": 350527
          },
          {
            "name": "石狮",
            "id": 350581
          },
          {
            "name": "晋江",
            "id": 350582
          },
          {
            "name": "南安",
            "id": 350583
          }
        ]
      },
      {
        "name": "漳州",
        "id": 350600,
        "child": [
          {
            "name": "芗城",
            "id": 350602
          },
          {
            "name": "龙文",
            "id": 350603
          },
          {
            "name": "云霄",
            "id": 350622
          },
          {
            "name": "漳浦",
            "id": 350623
          },
          {
            "name": "诏安",
            "id": 350624
          },
          {
            "name": "长泰",
            "id": 350625
          },
          {
            "name": "东山",
            "id": 350626
          },
          {
            "name": "南靖",
            "id": 350627
          },
          {
            "name": "平和",
            "id": 350628
          },
          {
            "name": "华安",
            "id": 350629
          },
          {
            "name": "龙海",
            "id": 350681
          }
        ]
      },
      {
        "name": "南平",
        "id": 350700,
        "child": [
          {
            "name": "延平",
            "id": 350702
          },
          {
            "name": "顺昌",
            "id": 350721
          },
          {
            "name": "浦城",
            "id": 350722
          },
          {
            "name": "光泽",
            "id": 350723
          },
          {
            "name": "松溪",
            "id": 350724
          },
          {
            "name": "政和",
            "id": 350725
          },
          {
            "name": "邵武",
            "id": 350781
          },
          {
            "name": "武夷山",
            "id": 350782
          },
          {
            "name": "建瓯",
            "id": 350783
          },
          {
            "name": "建阳",
            "id": 350784
          }
        ]
      },
      {
        "name": "龙岩",
        "id": 350800,
        "child": [
          {
            "name": "新罗",
            "id": 350802
          },
          {
            "name": "长汀",
            "id": 350821
          },
          {
            "name": "永定",
            "id": 350822
          },
          {
            "name": "上杭",
            "id": 350823
          },
          {
            "name": "武平",
            "id": 350824
          },
          {
            "name": "连城",
            "id": 350825
          },
          {
            "name": "漳平",
            "id": 350881
          }
        ]
      },
      {
        "name": "宁德",
        "id": 350900,
        "child": [
          {
            "name": "蕉城",
            "id": 350902
          },
          {
            "name": "霞浦",
            "id": 350921
          },
          {
            "name": "古田",
            "id": 350922
          },
          {
            "name": "屏南",
            "id": 350923
          },
          {
            "name": "寿宁",
            "id": 350924
          },
          {
            "name": "周宁",
            "id": 350925
          },
          {
            "name": "柘荣",
            "id": 350926
          },
          {
            "name": "福安",
            "id": 350981
          },
          {
            "name": "福鼎",
            "id": 350982
          }
        ]
      }
    ]
  },
  {
    "name": "江西",
    "id": 360000,
    "child": [
      {
        "name": "南昌",
        "id": 360100,
        "child": [
          {
            "name": "东湖",
            "id": 360102
          },
          {
            "name": "西湖",
            "id": 360103
          },
          {
            "name": "青云谱",
            "id": 360104
          },
          {
            "name": "湾里",
            "id": 360105
          },
          {
            "name": "青山湖",
            "id": 360111
          },
          {
            "name": "南昌",
            "id": 360121
          },
          {
            "name": "新建",
            "id": 360122
          },
          {
            "name": "安义",
            "id": 360123
          },
          {
            "name": "进贤",
            "id": 360124
          }
        ]
      },
      {
        "name": "景德镇",
        "id": 360200,
        "child": [
          {
            "name": "昌江",
            "id": 360202
          },
          {
            "name": "珠山",
            "id": 360203
          },
          {
            "name": "浮梁",
            "id": 360222
          },
          {
            "name": "乐平",
            "id": 360281
          }
        ]
      },
      {
        "name": "萍乡",
        "id": 360300,
        "child": [
          {
            "name": "安源",
            "id": 360302
          },
          {
            "name": "湘东",
            "id": 360313
          },
          {
            "name": "莲花",
            "id": 360321
          },
          {
            "name": "上栗",
            "id": 360322
          },
          {
            "name": "芦溪",
            "id": 360323
          }
        ]
      },
      {
        "name": "九江",
        "id": 360400,
        "child": [
          {
            "name": "庐山",
            "id": 360402
          },
          {
            "name": "浔阳",
            "id": 360403
          },
          {
            "name": "九江",
            "id": 360421
          },
          {
            "name": "武宁",
            "id": 360423
          },
          {
            "name": "修水",
            "id": 360424
          },
          {
            "name": "永修",
            "id": 360425
          },
          {
            "name": "德安",
            "id": 360426
          },
          {
            "name": "星子",
            "id": 360427
          },
          {
            "name": "都昌",
            "id": 360428
          },
          {
            "name": "湖口",
            "id": 360429
          },
          {
            "name": "彭泽",
            "id": 360430
          },
          {
            "name": "瑞昌",
            "id": 360481
          },
          {
            "name": "共青城",
            "id": 360483
          }
        ]
      },
      {
        "name": "新余",
        "id": 360500,
        "child": [
          {
            "name": "渝水",
            "id": 360502
          },
          {
            "name": "分宜",
            "id": 360521
          }
        ]
      },
      {
        "name": "鹰潭",
        "id": 360600,
        "child": [
          {
            "name": "月湖",
            "id": 360602
          },
          {
            "name": "余江",
            "id": 360622
          },
          {
            "name": "贵溪",
            "id": 360681
          }
        ]
      },
      {
        "name": "赣州",
        "id": 360700,
        "child": [
          {
            "name": "章贡",
            "id": 360702
          },
          {
            "name": "赣县",
            "id": 360721
          },
          {
            "name": "信丰",
            "id": 360722
          },
          {
            "name": "大余",
            "id": 360723
          },
          {
            "name": "上犹",
            "id": 360724
          },
          {
            "name": "崇义",
            "id": 360725
          },
          {
            "name": "安远",
            "id": 360726
          },
          {
            "name": "龙南",
            "id": 360727
          },
          {
            "name": "定南",
            "id": 360728
          },
          {
            "name": "全南",
            "id": 360729
          },
          {
            "name": "宁都",
            "id": 360730
          },
          {
            "name": "于都",
            "id": 360731
          },
          {
            "name": "兴国",
            "id": 360732
          },
          {
            "name": "会昌",
            "id": 360733
          },
          {
            "name": "寻乌",
            "id": 360734
          },
          {
            "name": "石城",
            "id": 360735
          },
          {
            "name": "瑞金",
            "id": 360781
          },
          {
            "name": "南康",
            "id": 360782
          }
        ]
      },
      {
        "name": "吉安",
        "id": 360800,
        "child": [
          {
            "name": "吉州",
            "id": 360802
          },
          {
            "name": "青原",
            "id": 360803
          },
          {
            "name": "吉安",
            "id": 360821
          },
          {
            "name": "吉水",
            "id": 360822
          },
          {
            "name": "峡江",
            "id": 360823
          },
          {
            "name": "新干",
            "id": 360824
          },
          {
            "name": "永丰",
            "id": 360825
          },
          {
            "name": "泰和",
            "id": 360826
          },
          {
            "name": "遂川",
            "id": 360827
          },
          {
            "name": "万安",
            "id": 360828
          },
          {
            "name": "安福",
            "id": 360829
          },
          {
            "name": "永新",
            "id": 360830
          },
          {
            "name": "井冈山",
            "id": 360881
          }
        ]
      },
      {
        "name": "宜春",
        "id": 360900,
        "child": [
          {
            "name": "袁州",
            "id": 360902
          },
          {
            "name": "奉新",
            "id": 360921
          },
          {
            "name": "万载",
            "id": 360922
          },
          {
            "name": "上高",
            "id": 360923
          },
          {
            "name": "宜丰",
            "id": 360924
          },
          {
            "name": "靖安",
            "id": 360925
          },
          {
            "name": "铜鼓",
            "id": 360926
          },
          {
            "name": "丰城",
            "id": 360981
          },
          {
            "name": "樟树",
            "id": 360982
          },
          {
            "name": "高安",
            "id": 360983
          }
        ]
      },
      {
        "name": "抚州",
        "id": 361000,
        "child": [
          {
            "name": "临川",
            "id": 361002
          },
          {
            "name": "南城",
            "id": 361021
          },
          {
            "name": "黎川",
            "id": 361022
          },
          {
            "name": "南丰",
            "id": 361023
          },
          {
            "name": "崇仁",
            "id": 361024
          },
          {
            "name": "乐安",
            "id": 361025
          },
          {
            "name": "宜黄",
            "id": 361026
          },
          {
            "name": "金溪",
            "id": 361027
          },
          {
            "name": "资溪",
            "id": 361028
          },
          {
            "name": "东乡",
            "id": 361029
          },
          {
            "name": "广昌",
            "id": 361030
          }
        ]
      },
      {
        "name": "上饶",
        "id": 361100,
        "child": [
          {
            "name": "信州",
            "id": 361102
          },
          {
            "name": "上饶",
            "id": 361121
          },
          {
            "name": "广丰",
            "id": 361122
          },
          {
            "name": "玉山",
            "id": 361123
          },
          {
            "name": "铅山",
            "id": 361124
          },
          {
            "name": "横峰",
            "id": 361125
          },
          {
            "name": "弋阳",
            "id": 361126
          },
          {
            "name": "余干",
            "id": 361127
          },
          {
            "name": "鄱阳",
            "id": 361128
          },
          {
            "name": "万年",
            "id": 361129
          },
          {
            "name": "婺源",
            "id": 361130
          },
          {
            "name": "德兴",
            "id": 361181
          }
        ]
      }
    ]
  },
  {
    "name": "山东",
    "id": 370000,
    "child": [
      {
        "name": "济南",
        "id": 370100,
        "child": [
          {
            "name": "历下",
            "id": 370102
          },
          {
            "name": "市中",
            "id": 370103
          },
          {
            "name": "槐荫",
            "id": 370104
          },
          {
            "name": "天桥",
            "id": 370105
          },
          {
            "name": "历城",
            "id": 370112
          },
          {
            "name": "长清",
            "id": 370113
          },
          {
            "name": "平阴",
            "id": 370124
          },
          {
            "name": "济阳",
            "id": 370125
          },
          {
            "name": "商河",
            "id": 370126
          },
          {
            "name": "章丘",
            "id": 370181
          }
        ]
      },
      {
        "name": "青岛",
        "id": 370200,
        "child": [
          {
            "name": "市南",
            "id": 370202
          },
          {
            "name": "市北",
            "id": 370203
          },
          {
            "name": "黄岛",
            "id": 370211
          },
          {
            "name": "崂山",
            "id": 370212
          },
          {
            "name": "李沧",
            "id": 370213
          },
          {
            "name": "城阳",
            "id": 370214
          },
          {
            "name": "胶州",
            "id": 370281
          },
          {
            "name": "即墨",
            "id": 370282
          },
          {
            "name": "平度",
            "id": 370283
          },
          {
            "name": "莱西",
            "id": 370285
          }
        ]
      },
      {
        "name": "淄博",
        "id": 370300,
        "child": [
          {
            "name": "淄川",
            "id": 370302
          },
          {
            "name": "张店",
            "id": 370303
          },
          {
            "name": "博山",
            "id": 370304
          },
          {
            "name": "临淄",
            "id": 370305
          },
          {
            "name": "周村",
            "id": 370306
          },
          {
            "name": "桓台",
            "id": 370321
          },
          {
            "name": "高青",
            "id": 370322
          },
          {
            "name": "沂源",
            "id": 370323
          }
        ]
      },
      {
        "name": "枣庄",
        "id": 370400,
        "child": [
          {
            "name": "市中",
            "id": 370402
          },
          {
            "name": "薛城",
            "id": 370403
          },
          {
            "name": "峄城",
            "id": 370404
          },
          {
            "name": "台儿庄",
            "id": 370405
          },
          {
            "name": "山亭",
            "id": 370406
          },
          {
            "name": "滕州",
            "id": 370481
          }
        ]
      },
      {
        "name": "东营",
        "id": 370500,
        "child": [
          {
            "name": "东营",
            "id": 370502
          },
          {
            "name": "河口",
            "id": 370503
          },
          {
            "name": "垦利",
            "id": 370521
          },
          {
            "name": "利津",
            "id": 370522
          },
          {
            "name": "广饶",
            "id": 370523
          }
        ]
      },
      {
        "name": "烟台",
        "id": 370600,
        "child": [
          {
            "name": "芝罘",
            "id": 370602
          },
          {
            "name": "福山",
            "id": 370611
          },
          {
            "name": "牟平",
            "id": 370612
          },
          {
            "name": "莱山",
            "id": 370613
          },
          {
            "name": "长岛",
            "id": 370634
          },
          {
            "name": "龙口",
            "id": 370681
          },
          {
            "name": "莱阳",
            "id": 370682
          },
          {
            "name": "莱州",
            "id": 370683
          },
          {
            "name": "蓬莱",
            "id": 370684
          },
          {
            "name": "招远",
            "id": 370685
          },
          {
            "name": "栖霞",
            "id": 370686
          },
          {
            "name": "海阳",
            "id": 370687
          }
        ]
      },
      {
        "name": "潍坊",
        "id": 370700,
        "child": [
          {
            "name": "潍城",
            "id": 370702
          },
          {
            "name": "寒亭",
            "id": 370703
          },
          {
            "name": "坊子",
            "id": 370704
          },
          {
            "name": "奎文",
            "id": 370705
          },
          {
            "name": "临朐",
            "id": 370724
          },
          {
            "name": "昌乐",
            "id": 370725
          },
          {
            "name": "青州",
            "id": 370781
          },
          {
            "name": "诸城",
            "id": 370782
          },
          {
            "name": "寿光",
            "id": 370783
          },
          {
            "name": "安丘",
            "id": 370784
          },
          {
            "name": "高密",
            "id": 370785
          },
          {
            "name": "昌邑",
            "id": 370786
          }
        ]
      },
      {
        "name": "济宁",
        "id": 370800,
        "child": [
          {
            "name": "市中",
            "id": 370802
          },
          {
            "name": "任城",
            "id": 370811
          },
          {
            "name": "微山",
            "id": 370826
          },
          {
            "name": "鱼台",
            "id": 370827
          },
          {
            "name": "金乡",
            "id": 370828
          },
          {
            "name": "嘉祥",
            "id": 370829
          },
          {
            "name": "汶上",
            "id": 370830
          },
          {
            "name": "泗水",
            "id": 370831
          },
          {
            "name": "梁山",
            "id": 370832
          },
          {
            "name": "曲阜",
            "id": 370881
          },
          {
            "name": "兖州",
            "id": 370882
          },
          {
            "name": "邹城",
            "id": 370883
          }
        ]
      },
      {
        "name": "泰安",
        "id": 370900,
        "child": [
          {
            "name": "泰山",
            "id": 370902
          },
          {
            "name": "岱岳",
            "id": 370903
          },
          {
            "name": "宁阳",
            "id": 370921
          },
          {
            "name": "东平",
            "id": 370923
          },
          {
            "name": "新泰",
            "id": 370982
          },
          {
            "name": "肥城",
            "id": 370983
          }
        ]
      },
      {
        "name": "威海",
        "id": 371000,
        "child": [
          {
            "name": "环翠",
            "id": 371002
          },
          {
            "name": "文登",
            "id": 371081
          },
          {
            "name": "荣成",
            "id": 371082
          },
          {
            "name": "乳山",
            "id": 371083
          }
        ]
      },
      {
        "name": "日照",
        "id": 371100,
        "child": [
          {
            "name": "东港",
            "id": 371102
          },
          {
            "name": "岚山",
            "id": 371103
          },
          {
            "name": "五莲",
            "id": 371121
          },
          {
            "name": "莒县",
            "id": 371122
          }
        ]
      },
      {
        "name": "莱芜",
        "id": 371200,
        "child": [
          {
            "name": "莱城",
            "id": 371202
          },
          {
            "name": "钢城",
            "id": 371203
          }
        ]
      },
      {
        "name": "临沂",
        "id": 371300,
        "child": [
          {
            "name": "兰山",
            "id": 371302
          },
          {
            "name": "罗庄",
            "id": 371311
          },
          {
            "name": "河东",
            "id": 371312
          },
          {
            "name": "沂南",
            "id": 371321
          },
          {
            "name": "郯城",
            "id": 371322
          },
          {
            "name": "沂水",
            "id": 371323
          },
          {
            "name": "苍山",
            "id": 371324
          },
          {
            "name": "费县",
            "id": 371325
          },
          {
            "name": "平邑",
            "id": 371326
          },
          {
            "name": "莒南",
            "id": 371327
          },
          {
            "name": "蒙阴",
            "id": 371328
          },
          {
            "name": "临沭",
            "id": 371329
          }
        ]
      },
      {
        "name": "德州",
        "id": 371400,
        "child": [
          {
            "name": "德城",
            "id": 371402
          },
          {
            "name": "陵县",
            "id": 371421
          },
          {
            "name": "宁津",
            "id": 371422
          },
          {
            "name": "庆云",
            "id": 371423
          },
          {
            "name": "临邑",
            "id": 371424
          },
          {
            "name": "齐河",
            "id": 371425
          },
          {
            "name": "平原",
            "id": 371426
          },
          {
            "name": "夏津",
            "id": 371427
          },
          {
            "name": "武城",
            "id": 371428
          },
          {
            "name": "乐陵",
            "id": 371481
          },
          {
            "name": "禹城",
            "id": 371482
          }
        ]
      },
      {
        "name": "聊城",
        "id": 371500,
        "child": [
          {
            "name": "东昌府",
            "id": 371502
          },
          {
            "name": "阳谷",
            "id": 371521
          },
          {
            "name": "莘县",
            "id": 371522
          },
          {
            "name": "茌平",
            "id": 371523
          },
          {
            "name": "东阿",
            "id": 371524
          },
          {
            "name": "冠县",
            "id": 371525
          },
          {
            "name": "高唐",
            "id": 371526
          },
          {
            "name": "临清",
            "id": 371581
          }
        ]
      },
      {
        "name": "滨州",
        "id": 371600,
        "child": [
          {
            "name": "滨城",
            "id": 371602
          },
          {
            "name": "惠民",
            "id": 371621
          },
          {
            "name": "阳信",
            "id": 371622
          },
          {
            "name": "无棣",
            "id": 371623
          },
          {
            "name": "沾化",
            "id": 371624
          },
          {
            "name": "博兴",
            "id": 371625
          },
          {
            "name": "邹平",
            "id": 371626
          }
        ]
      },
      {
        "name": "菏泽",
        "id": 371700,
        "child": [
          {
            "name": "牡丹",
            "id": 371702
          },
          {
            "name": "曹县",
            "id": 371721
          },
          {
            "name": "单县",
            "id": 371722
          },
          {
            "name": "成武",
            "id": 371723
          },
          {
            "name": "巨野",
            "id": 371724
          },
          {
            "name": "郓城",
            "id": 371725
          },
          {
            "name": "鄄城",
            "id": 371726
          },
          {
            "name": "定陶",
            "id": 371727
          },
          {
            "name": "东明",
            "id": 371728
          }
        ]
      }
    ]
  },
  {
    "name": "河南",
    "id": 410000,
    "child": [
      {
        "name": "郑州",
        "id": 410100,
        "child": [
          {
            "name": "中原",
            "id": 410102
          },
          {
            "name": "二七",
            "id": 410103
          },
          {
            "name": "管城回族",
            "id": 410104
          },
          {
            "name": "金水",
            "id": 410105
          },
          {
            "name": "上街",
            "id": 410106
          },
          {
            "name": "惠济",
            "id": 410108
          },
          {
            "name": "中牟",
            "id": 410122
          },
          {
            "name": "巩义",
            "id": 410181
          },
          {
            "name": "荥阳",
            "id": 410182
          },
          {
            "name": "新密",
            "id": 410183
          },
          {
            "name": "新郑",
            "id": 410184
          },
          {
            "name": "登封",
            "id": 410185
          }
        ]
      },
      {
        "name": "开封",
        "id": 410200,
        "child": [
          {
            "name": "龙亭",
            "id": 410202
          },
          {
            "name": "顺河回族",
            "id": 410203
          },
          {
            "name": "鼓楼",
            "id": 410204
          },
          {
            "name": "禹王台",
            "id": 410205
          },
          {
            "name": "金明",
            "id": 410211
          },
          {
            "name": "杞县",
            "id": 410221
          },
          {
            "name": "通许",
            "id": 410222
          },
          {
            "name": "尉氏",
            "id": 410223
          },
          {
            "name": "开封",
            "id": 410224
          },
          {
            "name": "兰考",
            "id": 410225
          }
        ]
      },
      {
        "name": "洛阳",
        "id": 410300,
        "child": [
          {
            "name": "老城",
            "id": 410302
          },
          {
            "name": "西工",
            "id": 410303
          },
          {
            "name": "瀍河回族",
            "id": 410304
          },
          {
            "name": "涧西",
            "id": 410305
          },
          {
            "name": "吉利",
            "id": 410306
          },
          {
            "name": "洛龙",
            "id": 410307
          },
          {
            "name": "孟津",
            "id": 410322
          },
          {
            "name": "新安",
            "id": 410323
          },
          {
            "name": "栾川",
            "id": 410324
          },
          {
            "name": "嵩县",
            "id": 410325
          },
          {
            "name": "汝阳",
            "id": 410326
          },
          {
            "name": "宜阳",
            "id": 410327
          },
          {
            "name": "洛宁",
            "id": 410328
          },
          {
            "name": "伊川",
            "id": 410329
          },
          {
            "name": "偃师",
            "id": 410381
          }
        ]
      },
      {
        "name": "平顶山",
        "id": 410400,
        "child": [
          {
            "name": "新华",
            "id": 410402
          },
          {
            "name": "卫东",
            "id": 410403
          },
          {
            "name": "石龙",
            "id": 410404
          },
          {
            "name": "湛河",
            "id": 410411
          },
          {
            "name": "宝丰",
            "id": 410421
          },
          {
            "name": "叶县",
            "id": 410422
          },
          {
            "name": "鲁山",
            "id": 410423
          },
          {
            "name": "郏县",
            "id": 410425
          },
          {
            "name": "舞钢",
            "id": 410481
          },
          {
            "name": "汝州",
            "id": 410482
          }
        ]
      },
      {
        "name": "安阳",
        "id": 410500,
        "child": [
          {
            "name": "文峰",
            "id": 410502
          },
          {
            "name": "北关",
            "id": 410503
          },
          {
            "name": "殷都",
            "id": 410505
          },
          {
            "name": "龙安",
            "id": 410506
          },
          {
            "name": "安阳",
            "id": 410522
          },
          {
            "name": "汤阴",
            "id": 410523
          },
          {
            "name": "滑县",
            "id": 410526
          },
          {
            "name": "内黄",
            "id": 410527
          },
          {
            "name": "林州",
            "id": 410581
          }
        ]
      },
      {
        "name": "鹤壁",
        "id": 410600,
        "child": [
          {
            "name": "鹤山",
            "id": 410602
          },
          {
            "name": "山城",
            "id": 410603
          },
          {
            "name": "淇滨",
            "id": 410611
          },
          {
            "name": "浚县",
            "id": 410621
          },
          {
            "name": "淇县",
            "id": 410622
          }
        ]
      },
      {
        "name": "新乡",
        "id": 410700,
        "child": [
          {
            "name": "红旗",
            "id": 410702
          },
          {
            "name": "卫滨",
            "id": 410703
          },
          {
            "name": "凤泉",
            "id": 410704
          },
          {
            "name": "牧野",
            "id": 410711
          },
          {
            "name": "新乡",
            "id": 410721
          },
          {
            "name": "获嘉",
            "id": 410724
          },
          {
            "name": "原阳",
            "id": 410725
          },
          {
            "name": "延津",
            "id": 410726
          },
          {
            "name": "封丘",
            "id": 410727
          },
          {
            "name": "长垣",
            "id": 410728
          },
          {
            "name": "卫辉",
            "id": 410781
          },
          {
            "name": "辉县",
            "id": 410782
          }
        ]
      },
      {
        "name": "焦作",
        "id": 410800,
        "child": [
          {
            "name": "解放",
            "id": 410802
          },
          {
            "name": "中站",
            "id": 410803
          },
          {
            "name": "马村",
            "id": 410804
          },
          {
            "name": "山阳",
            "id": 410811
          },
          {
            "name": "修武",
            "id": 410821
          },
          {
            "name": "博爱",
            "id": 410822
          },
          {
            "name": "武陟",
            "id": 410823
          },
          {
            "name": "温县",
            "id": 410825
          },
          {
            "name": "沁阳",
            "id": 410882
          },
          {
            "name": "孟州",
            "id": 410883
          }
        ]
      },
      {
        "name": "济源",
        "id": 410881,
        "child": [
          {
            "name": "沁园街道",
            "id": 419001001
          },
          {
            "name": "济水街道",
            "id": 419001002
          },
          {
            "name": "北海街道",
            "id": 419001003
          },
          {
            "name": "天坛街道",
            "id": 419001004
          },
          {
            "name": "玉泉街道",
            "id": 419001005
          },
          {
            "name": "克井镇",
            "id": 419001100
          },
          {
            "name": "五龙口镇",
            "id": 419001101
          },
          {
            "name": "轵城镇",
            "id": 419001102
          },
          {
            "name": "承留镇",
            "id": 419001103
          },
          {
            "name": "邵原镇",
            "id": 419001104
          },
          {
            "name": "坡头镇",
            "id": 419001105
          },
          {
            "name": "梨林镇",
            "id": 419001106
          },
          {
            "name": "大峪镇",
            "id": 419001107
          },
          {
            "name": "思礼镇",
            "id": 419001108
          },
          {
            "name": "王屋镇",
            "id": 419001109
          },
          {
            "name": "下冶镇",
            "id": 419001110
          }
        ]
      },
      {
        "name": "濮阳",
        "id": 410900,
        "child": [
          {
            "name": "华龙",
            "id": 410902
          },
          {
            "name": "清丰",
            "id": 410922
          },
          {
            "name": "南乐",
            "id": 410923
          },
          {
            "name": "范县",
            "id": 410926
          },
          {
            "name": "台前",
            "id": 410927
          },
          {
            "name": "濮阳",
            "id": 410928
          }
        ]
      },
      {
        "name": "许昌",
        "id": 411000,
        "child": [
          {
            "name": "魏都",
            "id": 411002
          },
          {
            "name": "许昌",
            "id": 411023
          },
          {
            "name": "鄢陵",
            "id": 411024
          },
          {
            "name": "襄城",
            "id": 411025
          },
          {
            "name": "禹州",
            "id": 411081
          },
          {
            "name": "长葛",
            "id": 411082
          }
        ]
      },
      {
        "name": "漯河",
        "id": 411100,
        "child": [
          {
            "name": "源汇",
            "id": 411102
          },
          {
            "name": "郾城",
            "id": 411103
          },
          {
            "name": "召陵",
            "id": 411104
          },
          {
            "name": "舞阳",
            "id": 411121
          },
          {
            "name": "临颍",
            "id": 411122
          }
        ]
      },
      {
        "name": "三门峡",
        "id": 411200,
        "child": [
          {
            "name": "湖滨",
            "id": 411202
          },
          {
            "name": "渑池",
            "id": 411221
          },
          {
            "name": "陕县",
            "id": 411222
          },
          {
            "name": "卢氏",
            "id": 411224
          },
          {
            "name": "义马",
            "id": 411281
          },
          {
            "name": "灵宝",
            "id": 411282
          }
        ]
      },
      {
        "name": "南阳",
        "id": 411300,
        "child": [
          {
            "name": "宛城",
            "id": 411302
          },
          {
            "name": "卧龙",
            "id": 411303
          },
          {
            "name": "南召",
            "id": 411321
          },
          {
            "name": "方城",
            "id": 411322
          },
          {
            "name": "西峡",
            "id": 411323
          },
          {
            "name": "镇平",
            "id": 411324
          },
          {
            "name": "内乡",
            "id": 411325
          },
          {
            "name": "淅川",
            "id": 411326
          },
          {
            "name": "社旗县",
            "id": 411327
          },
          {
            "name": "唐河",
            "id": 411328
          },
          {
            "name": "新野",
            "id": 411329
          },
          {
            "name": "桐柏",
            "id": 411330
          },
          {
            "name": "邓州",
            "id": 411381
          }
        ]
      },
      {
        "name": "商丘",
        "id": 411400,
        "child": [
          {
            "name": "梁园",
            "id": 411402
          },
          {
            "name": "睢阳",
            "id": 411403
          },
          {
            "name": "民权",
            "id": 411421
          },
          {
            "name": "睢县",
            "id": 411422
          },
          {
            "name": "宁陵",
            "id": 411423
          },
          {
            "name": "柘城",
            "id": 411424
          },
          {
            "name": "虞城",
            "id": 411425
          },
          {
            "name": "夏邑",
            "id": 411426
          },
          {
            "name": "永城",
            "id": 411481
          }
        ]
      },
      {
        "name": "信阳",
        "id": 411500,
        "child": [
          {
            "name": "浉河",
            "id": 411502
          },
          {
            "name": "平桥",
            "id": 411503
          },
          {
            "name": "罗山",
            "id": 411521
          },
          {
            "name": "光山",
            "id": 411522
          },
          {
            "name": "新县",
            "id": 411523
          },
          {
            "name": "商城",
            "id": 411524
          },
          {
            "name": "固始",
            "id": 411525
          },
          {
            "name": "潢川",
            "id": 411526
          },
          {
            "name": "淮滨",
            "id": 411527
          },
          {
            "name": "息县",
            "id": 411528
          }
        ]
      },
      {
        "name": "周口",
        "id": 411600,
        "child": [
          {
            "name": "川汇",
            "id": 411602
          },
          {
            "name": "扶沟",
            "id": 411621
          },
          {
            "name": "西华",
            "id": 411622
          },
          {
            "name": "商水",
            "id": 411623
          },
          {
            "name": "沈丘",
            "id": 411624
          },
          {
            "name": "郸城",
            "id": 411625
          },
          {
            "name": "淮阳",
            "id": 411626
          },
          {
            "name": "太康",
            "id": 411627
          },
          {
            "name": "鹿邑",
            "id": 411628
          },
          {
            "name": "项城",
            "id": 411681
          }
        ]
      },
      {
        "name": "驻马店",
        "id": 411700,
        "child": [
          {
            "name": "驿城",
            "id": 411702
          },
          {
            "name": "西平",
            "id": 411721
          },
          {
            "name": "上蔡",
            "id": 411722
          },
          {
            "name": "平舆",
            "id": 411723
          },
          {
            "name": "正阳",
            "id": 411724
          },
          {
            "name": "确山",
            "id": 411725
          },
          {
            "name": "泌阳",
            "id": 411726
          },
          {
            "name": "汝南",
            "id": 411727
          },
          {
            "name": "遂平",
            "id": 411728
          },
          {
            "name": "新蔡",
            "id": 411729
          }
        ]
      }
    ]
  },
  {
    "name": "湖北",
    "id": 420000,
    "child": [
      {
        "name": "武汉",
        "id": 420100,
        "child": [
          {
            "name": "江岸",
            "id": 420102
          },
          {
            "name": "江汉",
            "id": 420103
          },
          {
            "name": "硚口",
            "id": 420104
          },
          {
            "name": "汉阳",
            "id": 420105
          },
          {
            "name": "武昌",
            "id": 420106
          },
          {
            "name": "青山",
            "id": 420107
          },
          {
            "name": "洪山",
            "id": 420111
          },
          {
            "name": "东西湖",
            "id": 420112
          },
          {
            "name": "汉南",
            "id": 420113
          },
          {
            "name": "蔡甸",
            "id": 420114
          },
          {
            "name": "江夏",
            "id": 420115
          },
          {
            "name": "黄陂",
            "id": 420116
          },
          {
            "name": "新洲",
            "id": 420117
          }
        ]
      },
      {
        "name": "黄石",
        "id": 420200,
        "child": [
          {
            "name": "黄石港",
            "id": 420202
          },
          {
            "name": "西塞山",
            "id": 420203
          },
          {
            "name": "下陆",
            "id": 420204
          },
          {
            "name": "铁山",
            "id": 420205
          },
          {
            "name": "阳新",
            "id": 420222
          },
          {
            "name": "大冶",
            "id": 420281
          }
        ]
      },
      {
        "name": "十堰",
        "id": 420300,
        "child": [
          {
            "name": "茅箭",
            "id": 420302
          },
          {
            "name": "张湾",
            "id": 420303
          },
          {
            "name": "郧县",
            "id": 420321
          },
          {
            "name": "郧西",
            "id": 420322
          },
          {
            "name": "竹山",
            "id": 420323
          },
          {
            "name": "竹溪",
            "id": 420324
          },
          {
            "name": "房县",
            "id": 420325
          },
          {
            "name": "丹江口",
            "id": 420381
          }
        ]
      },
      {
        "name": "宜昌",
        "id": 420500,
        "child": [
          {
            "name": "西陵",
            "id": 420502
          },
          {
            "name": "伍家岗",
            "id": 420503
          },
          {
            "name": "点军",
            "id": 420504
          },
          {
            "name": "猇亭",
            "id": 420505
          },
          {
            "name": "夷陵",
            "id": 420506
          },
          {
            "name": "远安",
            "id": 420525
          },
          {
            "name": "兴山",
            "id": 420526
          },
          {
            "name": "秭归",
            "id": 420527
          },
          {
            "name": "长阳",
            "id": 420528
          },
          {
            "name": "五峰",
            "id": 420529
          },
          {
            "name": "宜都",
            "id": 420581
          },
          {
            "name": "当阳",
            "id": 420582
          },
          {
            "name": "枝江",
            "id": 420583
          }
        ]
      },
      {
        "name": "襄阳",
        "id": 420600,
        "child": [
          {
            "name": "襄城",
            "id": 420602
          },
          {
            "name": "樊城",
            "id": 420606
          },
          {
            "name": "襄州",
            "id": 420607
          },
          {
            "name": "南漳",
            "id": 420624
          },
          {
            "name": "谷城",
            "id": 420625
          },
          {
            "name": "保康",
            "id": 420626
          },
          {
            "name": "老河口",
            "id": 420682
          },
          {
            "name": "枣阳",
            "id": 420683
          },
          {
            "name": "宜城",
            "id": 420684
          }
        ]
      },
      {
        "name": "鄂州",
        "id": 420700,
        "child": [
          {
            "name": "梁子湖",
            "id": 420702
          },
          {
            "name": "华容",
            "id": 420703
          },
          {
            "name": "鄂城",
            "id": 420704
          }
        ]
      },
      {
        "name": "荆门",
        "id": 420800,
        "child": [
          {
            "name": "东宝",
            "id": 420802
          },
          {
            "name": "掇刀",
            "id": 420804
          },
          {
            "name": "京山",
            "id": 420821
          },
          {
            "name": "沙洋",
            "id": 420822
          },
          {
            "name": "钟祥",
            "id": 420881
          }
        ]
      },
      {
        "name": "孝感",
        "id": 420900,
        "child": [
          {
            "name": "孝南",
            "id": 420902
          },
          {
            "name": "孝昌",
            "id": 420921
          },
          {
            "name": "大悟",
            "id": 420922
          },
          {
            "name": "云梦",
            "id": 420923
          },
          {
            "name": "应城",
            "id": 420981
          },
          {
            "name": "安陆",
            "id": 420982
          },
          {
            "name": "汉川",
            "id": 420984
          }
        ]
      },
      {
        "name": "荆州",
        "id": 421000,
        "child": [
          {
            "name": "沙市",
            "id": 421002
          },
          {
            "name": "荆州",
            "id": 421003
          },
          {
            "name": "公安",
            "id": 421022
          },
          {
            "name": "监利",
            "id": 421023
          },
          {
            "name": "江陵",
            "id": 421024
          },
          {
            "name": "石首",
            "id": 421081
          },
          {
            "name": "洪湖",
            "id": 421083
          },
          {
            "name": "松滋",
            "id": 421087
          }
        ]
      },
      {
        "name": "黄冈",
        "id": 421100,
        "child": [
          {
            "name": "黄州",
            "id": 421102
          },
          {
            "name": "团风",
            "id": 421121
          },
          {
            "name": "红安",
            "id": 421122
          },
          {
            "name": "罗田",
            "id": 421123
          },
          {
            "name": "英山",
            "id": 421124
          },
          {
            "name": "浠水",
            "id": 421125
          },
          {
            "name": "蕲春",
            "id": 421126
          },
          {
            "name": "黄梅",
            "id": 421127
          },
          {
            "name": "麻城",
            "id": 421181
          },
          {
            "name": "武穴",
            "id": 421182
          }
        ]
      },
      {
        "name": "咸宁",
        "id": 421200,
        "child": [
          {
            "name": "咸安",
            "id": 421202
          },
          {
            "name": "嘉鱼",
            "id": 421221
          },
          {
            "name": "通城",
            "id": 421222
          },
          {
            "name": "崇阳",
            "id": 421223
          },
          {
            "name": "通山",
            "id": 421224
          },
          {
            "name": "赤壁",
            "id": 421281
          }
        ]
      },
      {
        "name": "随州",
        "id": 421300,
        "child": [
          {
            "name": "曾都",
            "id": 421302
          },
          {
            "name": "随县",
            "id": 421321
          },
          {
            "name": "广水",
            "id": 421381
          }
        ]
      },
      {
        "name": "恩施",
        "id": 422800,
        "child": [
          {
            "name": "恩施",
            "id": 422801
          },
          {
            "name": "利川",
            "id": 422802
          },
          {
            "name": "建始",
            "id": 422822
          },
          {
            "name": "巴东",
            "id": 422823
          },
          {
            "name": "宣恩",
            "id": 422825
          },
          {
            "name": "咸丰",
            "id": 422826
          },
          {
            "name": "来凤",
            "id": 422827
          },
          {
            "name": "鹤峰",
            "id": 422828
          }
        ]
      },
      {
        "name": "仙桃",
        "id": 429004,
        "child": [
          {
            "name": "沙嘴街道",
            "id": 429004001
          },
          {
            "name": "干河街道",
            "id": 429004002
          },
          {
            "name": "龙华山办事处",
            "id": 429004003
          },
          {
            "name": "郑场镇",
            "id": 429004100
          },
          {
            "name": "毛嘴镇",
            "id": 429004101
          },
          {
            "name": "豆河镇",
            "id": 429004102
          },
          {
            "name": "三伏潭镇",
            "id": 429004103
          },
          {
            "name": "胡场镇",
            "id": 429004104
          },
          {
            "name": "长倘口镇",
            "id": 429004105
          },
          {
            "name": "西流河镇",
            "id": 429004106
          },
          {
            "name": "沙湖镇",
            "id": 429004107
          },
          {
            "name": "杨林尾镇",
            "id": 429004108
          },
          {
            "name": "彭场镇",
            "id": 429004109
          },
          {
            "name": "张沟镇",
            "id": 429004110
          },
          {
            "name": "郭河镇",
            "id": 429004111
          },
          {
            "name": "沔城回族镇",
            "id": 429004112
          },
          {
            "name": "通海口镇",
            "id": 429004113
          },
          {
            "name": "陈场镇",
            "id": 429004114
          },
          {
            "name": "工业园区",
            "id": 429004400
          },
          {
            "name": "九合垸原种场",
            "id": 429004401
          },
          {
            "name": "沙湖原种场",
            "id": 429004402
          },
          {
            "name": "五湖渔场",
            "id": 429004404
          },
          {
            "name": "赵西垸林场",
            "id": 429004405
          },
          {
            "name": "畜禽良种场",
            "id": 429004407
          },
          {
            "name": "排湖风景区",
            "id": 429004408
          }
        ]
      },
      {
        "name": "潜江",
        "id": 429005,
        "child": [
          {
            "name": "园林办事处",
            "id": 429005001
          },
          {
            "name": "杨市办事处",
            "id": 429005002
          },
          {
            "name": "周矶办事处",
            "id": 429005003
          },
          {
            "name": "广华办事处",
            "id": 429005004
          },
          {
            "name": "泰丰办事处",
            "id": 429005005
          },
          {
            "name": "高场办事处",
            "id": 429005006
          },
          {
            "name": "竹根滩镇",
            "id": 429005100
          },
          {
            "name": "渔洋镇",
            "id": 429005101
          },
          {
            "name": "王场镇",
            "id": 429005102
          },
          {
            "name": "高石碑镇",
            "id": 429005103
          },
          {
            "name": "熊口镇",
            "id": 429005104
          },
          {
            "name": "老新镇",
            "id": 429005105
          },
          {
            "name": "浩口镇",
            "id": 429005106
          },
          {
            "name": "积玉口镇",
            "id": 429005107
          },
          {
            "name": "张金镇",
            "id": 429005108
          },
          {
            "name": "龙湾镇",
            "id": 429005109
          },
          {
            "name": "江汉石油管理局",
            "id": 429005400
          },
          {
            "name": "潜江经济开发区",
            "id": 429005401
          },
          {
            "name": "周矶管理区",
            "id": 429005450
          },
          {
            "name": "后湖管理区",
            "id": 429005451
          },
          {
            "name": "熊口管理区",
            "id": 429005452
          },
          {
            "name": "总口管理区",
            "id": 429005453
          },
          {
            "name": "白鹭湖管理区",
            "id": 429005454
          },
          {
            "name": "运粮湖管理区",
            "id": 429005455
          },
          {
            "name": "浩口原种场",
            "id": 429005457
          }
        ]
      },
      {
        "name": "天门",
        "id": 429006,
        "child": [
          {
            "name": "竟陵街道",
            "id": 429006001
          },
          {
            "name": "侨乡街道开发区",
            "id": 429006002
          },
          {
            "name": "杨林街道",
            "id": 429006003
          },
          {
            "name": "多宝镇",
            "id": 429006100
          },
          {
            "name": "拖市镇",
            "id": 429006101
          },
          {
            "name": "张港镇",
            "id": 429006102
          },
          {
            "name": "蒋场镇",
            "id": 429006103
          },
          {
            "name": "汪场镇",
            "id": 429006104
          },
          {
            "name": "渔薪镇",
            "id": 429006105
          },
          {
            "name": "黄潭镇",
            "id": 429006106
          },
          {
            "name": "岳口镇",
            "id": 429006107
          },
          {
            "name": "横林镇",
            "id": 429006108
          },
          {
            "name": "彭市镇",
            "id": 429006109
          },
          {
            "name": "麻洋镇",
            "id": 429006110
          },
          {
            "name": "多祥镇",
            "id": 429006111
          },
          {
            "name": "干驿镇",
            "id": 429006112
          },
          {
            "name": "马湾镇",
            "id": 429006113
          },
          {
            "name": "卢市镇",
            "id": 429006114
          },
          {
            "name": "小板镇",
            "id": 429006115
          },
          {
            "name": "九真镇",
            "id": 429006116
          },
          {
            "name": "皂市镇",
            "id": 429006118
          },
          {
            "name": "胡市镇",
            "id": 429006119
          },
          {
            "name": "石河镇",
            "id": 429006120
          },
          {
            "name": "佛子山镇",
            "id": 429006121
          },
          {
            "name": "净潭乡",
            "id": 429006201
          },
          {
            "name": "蒋湖农场",
            "id": 429006450
          },
          {
            "name": "白茅湖农场",
            "id": 429006451
          },
          {
            "name": "沉湖管委会",
            "id": 429006452
          }
        ]
      },
      {
        "name": "神农架",
        "id": 429021,
        "child": [
          {
            "name": "松柏镇",
            "id": 429021100
          },
          {
            "name": "阳日镇",
            "id": 429021101
          },
          {
            "name": "木鱼镇",
            "id": 429021102
          },
          {
            "name": "红坪镇",
            "id": 429021103
          },
          {
            "name": "新华镇",
            "id": 429021104
          },
          {
            "name": "九湖镇",
            "id": 429021105
          },
          {
            "name": "宋洛乡",
            "id": 429021200
          },
          {
            "name": "下谷坪土家族乡",
            "id": 429021202
          }
        ]
      }
    ]
  },
  {
    "name": "湖南",
    "id": 430000,
    "child": [
      {
        "name": "长沙",
        "id": 430100,
        "child": [
          {
            "name": "芙蓉",
            "id": 430102
          },
          {
            "name": "天心",
            "id": 430103
          },
          {
            "name": "岳麓",
            "id": 430104
          },
          {
            "name": "开福",
            "id": 430105
          },
          {
            "name": "雨花",
            "id": 430111
          },
          {
            "name": "长沙",
            "id": 430121
          },
          {
            "name": "望城",
            "id": 430122
          },
          {
            "name": "宁乡",
            "id": 430124
          },
          {
            "name": "浏阳",
            "id": 430181
          }
        ]
      },
      {
        "name": "株洲",
        "id": 430200,
        "child": [
          {
            "name": "荷塘",
            "id": 430202
          },
          {
            "name": "芦淞",
            "id": 430203
          },
          {
            "name": "石峰",
            "id": 430204
          },
          {
            "name": "天元",
            "id": 430211
          },
          {
            "name": "株洲",
            "id": 430221
          },
          {
            "name": "攸县",
            "id": 430223
          },
          {
            "name": "茶陵",
            "id": 430224
          },
          {
            "name": "炎陵",
            "id": 430225
          },
          {
            "name": "醴陵",
            "id": 430281
          }
        ]
      },
      {
        "name": "湘潭",
        "id": 430300,
        "child": [
          {
            "name": "雨湖",
            "id": 430302
          },
          {
            "name": "岳塘",
            "id": 430304
          },
          {
            "name": "湘潭",
            "id": 430321
          },
          {
            "name": "湘乡",
            "id": 430381
          },
          {
            "name": "韶山",
            "id": 430382
          }
        ]
      },
      {
        "name": "衡阳",
        "id": 430400,
        "child": [
          {
            "name": "珠晖",
            "id": 430405
          },
          {
            "name": "雁峰",
            "id": 430406
          },
          {
            "name": "石鼓",
            "id": 430407
          },
          {
            "name": "蒸湘",
            "id": 430408
          },
          {
            "name": "南岳",
            "id": 430412
          },
          {
            "name": "衡阳",
            "id": 430421
          },
          {
            "name": "衡南",
            "id": 430422
          },
          {
            "name": "衡山",
            "id": 430423
          },
          {
            "name": "衡东",
            "id": 430424
          },
          {
            "name": "祁东",
            "id": 430426
          },
          {
            "name": "耒阳",
            "id": 430481
          },
          {
            "name": "常宁",
            "id": 430482
          }
        ]
      },
      {
        "name": "邵阳",
        "id": 430500,
        "child": [
          {
            "name": "双清",
            "id": 430502
          },
          {
            "name": "大祥",
            "id": 430503
          },
          {
            "name": "北塔",
            "id": 430511
          },
          {
            "name": "邵东",
            "id": 430521
          },
          {
            "name": "新邵",
            "id": 430522
          },
          {
            "name": "邵阳",
            "id": 430523
          },
          {
            "name": "隆回",
            "id": 430524
          },
          {
            "name": "洞口",
            "id": 430525
          },
          {
            "name": "绥宁",
            "id": 430527
          },
          {
            "name": "新宁",
            "id": 430528
          },
          {
            "name": "城步",
            "id": 430529
          },
          {
            "name": "武冈",
            "id": 430581
          }
        ]
      },
      {
        "name": "岳阳",
        "id": 430600,
        "child": [
          {
            "name": "岳阳楼",
            "id": 430602
          },
          {
            "name": "云溪",
            "id": 430603
          },
          {
            "name": "君山",
            "id": 430611
          },
          {
            "name": "岳阳",
            "id": 430621
          },
          {
            "name": "华容",
            "id": 430623
          },
          {
            "name": "湘阴",
            "id": 430624
          },
          {
            "name": "平江",
            "id": 430626
          },
          {
            "name": "汨罗",
            "id": 430681
          },
          {
            "name": "临湘",
            "id": 430682
          }
        ]
      },
      {
        "name": "常德",
        "id": 430700,
        "child": [
          {
            "name": "武陵",
            "id": 430702
          },
          {
            "name": "鼎城",
            "id": 430703
          },
          {
            "name": "安乡",
            "id": 430721
          },
          {
            "name": "汉寿",
            "id": 430722
          },
          {
            "name": "澧县",
            "id": 430723
          },
          {
            "name": "临澧",
            "id": 430724
          },
          {
            "name": "桃源",
            "id": 430725
          },
          {
            "name": "石门",
            "id": 430726
          },
          {
            "name": "津市",
            "id": 430781
          }
        ]
      },
      {
        "name": "张家界",
        "id": 430800,
        "child": [
          {
            "name": "永定",
            "id": 430802
          },
          {
            "name": "武陵源",
            "id": 430811
          },
          {
            "name": "慈利",
            "id": 430821
          },
          {
            "name": "桑植",
            "id": 430822
          }
        ]
      },
      {
        "name": "益阳",
        "id": 430900,
        "child": [
          {
            "name": "资阳",
            "id": 430902
          },
          {
            "name": "赫山",
            "id": 430903
          },
          {
            "name": "南县",
            "id": 430921
          },
          {
            "name": "桃江",
            "id": 430922
          },
          {
            "name": "安化",
            "id": 430923
          },
          {
            "name": "沅江",
            "id": 430981
          }
        ]
      },
      {
        "name": "郴州",
        "id": 431000,
        "child": [
          {
            "name": "北湖",
            "id": 431002
          },
          {
            "name": "苏仙",
            "id": 431003
          },
          {
            "name": "桂阳",
            "id": 431021
          },
          {
            "name": "宜章",
            "id": 431022
          },
          {
            "name": "永兴",
            "id": 431023
          },
          {
            "name": "嘉禾",
            "id": 431024
          },
          {
            "name": "临武",
            "id": 431025
          },
          {
            "name": "汝城",
            "id": 431026
          },
          {
            "name": "桂东",
            "id": 431027
          },
          {
            "name": "安仁",
            "id": 431028
          },
          {
            "name": "资兴",
            "id": 431081
          }
        ]
      },
      {
        "name": "永州",
        "id": 431100,
        "child": [
          {
            "name": "零陵",
            "id": 431102
          },
          {
            "name": "冷水滩",
            "id": 431103
          },
          {
            "name": "祁阳",
            "id": 431121
          },
          {
            "name": "东安",
            "id": 431122
          },
          {
            "name": "双牌",
            "id": 431123
          },
          {
            "name": "道县",
            "id": 431124
          },
          {
            "name": "江永",
            "id": 431125
          },
          {
            "name": "宁远",
            "id": 431126
          },
          {
            "name": "蓝山",
            "id": 431127
          },
          {
            "name": "新田",
            "id": 431128
          },
          {
            "name": "江华",
            "id": 431129
          }
        ]
      },
      {
        "name": "怀化",
        "id": 431200,
        "child": [
          {
            "name": "鹤城",
            "id": 431202
          },
          {
            "name": "中方",
            "id": 431221
          },
          {
            "name": "沅陵",
            "id": 431222
          },
          {
            "name": "辰溪",
            "id": 431223
          },
          {
            "name": "溆浦",
            "id": 431224
          },
          {
            "name": "会同",
            "id": 431225
          },
          {
            "name": "麻阳",
            "id": 431226
          },
          {
            "name": "新晃",
            "id": 431227
          },
          {
            "name": "芷江",
            "id": 431228
          },
          {
            "name": "靖州",
            "id": 431229
          },
          {
            "name": "通道",
            "id": 431230
          },
          {
            "name": "洪江",
            "id": 431281
          }
        ]
      },
      {
        "name": "娄底",
        "id": 431300,
        "child": [
          {
            "name": "娄星",
            "id": 431302
          },
          {
            "name": "双峰",
            "id": 431321
          },
          {
            "name": "新化",
            "id": 431322
          },
          {
            "name": "冷水江",
            "id": 431381
          },
          {
            "name": "涟源",
            "id": 431382
          }
        ]
      },
      {
        "name": "湘西",
        "id": 433100,
        "child": [
          {
            "name": "吉首",
            "id": 433101
          },
          {
            "name": "泸溪",
            "id": 433122
          },
          {
            "name": "凤凰",
            "id": 433123
          },
          {
            "name": "花垣",
            "id": 433124
          },
          {
            "name": "保靖",
            "id": 433125
          },
          {
            "name": "古丈",
            "id": 433126
          },
          {
            "name": "永顺",
            "id": 433127
          },
          {
            "name": "龙山",
            "id": 433130
          }
        ]
      }
    ]
  },
  {
    "name": "广东",
    "id": 440000,
    "child": [
      {
        "name": "广州",
        "id": 440100,
        "child": [
          {
            "name": "荔湾",
            "id": 440103
          },
          {
            "name": "越秀",
            "id": 440104
          },
          {
            "name": "海珠",
            "id": 440105
          },
          {
            "name": "天河",
            "id": 440106
          },
          {
            "name": "白云",
            "id": 440111
          },
          {
            "name": "黄埔",
            "id": 440112
          },
          {
            "name": "番禺",
            "id": 440113
          },
          {
            "name": "花都",
            "id": 440114
          },
          {
            "name": "南沙",
            "id": 440115
          },
          {
            "name": "萝岗",
            "id": 440116
          },
          {
            "name": "增城",
            "id": 440183
          },
          {
            "name": "从化",
            "id": 440184
          }
        ]
      },
      {
        "name": "韶关",
        "id": 440200,
        "child": [
          {
            "name": "武江",
            "id": 440203
          },
          {
            "name": "浈江",
            "id": 440204
          },
          {
            "name": "曲江",
            "id": 440205
          },
          {
            "name": "始兴",
            "id": 440222
          },
          {
            "name": "仁化",
            "id": 440224
          },
          {
            "name": "翁源",
            "id": 440229
          },
          {
            "name": "乳源",
            "id": 440232
          },
          {
            "name": "新丰",
            "id": 440233
          },
          {
            "name": "乐昌",
            "id": 440281
          },
          {
            "name": "南雄",
            "id": 440282
          }
        ]
      },
      {
        "name": "深圳",
        "id": 440300,
        "child": [
          {
            "name": "罗湖",
            "id": 440303
          },
          {
            "name": "福田",
            "id": 440304
          },
          {
            "name": "南山",
            "id": 440305
          },
          {
            "name": "宝安",
            "id": 440306
          },
          {
            "name": "龙岗",
            "id": 440307
          },
          {
            "name": "盐田",
            "id": 440308
          },
          {
            "name": "光明",
            "id": 440320
          },
          {
            "name": "坪山",
            "id": 440321
          },
          {
            "name": "大鹏",
            "id": 440322
          },
          {
            "name": "龙华",
            "id": 440323
          }
        ]
      },
      {
        "name": "珠海",
        "id": 440400,
        "child": [
          {
            "name": "香洲",
            "id": 440402
          },
          {
            "name": "斗门",
            "id": 440403
          },
          {
            "name": "金湾",
            "id": 440404
          }
        ]
      },
      {
        "name": "汕头",
        "id": 440500,
        "child": [
          {
            "name": "龙湖",
            "id": 440507
          },
          {
            "name": "金平",
            "id": 440511
          },
          {
            "name": "濠江",
            "id": 440512
          },
          {
            "name": "潮阳",
            "id": 440513
          },
          {
            "name": "潮南",
            "id": 440514
          },
          {
            "name": "澄海",
            "id": 440515
          },
          {
            "name": "南澳",
            "id": 440523
          }
        ]
      },
      {
        "name": "佛山",
        "id": 440600,
        "child": [
          {
            "name": "禅城",
            "id": 440604
          },
          {
            "name": "南海",
            "id": 440605
          },
          {
            "name": "顺德",
            "id": 440606
          },
          {
            "name": "三水",
            "id": 440607
          },
          {
            "name": "高明",
            "id": 440608
          }
        ]
      },
      {
        "name": "江门",
        "id": 440700,
        "child": [
          {
            "name": "蓬江",
            "id": 440703
          },
          {
            "name": "江海",
            "id": 440704
          },
          {
            "name": "新会",
            "id": 440705
          },
          {
            "name": "台山",
            "id": 440781
          },
          {
            "name": "开平",
            "id": 440783
          },
          {
            "name": "鹤山",
            "id": 440784
          },
          {
            "name": "恩平",
            "id": 440785
          }
        ]
      },
      {
        "name": "湛江",
        "id": 440800,
        "child": [
          {
            "name": "赤坎",
            "id": 440802
          },
          {
            "name": "霞山",
            "id": 440803
          },
          {
            "name": "坡头",
            "id": 440804
          },
          {
            "name": "麻章",
            "id": 440811
          },
          {
            "name": "遂溪",
            "id": 440823
          },
          {
            "name": "徐闻",
            "id": 440825
          },
          {
            "name": "廉江",
            "id": 440881
          },
          {
            "name": "雷州",
            "id": 440882
          },
          {
            "name": "吴川",
            "id": 440883
          }
        ]
      },
      {
        "name": "茂名",
        "id": 440900,
        "child": [
          {
            "name": "茂南",
            "id": 440902
          },
          {
            "name": "茂港",
            "id": 440903
          },
          {
            "name": "电白",
            "id": 440923
          },
          {
            "name": "高州",
            "id": 440981
          },
          {
            "name": "化州",
            "id": 440982
          },
          {
            "name": "信宜",
            "id": 440983
          }
        ]
      },
      {
        "name": "肇庆",
        "id": 441200,
        "child": [
          {
            "name": "端州",
            "id": 441202
          },
          {
            "name": "鼎湖",
            "id": 441203
          },
          {
            "name": "广宁",
            "id": 441223
          },
          {
            "name": "怀集",
            "id": 441224
          },
          {
            "name": "封开",
            "id": 441225
          },
          {
            "name": "德庆",
            "id": 441226
          },
          {
            "name": "高要",
            "id": 441283
          },
          {
            "name": "四会",
            "id": 441284
          }
        ]
      },
      {
        "name": "惠州",
        "id": 441300,
        "child": [
          {
            "name": "惠城",
            "id": 441302
          },
          {
            "name": "惠阳",
            "id": 441303
          },
          {
            "name": "博罗",
            "id": 441322
          },
          {
            "name": "惠东",
            "id": 441323
          },
          {
            "name": "龙门",
            "id": 441324
          }
        ]
      },
      {
        "name": "梅州",
        "id": 441400,
        "child": [
          {
            "name": "梅江",
            "id": 441402
          },
          {
            "name": "梅县",
            "id": 441421
          },
          {
            "name": "大埔",
            "id": 441422
          },
          {
            "name": "丰顺",
            "id": 441423
          },
          {
            "name": "五华",
            "id": 441424
          },
          {
            "name": "平远",
            "id": 441426
          },
          {
            "name": "蕉岭",
            "id": 441427
          },
          {
            "name": "兴宁",
            "id": 441481
          }
        ]
      },
      {
        "name": "汕尾",
        "id": 441500,
        "child": [
          {
            "name": "城区",
            "id": 441502
          },
          {
            "name": "海丰",
            "id": 441521
          },
          {
            "name": "陆河",
            "id": 441523
          },
          {
            "name": "陆丰",
            "id": 441581
          }
        ]
      },
      {
        "name": "河源",
        "id": 441600,
        "child": [
          {
            "name": "源城",
            "id": 441602
          },
          {
            "name": "紫金",
            "id": 441621
          },
          {
            "name": "龙川",
            "id": 441622
          },
          {
            "name": "连平",
            "id": 441623
          },
          {
            "name": "和平",
            "id": 441624
          },
          {
            "name": "东源",
            "id": 441625
          }
        ]
      },
      {
        "name": "阳江",
        "id": 441700,
        "child": [
          {
            "name": "江城",
            "id": 441702
          },
          {
            "name": "阳西",
            "id": 441721
          },
          {
            "name": "阳东",
            "id": 441723
          },
          {
            "name": "阳春",
            "id": 441781
          }
        ]
      },
      {
        "name": "清远",
        "id": 441800,
        "child": [
          {
            "name": "清城",
            "id": 441802
          },
          {
            "name": "佛冈",
            "id": 441821
          },
          {
            "name": "阳山",
            "id": 441823
          },
          {
            "name": "连山",
            "id": 441825
          },
          {
            "name": "连南",
            "id": 441826
          },
          {
            "name": "清新",
            "id": 441827
          },
          {
            "name": "英德",
            "id": 441881
          },
          {
            "name": "连州",
            "id": 441882
          }
        ]
      },
      {
        "name": "东莞",
        "id": 441900,
        "child": [
          {
            "name": "东城街道",
            "id": 441901003
          },
          {
            "name": "南城街道",
            "id": 441901004
          },
          {
            "name": "万江街道",
            "id": 441901005
          },
          {
            "name": "莞城街道",
            "id": 441901006
          },
          {
            "name": "石碣镇",
            "id": 441901101
          },
          {
            "name": "石龙镇",
            "id": 441901102
          },
          {
            "name": "茶山镇",
            "id": 441901103
          },
          {
            "name": "石排镇",
            "id": 441901104
          },
          {
            "name": "企石镇",
            "id": 441901105
          },
          {
            "name": "横沥镇",
            "id": 441901106
          },
          {
            "name": "桥头镇",
            "id": 441901107
          },
          {
            "name": "谢岗镇",
            "id": 441901108
          },
          {
            "name": "东坑镇",
            "id": 441901109
          },
          {
            "name": "常平镇",
            "id": 441901110
          },
          {
            "name": "寮步镇",
            "id": 441901111
          },
          {
            "name": "樟木头镇",
            "id": 441901112
          },
          {
            "name": "大朗镇",
            "id": 441901113
          },
          {
            "name": "黄江镇",
            "id": 441901114
          },
          {
            "name": "清溪镇",
            "id": 441901115
          },
          {
            "name": "塘厦镇",
            "id": 441901116
          },
          {
            "name": "凤岗镇",
            "id": 441901117
          },
          {
            "name": "大岭山镇",
            "id": 441901118
          },
          {
            "name": "长安镇",
            "id": 441901119
          },
          {
            "name": "虎门镇",
            "id": 441901121
          },
          {
            "name": "厚街镇",
            "id": 441901122
          },
          {
            "name": "沙田镇",
            "id": 441901123
          },
          {
            "name": "道滘镇",
            "id": 441901124
          },
          {
            "name": "洪梅镇",
            "id": 441901125
          },
          {
            "name": "麻涌镇",
            "id": 441901126
          },
          {
            "name": "望牛墩镇",
            "id": 441901127
          },
          {
            "name": "中堂镇",
            "id": 441901128
          },
          {
            "name": "高埗镇",
            "id": 441901129
          },
          {
            "name": "松山湖管委会",
            "id": 441901401
          },
          {
            "name": "虎门港管委会",
            "id": 441901402
          },
          {
            "name": "东莞生态园",
            "id": 441901403
          }
        ]
      },
      {
        "name": "中山",
        "id": 442000,
        "child": [
          {
            "name": "石岐区街道",
            "id": 442001001
          },
          {
            "name": "东区街道",
            "id": 442001002
          },
          {
            "name": "火炬开发区街道",
            "id": 442001003
          },
          {
            "name": "西区街道",
            "id": 442001004
          },
          {
            "name": "南区街道",
            "id": 442001005
          },
          {
            "name": "五桂山街道",
            "id": 442001006
          },
          {
            "name": "小榄镇",
            "id": 442001100
          },
          {
            "name": "黄圃镇",
            "id": 442001101
          },
          {
            "name": "民众镇",
            "id": 442001102
          },
          {
            "name": "东凤镇",
            "id": 442001103
          },
          {
            "name": "东升镇",
            "id": 442001104
          },
          {
            "name": "古镇镇",
            "id": 442001105
          },
          {
            "name": "沙溪镇",
            "id": 442001106
          },
          {
            "name": "坦洲镇",
            "id": 442001107
          },
          {
            "name": "港口镇",
            "id": 442001108
          },
          {
            "name": "三角镇",
            "id": 442001109
          },
          {
            "name": "横栏镇",
            "id": 442001110
          },
          {
            "name": "南头镇",
            "id": 442001111
          },
          {
            "name": "阜沙镇",
            "id": 442001112
          },
          {
            "name": "南朗镇",
            "id": 442001113
          },
          {
            "name": "三乡镇",
            "id": 442001114
          },
          {
            "name": "板芙镇",
            "id": 442001115
          },
          {
            "name": "大涌镇",
            "id": 442001116
          },
          {
            "name": "神湾镇",
            "id": 442001117
          }
        ]
      },
      {
        "name": "东沙",
        "id": 442101,
        "child": []
      },
      {
        "name": "潮州",
        "id": 445100,
        "child": [
          {
            "name": "湘桥",
            "id": 445102
          },
          {
            "name": "潮安",
            "id": 445121
          },
          {
            "name": "饶平",
            "id": 445122
          }
        ]
      },
      {
        "name": "揭阳",
        "id": 445200,
        "child": [
          {
            "name": "榕城",
            "id": 445202
          },
          {
            "name": "揭东",
            "id": 445221
          },
          {
            "name": "揭西",
            "id": 445222
          },
          {
            "name": "惠来",
            "id": 445224
          },
          {
            "name": "普宁",
            "id": 445281
          }
        ]
      },
      {
        "name": "云浮",
        "id": 445300,
        "child": [
          {
            "name": "云城",
            "id": 445302
          },
          {
            "name": "新兴",
            "id": 445321
          },
          {
            "name": "郁南",
            "id": 445322
          },
          {
            "name": "云安",
            "id": 445323
          },
          {
            "name": "罗定",
            "id": 445381
          }
        ]
      }
    ]
  },
  {
    "name": "广西",
    "id": 450000,
    "child": [
      {
        "name": "南宁",
        "id": 450100,
        "child": [
          {
            "name": "兴宁",
            "id": 450102
          },
          {
            "name": "青秀",
            "id": 450103
          },
          {
            "name": "江南",
            "id": 450105
          },
          {
            "name": "西乡塘",
            "id": 450107
          },
          {
            "name": "良庆",
            "id": 450108
          },
          {
            "name": "邕宁",
            "id": 450109
          },
          {
            "name": "武鸣",
            "id": 450122
          },
          {
            "name": "隆安",
            "id": 450123
          },
          {
            "name": "马山",
            "id": 450124
          },
          {
            "name": "上林",
            "id": 450125
          },
          {
            "name": "宾阳",
            "id": 450126
          },
          {
            "name": "横县",
            "id": 450127
          }
        ]
      },
      {
        "name": "柳州",
        "id": 450200,
        "child": [
          {
            "name": "城中",
            "id": 450202
          },
          {
            "name": "鱼峰",
            "id": 450203
          },
          {
            "name": "柳南",
            "id": 450204
          },
          {
            "name": "柳北",
            "id": 450205
          },
          {
            "name": "柳江",
            "id": 450221
          },
          {
            "name": "柳城",
            "id": 450222
          },
          {
            "name": "鹿寨",
            "id": 450223
          },
          {
            "name": "融安",
            "id": 450224
          },
          {
            "name": "融水",
            "id": 450225
          },
          {
            "name": "三江",
            "id": 450226
          }
        ]
      },
      {
        "name": "桂林",
        "id": 450300,
        "child": [
          {
            "name": "秀峰",
            "id": 450302
          },
          {
            "name": "叠彩",
            "id": 450303
          },
          {
            "name": "象山",
            "id": 450304
          },
          {
            "name": "七星",
            "id": 450305
          },
          {
            "name": "雁山",
            "id": 450311
          },
          {
            "name": "阳朔",
            "id": 450321
          },
          {
            "name": "临桂",
            "id": 450322
          },
          {
            "name": "灵川",
            "id": 450323
          },
          {
            "name": "全州",
            "id": 450324
          },
          {
            "name": "兴安",
            "id": 450325
          },
          {
            "name": "永福",
            "id": 450326
          },
          {
            "name": "灌阳",
            "id": 450327
          },
          {
            "name": "龙胜",
            "id": 450328
          },
          {
            "name": "资源",
            "id": 450329
          },
          {
            "name": "平乐",
            "id": 450330
          },
          {
            "name": "荔浦",
            "id": 450331
          },
          {
            "name": "恭城",
            "id": 450332
          }
        ]
      },
      {
        "name": "梧州",
        "id": 450400,
        "child": [
          {
            "name": "万秀",
            "id": 450403
          },
          {
            "name": "长洲",
            "id": 450405
          },
          {
            "name": "龙圩",
            "id": 450406
          },
          {
            "name": "苍梧",
            "id": 450421
          },
          {
            "name": "藤县",
            "id": 450422
          },
          {
            "name": "蒙山",
            "id": 450423
          },
          {
            "name": "岑溪",
            "id": 450481
          }
        ]
      },
      {
        "name": "北海",
        "id": 450500,
        "child": [
          {
            "name": "海城",
            "id": 450502
          },
          {
            "name": "银海",
            "id": 450503
          },
          {
            "name": "铁山港",
            "id": 450512
          },
          {
            "name": "合浦",
            "id": 450521
          }
        ]
      },
      {
        "name": "防城港",
        "id": 450600,
        "child": [
          {
            "name": "港口",
            "id": 450602
          },
          {
            "name": "防城",
            "id": 450603
          },
          {
            "name": "上思",
            "id": 450621
          },
          {
            "name": "东兴",
            "id": 450681
          }
        ]
      },
      {
        "name": "钦州",
        "id": 450700,
        "child": [
          {
            "name": "钦南",
            "id": 450702
          },
          {
            "name": "钦北",
            "id": 450703
          },
          {
            "name": "灵山",
            "id": 450721
          },
          {
            "name": "浦北",
            "id": 450722
          }
        ]
      },
      {
        "name": "贵港",
        "id": 450800,
        "child": [
          {
            "name": "港北",
            "id": 450802
          },
          {
            "name": "港南",
            "id": 450803
          },
          {
            "name": "覃塘",
            "id": 450804
          },
          {
            "name": "平南",
            "id": 450821
          },
          {
            "name": "桂平",
            "id": 450881
          }
        ]
      },
      {
        "name": "玉林",
        "id": 450900,
        "child": [
          {
            "name": "玉州",
            "id": 450902
          },
          {
            "name": "福绵",
            "id": 450903
          },
          {
            "name": "容县",
            "id": 450921
          },
          {
            "name": "陆川",
            "id": 450922
          },
          {
            "name": "博白",
            "id": 450923
          },
          {
            "name": "兴业",
            "id": 450924
          },
          {
            "name": "北流",
            "id": 450981
          }
        ]
      },
      {
        "name": "百色",
        "id": 451000,
        "child": [
          {
            "name": "右江",
            "id": 451002
          },
          {
            "name": "田阳",
            "id": 451021
          },
          {
            "name": "田东",
            "id": 451022
          },
          {
            "name": "平果",
            "id": 451023
          },
          {
            "name": "德保",
            "id": 451024
          },
          {
            "name": "靖西",
            "id": 451025
          },
          {
            "name": "那坡",
            "id": 451026
          },
          {
            "name": "凌云",
            "id": 451027
          },
          {
            "name": "乐业",
            "id": 451028
          },
          {
            "name": "田林",
            "id": 451029
          },
          {
            "name": "西林",
            "id": 451030
          },
          {
            "name": "隆林",
            "id": 451031
          }
        ]
      },
      {
        "name": "贺州",
        "id": 451100,
        "child": [
          {
            "name": "八步",
            "id": 451102
          },
          {
            "name": "平桂",
            "id": 451119
          },
          {
            "name": "昭平",
            "id": 451121
          },
          {
            "name": "钟山",
            "id": 451122
          },
          {
            "name": "富川",
            "id": 451123
          }
        ]
      },
      {
        "name": "河池",
        "id": 451200,
        "child": [
          {
            "name": "金城江",
            "id": 451202
          },
          {
            "name": "南丹",
            "id": 451221
          },
          {
            "name": "天峨",
            "id": 451222
          },
          {
            "name": "凤山",
            "id": 451223
          },
          {
            "name": "东兰",
            "id": 451224
          },
          {
            "name": "罗城",
            "id": 451225
          },
          {
            "name": "环江",
            "id": 451226
          },
          {
            "name": "巴马",
            "id": 451227
          },
          {
            "name": "都安",
            "id": 451228
          },
          {
            "name": "大化",
            "id": 451229
          },
          {
            "name": "宜州",
            "id": 451281
          }
        ]
      },
      {
        "name": "来宾",
        "id": 451300,
        "child": [
          {
            "name": "兴宾",
            "id": 451302
          },
          {
            "name": "忻城",
            "id": 451321
          },
          {
            "name": "象州",
            "id": 451322
          },
          {
            "name": "武宣",
            "id": 451323
          },
          {
            "name": "金秀",
            "id": 451324
          },
          {
            "name": "合山",
            "id": 451381
          }
        ]
      },
      {
        "name": "崇左",
        "id": 451400,
        "child": [
          {
            "name": "江州",
            "id": 451402
          },
          {
            "name": "扶绥",
            "id": 451421
          },
          {
            "name": "宁明",
            "id": 451422
          },
          {
            "name": "龙州",
            "id": 451423
          },
          {
            "name": "大新",
            "id": 451424
          },
          {
            "name": "天等",
            "id": 451425
          },
          {
            "name": "凭祥",
            "id": 451481
          }
        ]
      }
    ]
  },
  {
    "name": "海南",
    "id": 460000,
    "child": [
      {
        "name": "海口",
        "id": 460100,
        "child": [
          {
            "name": "秀英",
            "id": 460105
          },
          {
            "name": "龙华",
            "id": 460106
          },
          {
            "name": "琼山",
            "id": 460107
          },
          {
            "name": "美兰",
            "id": 460108
          }
        ]
      },
      {
        "name": "三亚",
        "id": 460200,
        "child": [
          {
            "name": "海棠湾镇",
            "id": 460201100
          },
          {
            "name": "吉阳镇",
            "id": 460201101
          },
          {
            "name": "凤凰镇",
            "id": 460201102
          },
          {
            "name": "崖城镇",
            "id": 460201103
          },
          {
            "name": "天涯镇",
            "id": 460201104
          },
          {
            "name": "育才镇",
            "id": 460201105
          },
          {
            "name": "国营南田农场",
            "id": 460201400
          },
          {
            "name": "国营南新农场",
            "id": 460201401
          },
          {
            "name": "国营立才农场",
            "id": 460201403
          },
          {
            "name": "国营南滨农场",
            "id": 460201404
          },
          {
            "name": "河西区街道",
            "id": 460201451
          },
          {
            "name": "河东区街道",
            "id": 460201452
          }
        ]
      },
      {
        "name": "三沙",
        "id": 460300,
        "child": [
          {
            "name": "西沙",
            "id": 460321
          },
          {
            "name": "南沙",
            "id": 460322
          },
          {
            "name": "中沙",
            "id": 460323
          }
        ]
      },
      {
        "name": "五指山",
        "id": 469001,
        "child": [
          {
            "name": "通什镇",
            "id": 469001100
          },
          {
            "name": "南圣镇",
            "id": 469001101
          },
          {
            "name": "毛阳镇",
            "id": 469001102
          },
          {
            "name": "番阳镇",
            "id": 469001103
          },
          {
            "name": "畅好乡",
            "id": 469001200
          },
          {
            "name": "毛道乡",
            "id": 469001201
          },
          {
            "name": "水满乡",
            "id": 469001202
          },
          {
            "name": "国营畅好农场",
            "id": 469001400
          }
        ]
      },
      {
        "name": "琼海",
        "id": 469002,
        "child": [
          {
            "name": "嘉积镇",
            "id": 469002100
          },
          {
            "name": "万泉镇",
            "id": 469002101
          },
          {
            "name": "石壁镇",
            "id": 469002102
          },
          {
            "name": "中原镇",
            "id": 469002103
          },
          {
            "name": "博鳌镇",
            "id": 469002104
          },
          {
            "name": "阳江镇",
            "id": 469002105
          },
          {
            "name": "龙江镇",
            "id": 469002106
          },
          {
            "name": "潭门镇",
            "id": 469002107
          },
          {
            "name": "塔洋镇",
            "id": 469002108
          },
          {
            "name": "长坡镇",
            "id": 469002109
          },
          {
            "name": "大路镇",
            "id": 469002110
          },
          {
            "name": "会山镇",
            "id": 469002111
          },
          {
            "name": "国营东太农场",
            "id": 469002400
          },
          {
            "name": "国营东红农场",
            "id": 469002402
          },
          {
            "name": "国营东升农场",
            "id": 469002403
          },
          {
            "name": "彬村山华侨农场",
            "id": 469002500
          }
        ]
      },
      {
        "name": "儋州",
        "id": 469003,
        "child": [
          {
            "name": "那大镇",
            "id": 469003100
          },
          {
            "name": "和庆镇",
            "id": 469003101
          },
          {
            "name": "南丰镇",
            "id": 469003102
          },
          {
            "name": "大成镇",
            "id": 469003103
          },
          {
            "name": "雅星镇",
            "id": 469003104
          },
          {
            "name": "兰洋镇",
            "id": 469003105
          },
          {
            "name": "光村镇",
            "id": 469003106
          },
          {
            "name": "木棠镇",
            "id": 469003107
          },
          {
            "name": "海头镇",
            "id": 469003108
          },
          {
            "name": "峨蔓镇",
            "id": 469003109
          },
          {
            "name": "三都镇",
            "id": 469003110
          },
          {
            "name": "王五镇",
            "id": 469003111
          },
          {
            "name": "白马井镇",
            "id": 469003112
          },
          {
            "name": "中和镇",
            "id": 469003113
          },
          {
            "name": "排浦镇",
            "id": 469003114
          },
          {
            "name": "东成镇",
            "id": 469003115
          },
          {
            "name": "新州镇",
            "id": 469003116
          },
          {
            "name": "国营西培农场",
            "id": 469003400
          },
          {
            "name": "国营西联农场",
            "id": 469003404
          },
          {
            "name": "国营蓝洋农场",
            "id": 469003405
          },
          {
            "name": "国营八一农场",
            "id": 469003407
          },
          {
            "name": "洋浦经济开发区",
            "id": 469003499
          },
          {
            "name": "华南热作学院",
            "id": 469003500
          }
        ]
      },
      {
        "name": "文昌",
        "id": 469005,
        "child": [
          {
            "name": "文城镇",
            "id": 469005100
          },
          {
            "name": "重兴镇",
            "id": 469005101
          },
          {
            "name": "蓬莱镇",
            "id": 469005102
          },
          {
            "name": "会文镇",
            "id": 469005103
          },
          {
            "name": "东路镇",
            "id": 469005104
          },
          {
            "name": "潭牛镇",
            "id": 469005105
          },
          {
            "name": "东阁镇",
            "id": 469005106
          },
          {
            "name": "文教镇",
            "id": 469005107
          },
          {
            "name": "东郊镇",
            "id": 469005108
          },
          {
            "name": "龙楼镇",
            "id": 469005109
          },
          {
            "name": "昌洒镇",
            "id": 469005110
          },
          {
            "name": "翁田镇",
            "id": 469005111
          },
          {
            "name": "抱罗镇",
            "id": 469005112
          },
          {
            "name": "冯坡镇",
            "id": 469005113
          },
          {
            "name": "锦山镇",
            "id": 469005114
          },
          {
            "name": "铺前镇",
            "id": 469005115
          },
          {
            "name": "公坡镇",
            "id": 469005116
          },
          {
            "name": "国营东路农场",
            "id": 469005400
          },
          {
            "name": "国营南阳农场",
            "id": 469005401
          },
          {
            "name": "国营罗豆农场",
            "id": 469005402
          }
        ]
      },
      {
        "name": "万宁",
        "id": 469006,
        "child": [
          {
            "name": "万城镇",
            "id": 469006100
          },
          {
            "name": "龙滚镇",
            "id": 469006101
          },
          {
            "name": "和乐镇",
            "id": 469006102
          },
          {
            "name": "后安镇",
            "id": 469006103
          },
          {
            "name": "大茂镇",
            "id": 469006104
          },
          {
            "name": "东澳镇",
            "id": 469006105
          },
          {
            "name": "礼纪镇",
            "id": 469006106
          },
          {
            "name": "长丰镇",
            "id": 469006107
          },
          {
            "name": "山根镇",
            "id": 469006108
          },
          {
            "name": "北大镇",
            "id": 469006109
          },
          {
            "name": "南桥镇",
            "id": 469006110
          },
          {
            "name": "三更罗镇",
            "id": 469006111
          },
          {
            "name": "国营东兴农场",
            "id": 469006400
          },
          {
            "name": "国营东和农场",
            "id": 469006401
          },
          {
            "name": "国营新中农场",
            "id": 469006404
          },
          {
            "name": "兴隆华侨农场",
            "id": 469006500
          },
          {
            "name": "地方国营六连林场",
            "id": 469006501
          }
        ]
      },
      {
        "name": "东方",
        "id": 469007,
        "child": [
          {
            "name": "八所镇",
            "id": 469007100
          },
          {
            "name": "东河镇",
            "id": 469007101
          },
          {
            "name": "大田镇",
            "id": 469007102
          },
          {
            "name": "感城镇",
            "id": 469007103
          },
          {
            "name": "板桥镇",
            "id": 469007104
          },
          {
            "name": "三家镇",
            "id": 469007105
          },
          {
            "name": "四更镇",
            "id": 469007106
          },
          {
            "name": "新龙镇",
            "id": 469007107
          },
          {
            "name": "天安乡",
            "id": 469007200
          },
          {
            "name": "江边乡",
            "id": 469007201
          },
          {
            "name": "国营广坝农场",
            "id": 469007400
          },
          {
            "name": "东方华侨农场",
            "id": 469007500
          }
        ]
      },
      {
        "name": "定安",
        "id": 469025,
        "child": [
          {
            "name": "定城镇",
            "id": 469021100
          },
          {
            "name": "新竹镇",
            "id": 469021101
          },
          {
            "name": "龙湖镇",
            "id": 469021102
          },
          {
            "name": "黄竹镇",
            "id": 469021103
          },
          {
            "name": "雷鸣镇",
            "id": 469021104
          },
          {
            "name": "龙门镇",
            "id": 469021105
          },
          {
            "name": "龙河镇",
            "id": 469021106
          },
          {
            "name": "岭口镇",
            "id": 469021107
          },
          {
            "name": "翰林镇",
            "id": 469021108
          },
          {
            "name": "富文镇",
            "id": 469021109
          },
          {
            "name": "国营中瑞农场",
            "id": 469021400
          },
          {
            "name": "国营南海农场",
            "id": 469021401
          },
          {
            "name": "国营金鸡岭农场",
            "id": 469021402
          }
        ]
      },
      {
        "name": "屯昌",
        "id": 469026,
        "child": [
          {
            "name": "屯城镇",
            "id": 469022100
          },
          {
            "name": "新兴镇",
            "id": 469022101
          },
          {
            "name": "枫木镇",
            "id": 469022102
          },
          {
            "name": "乌坡镇",
            "id": 469022103
          },
          {
            "name": "南吕镇",
            "id": 469022104
          },
          {
            "name": "南坤镇",
            "id": 469022105
          },
          {
            "name": "坡心镇",
            "id": 469022106
          },
          {
            "name": "西昌镇",
            "id": 469022107
          },
          {
            "name": "国营中建农场",
            "id": 469022400
          },
          {
            "name": "国营中坤农场",
            "id": 469022401
          }
        ]
      },
      {
        "name": "澄迈",
        "id": 469027,
        "child": [
          {
            "name": "金江镇",
            "id": 469023100
          },
          {
            "name": "老城镇",
            "id": 469023101
          },
          {
            "name": "瑞溪镇",
            "id": 469023102
          },
          {
            "name": "永发镇",
            "id": 469023103
          },
          {
            "name": "加乐镇",
            "id": 469023104
          },
          {
            "name": "文儒镇",
            "id": 469023105
          },
          {
            "name": "中兴镇",
            "id": 469023106
          },
          {
            "name": "仁兴镇",
            "id": 469023107
          },
          {
            "name": "福山镇",
            "id": 469023108
          },
          {
            "name": "桥头镇",
            "id": 469023109
          },
          {
            "name": "大丰镇",
            "id": 469023110
          },
          {
            "name": "国营红光农场",
            "id": 469023400
          },
          {
            "name": "国营西达农场",
            "id": 469023402
          },
          {
            "name": "国营金安农场",
            "id": 469023405
          }
        ]
      },
      {
        "name": "临高",
        "id": 469028,
        "child": [
          {
            "name": "临城镇",
            "id": 469024100
          },
          {
            "name": "波莲镇",
            "id": 469024101
          },
          {
            "name": "东英镇",
            "id": 469024102
          },
          {
            "name": "博厚镇",
            "id": 469024103
          },
          {
            "name": "皇桐镇",
            "id": 469024104
          },
          {
            "name": "多文镇",
            "id": 469024105
          },
          {
            "name": "和舍镇",
            "id": 469024106
          },
          {
            "name": "南宝镇",
            "id": 469024107
          },
          {
            "name": "新盈镇",
            "id": 469024108
          },
          {
            "name": "调楼镇",
            "id": 469024109
          },
          {
            "name": "国营红华农场",
            "id": 469024400
          },
          {
            "name": "国营加来农场",
            "id": 469024401
          }
        ]
      },
      {
        "name": "白沙",
        "id": 469030,
        "child": [
          {
            "name": "牙叉镇",
            "id": 469025100
          },
          {
            "name": "七坊镇",
            "id": 469025101
          },
          {
            "name": "邦溪镇",
            "id": 469025102
          },
          {
            "name": "打安镇",
            "id": 469025103
          },
          {
            "name": "细水乡",
            "id": 469025200
          },
          {
            "name": "元门乡",
            "id": 469025201
          },
          {
            "name": "南开乡",
            "id": 469025202
          },
          {
            "name": "阜龙乡",
            "id": 469025203
          },
          {
            "name": "青松乡",
            "id": 469025204
          },
          {
            "name": "金波乡",
            "id": 469025205
          },
          {
            "name": "荣邦乡",
            "id": 469025206
          },
          {
            "name": "国营白沙农场",
            "id": 469025401
          },
          {
            "name": "国营龙江农场",
            "id": 469025404
          },
          {
            "name": "国营邦溪农场",
            "id": 469025408
          }
        ]
      },
      {
        "name": "昌江",
        "id": 469031,
        "child": [
          {
            "name": "石碌镇",
            "id": 469026100
          },
          {
            "name": "叉河镇",
            "id": 469026101
          },
          {
            "name": "十月田镇",
            "id": 469026102
          },
          {
            "name": "乌烈镇",
            "id": 469026103
          },
          {
            "name": "昌化镇",
            "id": 469026104
          },
          {
            "name": "海尾镇",
            "id": 469026105
          },
          {
            "name": "七叉镇",
            "id": 469026106
          },
          {
            "name": "王下乡",
            "id": 469026200
          },
          {
            "name": "国营红林农场",
            "id": 469026401
          },
          {
            "name": "国营霸王岭林场",
            "id": 469026500
          },
          {
            "name": "海南矿业联合有限公司",
            "id": 469026501
          }
        ]
      },
      {
        "name": "乐东",
        "id": 469033,
        "child": [
          {
            "name": "抱由镇",
            "id": 469027100
          },
          {
            "name": "万冲镇",
            "id": 469027101
          },
          {
            "name": "大安镇",
            "id": 469027102
          },
          {
            "name": "志仲镇",
            "id": 469027103
          },
          {
            "name": "千家镇",
            "id": 469027104
          },
          {
            "name": "九所镇",
            "id": 469027105
          },
          {
            "name": "利国镇",
            "id": 469027106
          },
          {
            "name": "黄流镇",
            "id": 469027107
          },
          {
            "name": "佛罗镇",
            "id": 469027108
          },
          {
            "name": "尖峰镇",
            "id": 469027109
          },
          {
            "name": "莺歌海镇",
            "id": 469027110
          },
          {
            "name": "国营山荣农场",
            "id": 469027401
          },
          {
            "name": "国营乐光农场",
            "id": 469027402
          },
          {
            "name": "国营保国农场",
            "id": 469027405
          },
          {
            "name": "国营尖峰岭林业公司",
            "id": 469027500
          },
          {
            "name": "国营莺歌海盐场",
            "id": 469027501
          }
        ]
      },
      {
        "name": "陵水",
        "id": 469034,
        "child": [
          {
            "name": "椰林镇",
            "id": 469028100
          },
          {
            "name": "光坡镇",
            "id": 469028101
          },
          {
            "name": "三才镇",
            "id": 469028102
          },
          {
            "name": "英州镇",
            "id": 469028103
          },
          {
            "name": "隆广镇",
            "id": 469028104
          },
          {
            "name": "文罗镇",
            "id": 469028105
          },
          {
            "name": "本号镇",
            "id": 469028106
          },
          {
            "name": "新村镇",
            "id": 469028107
          },
          {
            "name": "黎安镇",
            "id": 469028108
          },
          {
            "name": "提蒙乡",
            "id": 469028200
          },
          {
            "name": "群英乡",
            "id": 469028201
          },
          {
            "name": "国营岭门农场",
            "id": 469028400
          },
          {
            "name": "国营南平农场",
            "id": 469028401
          },
          {
            "name": "国营吊罗山林业公司",
            "id": 469028500
          }
        ]
      },
      {
        "name": "保亭",
        "id": 469035,
        "child": [
          {
            "name": "保城镇",
            "id": 469029100
          },
          {
            "name": "什玲镇",
            "id": 469029101
          },
          {
            "name": "加茂镇",
            "id": 469029102
          },
          {
            "name": "响水镇",
            "id": 469029103
          },
          {
            "name": "新政镇",
            "id": 469029104
          },
          {
            "name": "三道镇",
            "id": 469029105
          },
          {
            "name": "六弓乡",
            "id": 469029200
          },
          {
            "name": "南林乡",
            "id": 469029201
          },
          {
            "name": "毛感乡",
            "id": 469029202
          },
          {
            "name": "国营新星农场",
            "id": 469029401
          },
          {
            "name": "海南保亭热带作物研究所",
            "id": 469029402
          },
          {
            "name": "国营金江农场",
            "id": 469029403
          },
          {
            "name": "国营三道农场",
            "id": 469029405
          }
        ]
      },
      {
        "name": "琼中",
        "id": 469036,
        "child": [
          {
            "name": "营根镇",
            "id": 469030100
          },
          {
            "name": "湾岭镇",
            "id": 469030101
          },
          {
            "name": "黎母山镇",
            "id": 469030102
          },
          {
            "name": "和平镇",
            "id": 469030103
          },
          {
            "name": "长征镇",
            "id": 469030104
          },
          {
            "name": "红毛镇",
            "id": 469030105
          },
          {
            "name": "中平镇",
            "id": 469030106
          },
          {
            "name": "吊罗山乡",
            "id": 469030200
          },
          {
            "name": "上安乡",
            "id": 469030201
          },
          {
            "name": "什运乡",
            "id": 469030202
          },
          {
            "name": "国营阳江农场",
            "id": 469030402
          },
          {
            "name": "国营乌石农场",
            "id": 469030403
          },
          {
            "name": "国营加钗农场",
            "id": 469030406
          },
          {
            "name": "国营长征农场",
            "id": 469030407
          },
          {
            "name": "国营黎母山林业公司",
            "id": 469030500
          }
        ]
      }
    ]
  },
  {
    "name": "重庆",
    "id": 500000,
    "child": [
      {
        "name": "重庆",
        "id": 500100,
        "child": [
          {
            "name": "万州",
            "id": 500101
          },
          {
            "name": "涪陵",
            "id": 500102
          },
          {
            "name": "渝中",
            "id": 500103
          },
          {
            "name": "大渡口",
            "id": 500104
          },
          {
            "name": "江北",
            "id": 500105
          },
          {
            "name": "沙坪坝",
            "id": 500106
          },
          {
            "name": "九龙坡",
            "id": 500107
          },
          {
            "name": "南岸",
            "id": 500108
          },
          {
            "name": "北碚",
            "id": 500109
          },
          {
            "name": "渝北",
            "id": 500112
          },
          {
            "name": "巴南",
            "id": 500113
          },
          {
            "name": "黔江",
            "id": 500114
          },
          {
            "name": "长寿",
            "id": 500115
          },
          {
            "name": "綦江",
            "id": 500222
          },
          {
            "name": "潼南",
            "id": 500223
          },
          {
            "name": "铜梁",
            "id": 500224
          },
          {
            "name": "大足",
            "id": 500225
          },
          {
            "name": "荣昌",
            "id": 500226
          },
          {
            "name": "璧山",
            "id": 500227
          },
          {
            "name": "梁平",
            "id": 500228
          },
          {
            "name": "城口",
            "id": 500229
          },
          {
            "name": "丰都",
            "id": 500230
          },
          {
            "name": "垫江",
            "id": 500231
          },
          {
            "name": "武隆",
            "id": 500232
          },
          {
            "name": "忠县",
            "id": 500233
          },
          {
            "name": "开县",
            "id": 500234
          },
          {
            "name": "云阳",
            "id": 500235
          },
          {
            "name": "奉节",
            "id": 500236
          },
          {
            "name": "巫山",
            "id": 500237
          },
          {
            "name": "巫溪",
            "id": 500238
          },
          {
            "name": "石柱",
            "id": 500240
          },
          {
            "name": "秀山",
            "id": 500241
          },
          {
            "name": "酉阳",
            "id": 500242
          },
          {
            "name": "彭水",
            "id": 500243
          },
          {
            "name": "江津",
            "id": 500381
          },
          {
            "name": "合川",
            "id": 500382
          },
          {
            "name": "永川",
            "id": 500383
          },
          {
            "name": "南川",
            "id": 500384
          }
        ]
      }
    ]
  },
  {
    "name": "四川",
    "id": 510000,
    "child": [
      {
        "name": "成都",
        "id": 510100,
        "child": [
          {
            "name": "锦江",
            "id": 510104
          },
          {
            "name": "青羊",
            "id": 510105
          },
          {
            "name": "金牛",
            "id": 510106
          },
          {
            "name": "武侯",
            "id": 510107
          },
          {
            "name": "成华",
            "id": 510108
          },
          {
            "name": "龙泉驿",
            "id": 510112
          },
          {
            "name": "青白江",
            "id": 510113
          },
          {
            "name": "新都",
            "id": 510114
          },
          {
            "name": "温江",
            "id": 510115
          },
          {
            "name": "金堂",
            "id": 510121
          },
          {
            "name": "双流",
            "id": 510122
          },
          {
            "name": "郫县",
            "id": 510124
          },
          {
            "name": "大邑",
            "id": 510129
          },
          {
            "name": "蒲江",
            "id": 510131
          },
          {
            "name": "新津",
            "id": 510132
          },
          {
            "name": "都江堰",
            "id": 510181
          },
          {
            "name": "彭州",
            "id": 510182
          },
          {
            "name": "邛崃",
            "id": 510183
          },
          {
            "name": "崇州",
            "id": 510184
          }
        ]
      },
      {
        "name": "自贡",
        "id": 510300,
        "child": [
          {
            "name": "自流井",
            "id": 510302
          },
          {
            "name": "贡井",
            "id": 510303
          },
          {
            "name": "大安",
            "id": 510304
          },
          {
            "name": "沿滩",
            "id": 510311
          },
          {
            "name": "荣县",
            "id": 510321
          },
          {
            "name": "富顺",
            "id": 510322
          }
        ]
      },
      {
        "name": "攀枝花",
        "id": 510400,
        "child": [
          {
            "name": "东区",
            "id": 510402
          },
          {
            "name": "西区",
            "id": 510403
          },
          {
            "name": "仁和",
            "id": 510411
          },
          {
            "name": "米易",
            "id": 510421
          },
          {
            "name": "盐边",
            "id": 510422
          }
        ]
      },
      {
        "name": "泸州",
        "id": 510500,
        "child": [
          {
            "name": "江阳",
            "id": 510502
          },
          {
            "name": "纳溪",
            "id": 510503
          },
          {
            "name": "龙马潭",
            "id": 510504
          },
          {
            "name": "泸县",
            "id": 510521
          },
          {
            "name": "合江",
            "id": 510522
          },
          {
            "name": "叙永",
            "id": 510524
          },
          {
            "name": "古蔺",
            "id": 510525
          }
        ]
      },
      {
        "name": "德阳",
        "id": 510600,
        "child": [
          {
            "name": "旌阳",
            "id": 510603
          },
          {
            "name": "中江",
            "id": 510623
          },
          {
            "name": "罗江",
            "id": 510626
          },
          {
            "name": "广汉",
            "id": 510681
          },
          {
            "name": "什邡",
            "id": 510682
          },
          {
            "name": "绵竹",
            "id": 510683
          }
        ]
      },
      {
        "name": "绵阳",
        "id": 510700,
        "child": [
          {
            "name": "涪城",
            "id": 510703
          },
          {
            "name": "游仙",
            "id": 510704
          },
          {
            "name": "三台",
            "id": 510722
          },
          {
            "name": "盐亭",
            "id": 510723
          },
          {
            "name": "安县",
            "id": 510724
          },
          {
            "name": "梓潼",
            "id": 510725
          },
          {
            "name": "北川",
            "id": 510726
          },
          {
            "name": "平武",
            "id": 510727
          },
          {
            "name": "江油",
            "id": 510781
          }
        ]
      },
      {
        "name": "广元",
        "id": 510800,
        "child": [
          {
            "name": "利州",
            "id": 510802
          },
          {
            "name": "昭化",
            "id": 510811
          },
          {
            "name": "朝天",
            "id": 510812
          },
          {
            "name": "旺苍",
            "id": 510821
          },
          {
            "name": "青川",
            "id": 510822
          },
          {
            "name": "剑阁",
            "id": 510823
          },
          {
            "name": "苍溪",
            "id": 510824
          }
        ]
      },
      {
        "name": "遂宁",
        "id": 510900,
        "child": [
          {
            "name": "船山",
            "id": 510903
          },
          {
            "name": "安居",
            "id": 510904
          },
          {
            "name": "蓬溪",
            "id": 510921
          },
          {
            "name": "射洪",
            "id": 510922
          },
          {
            "name": "大英",
            "id": 510923
          }
        ]
      },
      {
        "name": "内江",
        "id": 511000,
        "child": [
          {
            "name": "市中",
            "id": 511002
          },
          {
            "name": "东兴",
            "id": 511011
          },
          {
            "name": "威远",
            "id": 511024
          },
          {
            "name": "资中",
            "id": 511025
          },
          {
            "name": "隆昌",
            "id": 511028
          }
        ]
      },
      {
        "name": "乐山",
        "id": 511100,
        "child": [
          {
            "name": "市中",
            "id": 511102
          },
          {
            "name": "沙湾",
            "id": 511111
          },
          {
            "name": "五通桥",
            "id": 511112
          },
          {
            "name": "金口河",
            "id": 511113
          },
          {
            "name": "犍为",
            "id": 511123
          },
          {
            "name": "井研",
            "id": 511124
          },
          {
            "name": "夹江",
            "id": 511126
          },
          {
            "name": "沐川",
            "id": 511129
          },
          {
            "name": "峨边",
            "id": 511132
          },
          {
            "name": "马边",
            "id": 511133
          },
          {
            "name": "峨眉山",
            "id": 511181
          }
        ]
      },
      {
        "name": "南充",
        "id": 511300,
        "child": [
          {
            "name": "顺庆",
            "id": 511302
          },
          {
            "name": "高坪",
            "id": 511303
          },
          {
            "name": "嘉陵",
            "id": 511304
          },
          {
            "name": "南部",
            "id": 511321
          },
          {
            "name": "营山",
            "id": 511322
          },
          {
            "name": "蓬安",
            "id": 511323
          },
          {
            "name": "仪陇",
            "id": 511324
          },
          {
            "name": "西充",
            "id": 511325
          },
          {
            "name": "阆中",
            "id": 511381
          }
        ]
      },
      {
        "name": "眉山",
        "id": 511400,
        "child": [
          {
            "name": "东坡",
            "id": 511402
          },
          {
            "name": "仁寿",
            "id": 511421
          },
          {
            "name": "彭山",
            "id": 511422
          },
          {
            "name": "洪雅",
            "id": 511423
          },
          {
            "name": "丹棱",
            "id": 511424
          },
          {
            "name": "青神",
            "id": 511425
          }
        ]
      },
      {
        "name": "宜宾",
        "id": 511500,
        "child": [
          {
            "name": "翠屏",
            "id": 511502
          },
          {
            "name": "宜宾",
            "id": 511521
          },
          {
            "name": "南溪",
            "id": 511522
          },
          {
            "name": "江安",
            "id": 511523
          },
          {
            "name": "长宁",
            "id": 511524
          },
          {
            "name": "高县",
            "id": 511525
          },
          {
            "name": "珙县",
            "id": 511526
          },
          {
            "name": "筠连",
            "id": 511527
          },
          {
            "name": "兴文",
            "id": 511528
          },
          {
            "name": "屏山",
            "id": 511529
          }
        ]
      },
      {
        "name": "广安",
        "id": 511600,
        "child": [
          {
            "name": "广安",
            "id": 511602
          },
          {
            "name": "前锋",
            "id": 511603
          },
          {
            "name": "岳池",
            "id": 511621
          },
          {
            "name": "武胜",
            "id": 511622
          },
          {
            "name": "邻水",
            "id": 511623
          },
          {
            "name": "华蓥",
            "id": 511681
          }
        ]
      },
      {
        "name": "达州",
        "id": 511700,
        "child": [
          {
            "name": "通川",
            "id": 511702
          },
          {
            "name": "达川",
            "id": 511721
          },
          {
            "name": "宣汉",
            "id": 511722
          },
          {
            "name": "开江",
            "id": 511723
          },
          {
            "name": "大竹",
            "id": 511724
          },
          {
            "name": "渠县",
            "id": 511725
          },
          {
            "name": "万源",
            "id": 511781
          }
        ]
      },
      {
        "name": "雅安",
        "id": 511800,
        "child": [
          {
            "name": "雨城",
            "id": 511802
          },
          {
            "name": "名山",
            "id": 511821
          },
          {
            "name": "荥经",
            "id": 511822
          },
          {
            "name": "汉源",
            "id": 511823
          },
          {
            "name": "石棉",
            "id": 511824
          },
          {
            "name": "天全",
            "id": 511825
          },
          {
            "name": "芦山",
            "id": 511826
          },
          {
            "name": "宝兴",
            "id": 511827
          }
        ]
      },
      {
        "name": "巴中",
        "id": 511900,
        "child": [
          {
            "name": "巴州",
            "id": 511902
          },
          {
            "name": "恩阳",
            "id": 511903
          },
          {
            "name": "通江",
            "id": 511921
          },
          {
            "name": "南江",
            "id": 511922
          },
          {
            "name": "平昌",
            "id": 511923
          }
        ]
      },
      {
        "name": "资阳",
        "id": 512000,
        "child": [
          {
            "name": "雁江",
            "id": 512002
          },
          {
            "name": "安岳",
            "id": 512021
          },
          {
            "name": "乐至",
            "id": 512022
          },
          {
            "name": "简阳",
            "id": 512081
          }
        ]
      },
      {
        "name": "阿坝",
        "id": 513200,
        "child": [
          {
            "name": "汶川",
            "id": 513221
          },
          {
            "name": "理县",
            "id": 513222
          },
          {
            "name": "茂县",
            "id": 513223
          },
          {
            "name": "松潘",
            "id": 513224
          },
          {
            "name": "九寨沟",
            "id": 513225
          },
          {
            "name": "金川",
            "id": 513226
          },
          {
            "name": "小金",
            "id": 513227
          },
          {
            "name": "黑水",
            "id": 513228
          },
          {
            "name": "马尔康",
            "id": 513229
          },
          {
            "name": "壤塘",
            "id": 513230
          },
          {
            "name": "阿坝",
            "id": 513231
          },
          {
            "name": "若尔盖",
            "id": 513232
          },
          {
            "name": "红原",
            "id": 513233
          }
        ]
      },
      {
        "name": "甘孜",
        "id": 513300,
        "child": [
          {
            "name": "康定",
            "id": 513321
          },
          {
            "name": "泸定",
            "id": 513322
          },
          {
            "name": "丹巴",
            "id": 513323
          },
          {
            "name": "九龙",
            "id": 513324
          },
          {
            "name": "雅江",
            "id": 513325
          },
          {
            "name": "道孚",
            "id": 513326
          },
          {
            "name": "炉霍",
            "id": 513327
          },
          {
            "name": "甘孜",
            "id": 513328
          },
          {
            "name": "新龙",
            "id": 513329
          },
          {
            "name": "德格",
            "id": 513330
          },
          {
            "name": "白玉",
            "id": 513331
          },
          {
            "name": "石渠",
            "id": 513332
          },
          {
            "name": "色达",
            "id": 513333
          },
          {
            "name": "理塘",
            "id": 513334
          },
          {
            "name": "巴塘",
            "id": 513335
          },
          {
            "name": "乡城",
            "id": 513336
          },
          {
            "name": "稻城",
            "id": 513337
          },
          {
            "name": "得荣",
            "id": 513338
          }
        ]
      },
      {
        "name": "凉山",
        "id": 513400,
        "child": [
          {
            "name": "西昌",
            "id": 513401
          },
          {
            "name": "木里",
            "id": 513422
          },
          {
            "name": "盐源",
            "id": 513423
          },
          {
            "name": "德昌",
            "id": 513424
          },
          {
            "name": "会理",
            "id": 513425
          },
          {
            "name": "会东",
            "id": 513426
          },
          {
            "name": "宁南",
            "id": 513427
          },
          {
            "name": "普格",
            "id": 513428
          },
          {
            "name": "布拖",
            "id": 513429
          },
          {
            "name": "金阳",
            "id": 513430
          },
          {
            "name": "昭觉",
            "id": 513431
          },
          {
            "name": "喜德",
            "id": 513432
          },
          {
            "name": "冕宁",
            "id": 513433
          },
          {
            "name": "越西",
            "id": 513434
          },
          {
            "name": "甘洛",
            "id": 513435
          },
          {
            "name": "美姑",
            "id": 513436
          },
          {
            "name": "雷波",
            "id": 513437
          }
        ]
      }
    ]
  },
  {
    "name": "贵州",
    "id": 520000,
    "child": [
      {
        "name": "贵阳",
        "id": 520100,
        "child": [
          {
            "name": "南明",
            "id": 520102
          },
          {
            "name": "云岩",
            "id": 520103
          },
          {
            "name": "花溪",
            "id": 520111
          },
          {
            "name": "乌当",
            "id": 520112
          },
          {
            "name": "白云",
            "id": 520113
          },
          {
            "name": "开阳",
            "id": 520121
          },
          {
            "name": "息烽",
            "id": 520122
          },
          {
            "name": "修文",
            "id": 520123
          },
          {
            "name": "观山湖",
            "id": 520151
          },
          {
            "name": "清镇",
            "id": 520181
          }
        ]
      },
      {
        "name": "六盘水",
        "id": 520200,
        "child": [
          {
            "name": "钟山",
            "id": 520201
          },
          {
            "name": "六枝特",
            "id": 520203
          },
          {
            "name": "水城",
            "id": 520221
          },
          {
            "name": "盘县",
            "id": 520222
          }
        ]
      },
      {
        "name": "遵义",
        "id": 520300,
        "child": [
          {
            "name": "红花岗",
            "id": 520302
          },
          {
            "name": "汇川",
            "id": 520303
          },
          {
            "name": "遵义",
            "id": 520321
          },
          {
            "name": "桐梓",
            "id": 520322
          },
          {
            "name": "绥阳",
            "id": 520323
          },
          {
            "name": "正安",
            "id": 520324
          },
          {
            "name": "道真",
            "id": 520325
          },
          {
            "name": "务川",
            "id": 520326
          },
          {
            "name": "凤冈",
            "id": 520327
          },
          {
            "name": "湄潭",
            "id": 520328
          },
          {
            "name": "余庆",
            "id": 520329
          },
          {
            "name": "习水",
            "id": 520330
          },
          {
            "name": "赤水",
            "id": 520381
          },
          {
            "name": "仁怀",
            "id": 520382
          }
        ]
      },
      {
        "name": "安顺",
        "id": 520400,
        "child": [
          {
            "name": "西秀",
            "id": 520402
          },
          {
            "name": "平坝",
            "id": 520421
          },
          {
            "name": "普定",
            "id": 520422
          },
          {
            "name": "镇宁",
            "id": 520423
          },
          {
            "name": "关岭",
            "id": 520424
          },
          {
            "name": "紫云",
            "id": 520425
          }
        ]
      },
      {
        "name": "铜仁",
        "id": 522200,
        "child": [
          {
            "name": "碧江",
            "id": 522201
          },
          {
            "name": "江口",
            "id": 522222
          },
          {
            "name": "玉屏",
            "id": 522223
          },
          {
            "name": "石阡",
            "id": 522224
          },
          {
            "name": "思南",
            "id": 522225
          },
          {
            "name": "印江",
            "id": 522226
          },
          {
            "name": "德江",
            "id": 522227
          },
          {
            "name": "沿河",
            "id": 522228
          },
          {
            "name": "松桃",
            "id": 522229
          },
          {
            "name": "万山",
            "id": 522230
          }
        ]
      },
      {
        "name": "黔西南",
        "id": 522300,
        "child": [
          {
            "name": "兴义",
            "id": 522301
          },
          {
            "name": "兴仁",
            "id": 522322
          },
          {
            "name": "普安",
            "id": 522323
          },
          {
            "name": "晴隆",
            "id": 522324
          },
          {
            "name": "贞丰",
            "id": 522325
          },
          {
            "name": "望谟",
            "id": 522326
          },
          {
            "name": "册亨",
            "id": 522327
          },
          {
            "name": "安龙",
            "id": 522328
          }
        ]
      },
      {
        "name": "毕节",
        "id": 522400,
        "child": [
          {
            "name": "七星关",
            "id": 522401
          },
          {
            "name": "大方",
            "id": 522422
          },
          {
            "name": "黔西",
            "id": 522423
          },
          {
            "name": "金沙",
            "id": 522424
          },
          {
            "name": "织金",
            "id": 522425
          },
          {
            "name": "纳雍",
            "id": 522426
          },
          {
            "name": "威宁",
            "id": 522427
          },
          {
            "name": "赫章",
            "id": 522428
          }
        ]
      },
      {
        "name": "黔东南",
        "id": 522600,
        "child": [
          {
            "name": "凯里",
            "id": 522601
          },
          {
            "name": "黄平",
            "id": 522622
          },
          {
            "name": "施秉",
            "id": 522623
          },
          {
            "name": "三穗",
            "id": 522624
          },
          {
            "name": "镇远",
            "id": 522625
          },
          {
            "name": "岑巩",
            "id": 522626
          },
          {
            "name": "天柱",
            "id": 522627
          },
          {
            "name": "锦屏",
            "id": 522628
          },
          {
            "name": "剑河",
            "id": 522629
          },
          {
            "name": "台江",
            "id": 522630
          },
          {
            "name": "黎平",
            "id": 522631
          },
          {
            "name": "榕江",
            "id": 522632
          },
          {
            "name": "从江",
            "id": 522633
          },
          {
            "name": "雷山",
            "id": 522634
          },
          {
            "name": "麻江",
            "id": 522635
          },
          {
            "name": "丹寨",
            "id": 522636
          }
        ]
      },
      {
        "name": "黔南",
        "id": 522700,
        "child": [
          {
            "name": "都匀",
            "id": 522701
          },
          {
            "name": "福泉",
            "id": 522702
          },
          {
            "name": "荔波",
            "id": 522722
          },
          {
            "name": "贵定",
            "id": 522723
          },
          {
            "name": "瓮安",
            "id": 522725
          },
          {
            "name": "独山",
            "id": 522726
          },
          {
            "name": "平塘",
            "id": 522727
          },
          {
            "name": "罗甸",
            "id": 522728
          },
          {
            "name": "长顺",
            "id": 522729
          },
          {
            "name": "龙里",
            "id": 522730
          },
          {
            "name": "惠水",
            "id": 522731
          },
          {
            "name": "三都",
            "id": 522732
          }
        ]
      }
    ]
  },
  {
    "name": "云南",
    "id": 530000,
    "child": [
      {
        "name": "昆明",
        "id": 530100,
        "child": [
          {
            "name": "五华",
            "id": 530102
          },
          {
            "name": "盘龙",
            "id": 530103
          },
          {
            "name": "官渡",
            "id": 530111
          },
          {
            "name": "西山",
            "id": 530112
          },
          {
            "name": "东川",
            "id": 530113
          },
          {
            "name": "呈贡",
            "id": 530121
          },
          {
            "name": "晋宁",
            "id": 530122
          },
          {
            "name": "富民",
            "id": 530124
          },
          {
            "name": "宜良",
            "id": 530125
          },
          {
            "name": "石林",
            "id": 530126
          },
          {
            "name": "嵩明",
            "id": 530127
          },
          {
            "name": "禄劝",
            "id": 530128
          },
          {
            "name": "寻甸",
            "id": 530129
          },
          {
            "name": "安宁",
            "id": 530181
          }
        ]
      },
      {
        "name": "曲靖",
        "id": 530300,
        "child": [
          {
            "name": "麒麟",
            "id": 530302
          },
          {
            "name": "马龙",
            "id": 530321
          },
          {
            "name": "陆良",
            "id": 530322
          },
          {
            "name": "师宗",
            "id": 530323
          },
          {
            "name": "罗平",
            "id": 530324
          },
          {
            "name": "富源",
            "id": 530325
          },
          {
            "name": "会泽",
            "id": 530326
          },
          {
            "name": "沾益",
            "id": 530328
          },
          {
            "name": "宣威",
            "id": 530381
          }
        ]
      },
      {
        "name": "玉溪",
        "id": 530400,
        "child": [
          {
            "name": "红塔",
            "id": 530402
          },
          {
            "name": "江川",
            "id": 530421
          },
          {
            "name": "澄江",
            "id": 530422
          },
          {
            "name": "通海",
            "id": 530423
          },
          {
            "name": "华宁",
            "id": 530424
          },
          {
            "name": "易门",
            "id": 530425
          },
          {
            "name": "峨山",
            "id": 530426
          },
          {
            "name": "新平",
            "id": 530427
          },
          {
            "name": "元江",
            "id": 530428
          }
        ]
      },
      {
        "name": "保山",
        "id": 530500,
        "child": [
          {
            "name": "隆阳",
            "id": 530502
          },
          {
            "name": "施甸",
            "id": 530521
          },
          {
            "name": "腾冲",
            "id": 530522
          },
          {
            "name": "龙陵",
            "id": 530523
          },
          {
            "name": "昌宁",
            "id": 530524
          }
        ]
      },
      {
        "name": "昭通",
        "id": 530600,
        "child": [
          {
            "name": "昭阳",
            "id": 530602
          },
          {
            "name": "鲁甸",
            "id": 530621
          },
          {
            "name": "巧家",
            "id": 530622
          },
          {
            "name": "盐津",
            "id": 530623
          },
          {
            "name": "大关",
            "id": 530624
          },
          {
            "name": "永善",
            "id": 530625
          },
          {
            "name": "绥江",
            "id": 530626
          },
          {
            "name": "镇雄",
            "id": 530627
          },
          {
            "name": "彝良",
            "id": 530628
          },
          {
            "name": "威信",
            "id": 530629
          },
          {
            "name": "水富",
            "id": 530630
          }
        ]
      },
      {
        "name": "丽江",
        "id": 530700,
        "child": [
          {
            "name": "古城",
            "id": 530702
          },
          {
            "name": "玉龙",
            "id": 530721
          },
          {
            "name": "永胜",
            "id": 530722
          },
          {
            "name": "华坪",
            "id": 530723
          },
          {
            "name": "宁蒗",
            "id": 530724
          }
        ]
      },
      {
        "name": "普洱",
        "id": 530800,
        "child": [
          {
            "name": "思茅",
            "id": 530802
          },
          {
            "name": "宁洱",
            "id": 530821
          },
          {
            "name": "墨江",
            "id": 530822
          },
          {
            "name": "景东",
            "id": 530823
          },
          {
            "name": "景谷",
            "id": 530824
          },
          {
            "name": "镇沅",
            "id": 530825
          },
          {
            "name": "江城",
            "id": 530826
          },
          {
            "name": "孟连",
            "id": 530827
          },
          {
            "name": "澜沧",
            "id": 530828
          },
          {
            "name": "西盟",
            "id": 530829
          }
        ]
      },
      {
        "name": "临沧",
        "id": 530900,
        "child": [
          {
            "name": "临翔",
            "id": 530902
          },
          {
            "name": "凤庆",
            "id": 530921
          },
          {
            "name": "云县",
            "id": 530922
          },
          {
            "name": "永德",
            "id": 530923
          },
          {
            "name": "镇康",
            "id": 530924
          },
          {
            "name": "双江",
            "id": 530925
          },
          {
            "name": "耿马",
            "id": 530926
          },
          {
            "name": "沧源",
            "id": 530927
          }
        ]
      },
      {
        "name": "楚雄",
        "id": 532300,
        "child": [
          {
            "name": "楚雄",
            "id": 532301
          },
          {
            "name": "双柏",
            "id": 532322
          },
          {
            "name": "牟定",
            "id": 532323
          },
          {
            "name": "南华",
            "id": 532324
          },
          {
            "name": "姚安",
            "id": 532325
          },
          {
            "name": "大姚",
            "id": 532326
          },
          {
            "name": "永仁",
            "id": 532327
          },
          {
            "name": "元谋",
            "id": 532328
          },
          {
            "name": "武定",
            "id": 532329
          },
          {
            "name": "禄丰",
            "id": 532331
          }
        ]
      },
      {
        "name": "红河",
        "id": 532500,
        "child": [
          {
            "name": "个旧",
            "id": 532501
          },
          {
            "name": "开远",
            "id": 532502
          },
          {
            "name": "蒙自",
            "id": 532522
          },
          {
            "name": "屏边",
            "id": 532523
          },
          {
            "name": "建水",
            "id": 532524
          },
          {
            "name": "石屏",
            "id": 532525
          },
          {
            "name": "弥勒",
            "id": 532526
          },
          {
            "name": "泸西",
            "id": 532527
          },
          {
            "name": "元阳",
            "id": 532528
          },
          {
            "name": "红河",
            "id": 532529
          },
          {
            "name": "金平",
            "id": 532530
          },
          {
            "name": "绿春",
            "id": 532531
          },
          {
            "name": "河口",
            "id": 532532
          }
        ]
      },
      {
        "name": "文山",
        "id": 532600,
        "child": [
          {
            "name": "文山",
            "id": 532621
          },
          {
            "name": "砚山",
            "id": 532622
          },
          {
            "name": "西畴",
            "id": 532623
          },
          {
            "name": "麻栗坡",
            "id": 532624
          },
          {
            "name": "马关",
            "id": 532625
          },
          {
            "name": "丘北",
            "id": 532626
          },
          {
            "name": "广南",
            "id": 532627
          },
          {
            "name": "富宁",
            "id": 532628
          }
        ]
      },
      {
        "name": "西双版纳",
        "id": 532800,
        "child": [
          {
            "name": "景洪",
            "id": 532801
          },
          {
            "name": "勐海",
            "id": 532822
          },
          {
            "name": "勐腊",
            "id": 532823
          }
        ]
      },
      {
        "name": "大理",
        "id": 532900,
        "child": [
          {
            "name": "大理",
            "id": 532901
          },
          {
            "name": "漾濞",
            "id": 532922
          },
          {
            "name": "祥云",
            "id": 532923
          },
          {
            "name": "宾川",
            "id": 532924
          },
          {
            "name": "弥渡",
            "id": 532925
          },
          {
            "name": "南涧",
            "id": 532926
          },
          {
            "name": "巍山",
            "id": 532927
          },
          {
            "name": "永平",
            "id": 532928
          },
          {
            "name": "云龙",
            "id": 532929
          },
          {
            "name": "洱源",
            "id": 532930
          },
          {
            "name": "剑川",
            "id": 532931
          },
          {
            "name": "鹤庆",
            "id": 532932
          }
        ]
      },
      {
        "name": "德宏",
        "id": 533100,
        "child": [
          {
            "name": "瑞丽",
            "id": 533102
          },
          {
            "name": "芒市",
            "id": 533103
          },
          {
            "name": "梁河",
            "id": 533122
          },
          {
            "name": "盈江",
            "id": 533123
          },
          {
            "name": "陇川",
            "id": 533124
          }
        ]
      },
      {
        "name": "怒江",
        "id": 533300,
        "child": [
          {
            "name": "泸水",
            "id": 533321
          },
          {
            "name": "福贡",
            "id": 533323
          },
          {
            "name": "贡山",
            "id": 533324
          },
          {
            "name": "兰坪",
            "id": 533325
          }
        ]
      },
      {
        "name": "迪庆",
        "id": 533400,
        "child": [
          {
            "name": "香格里拉",
            "id": 533421
          },
          {
            "name": "德钦",
            "id": 533422
          },
          {
            "name": "维西",
            "id": 533423
          }
        ]
      }
    ]
  },
  {
    "name": "西藏",
    "id": 540000,
    "child": [
      {
        "name": "拉萨",
        "id": 540100,
        "child": [
          {
            "name": "城关",
            "id": 540102
          },
          {
            "name": "林周",
            "id": 540121
          },
          {
            "name": "当雄",
            "id": 540122
          },
          {
            "name": "尼木",
            "id": 540123
          },
          {
            "name": "曲水",
            "id": 540124
          },
          {
            "name": "堆龙德庆",
            "id": 540125
          },
          {
            "name": "达孜",
            "id": 540126
          },
          {
            "name": "墨竹工卡",
            "id": 540127
          }
        ]
      },
      {
        "name": "昌都",
        "id": 542100,
        "child": [
          {
            "name": "昌都",
            "id": 542121
          },
          {
            "name": "江达",
            "id": 542122
          },
          {
            "name": "贡觉",
            "id": 542123
          },
          {
            "name": "类乌齐",
            "id": 542124
          },
          {
            "name": "丁青",
            "id": 542125
          },
          {
            "name": "察雅",
            "id": 542126
          },
          {
            "name": "八宿",
            "id": 542127
          },
          {
            "name": "左贡",
            "id": 542128
          },
          {
            "name": "芒康",
            "id": 542129
          },
          {
            "name": "洛隆",
            "id": 542132
          },
          {
            "name": "边坝",
            "id": 542133
          }
        ]
      },
      {
        "name": "山南",
        "id": 542200,
        "child": [
          {
            "name": "乃东",
            "id": 542221
          },
          {
            "name": "扎囊",
            "id": 542222
          },
          {
            "name": "贡嘎",
            "id": 542223
          },
          {
            "name": "桑日",
            "id": 542224
          },
          {
            "name": "琼结",
            "id": 542225
          },
          {
            "name": "曲松",
            "id": 542226
          },
          {
            "name": "措美",
            "id": 542227
          },
          {
            "name": "洛扎",
            "id": 542228
          },
          {
            "name": "加查",
            "id": 542229
          },
          {
            "name": "隆子",
            "id": 542231
          },
          {
            "name": "错那",
            "id": 542232
          },
          {
            "name": "浪卡子",
            "id": 542233
          }
        ]
      },
      {
        "name": "日喀则",
        "id": 542300,
        "child": [
          {
            "name": "日喀则",
            "id": 542301
          },
          {
            "name": "南木林",
            "id": 542322
          },
          {
            "name": "江孜",
            "id": 542323
          },
          {
            "name": "定日",
            "id": 542324
          },
          {
            "name": "萨迦",
            "id": 542325
          },
          {
            "name": "拉孜",
            "id": 542326
          },
          {
            "name": "昂仁",
            "id": 542327
          },
          {
            "name": "谢通门",
            "id": 542328
          },
          {
            "name": "白朗",
            "id": 542329
          },
          {
            "name": "仁布",
            "id": 542330
          },
          {
            "name": "康马",
            "id": 542331
          },
          {
            "name": "定结",
            "id": 542332
          },
          {
            "name": "仲巴",
            "id": 542333
          },
          {
            "name": "亚东",
            "id": 542334
          },
          {
            "name": "吉隆",
            "id": 542335
          },
          {
            "name": "聂拉木",
            "id": 542336
          },
          {
            "name": "萨嘎",
            "id": 542337
          },
          {
            "name": "岗巴",
            "id": 542338
          }
        ]
      },
      {
        "name": "那曲",
        "id": 542400,
        "child": [
          {
            "name": "那曲",
            "id": 542421
          },
          {
            "name": "嘉黎",
            "id": 542422
          },
          {
            "name": "比如",
            "id": 542423
          },
          {
            "name": "聂荣",
            "id": 542424
          },
          {
            "name": "安多",
            "id": 542425
          },
          {
            "name": "申扎",
            "id": 542426
          },
          {
            "name": "索县",
            "id": 542427
          },
          {
            "name": "班戈",
            "id": 542428
          },
          {
            "name": "巴青",
            "id": 542429
          },
          {
            "name": "尼玛",
            "id": 542430
          },
          {
            "name": "双湖",
            "id": 542432
          }
        ]
      },
      {
        "name": "阿里",
        "id": 542500,
        "child": [
          {
            "name": "普兰",
            "id": 542521
          },
          {
            "name": "札达",
            "id": 542522
          },
          {
            "name": "噶尔",
            "id": 542523
          },
          {
            "name": "日土",
            "id": 542524
          },
          {
            "name": "革吉",
            "id": 542525
          },
          {
            "name": "改则",
            "id": 542526
          },
          {
            "name": "措勤",
            "id": 542527
          }
        ]
      },
      {
        "name": "林芝",
        "id": 542600,
        "child": [
          {
            "name": "林芝",
            "id": 542621
          },
          {
            "name": "工布江达",
            "id": 542622
          },
          {
            "name": "米林",
            "id": 542623
          },
          {
            "name": "墨脱",
            "id": 542624
          },
          {
            "name": "波密",
            "id": 542625
          },
          {
            "name": "察隅",
            "id": 542626
          },
          {
            "name": "朗县",
            "id": 542627
          }
        ]
      }
    ]
  },
  {
    "name": "陕西",
    "id": 610000,
    "child": [
      {
        "name": "西安",
        "id": 610100,
        "child": [
          {
            "name": "新城",
            "id": 610102
          },
          {
            "name": "碑林",
            "id": 610103
          },
          {
            "name": "莲湖",
            "id": 610104
          },
          {
            "name": "灞桥",
            "id": 610111
          },
          {
            "name": "未央",
            "id": 610112
          },
          {
            "name": "雁塔",
            "id": 610113
          },
          {
            "name": "阎良",
            "id": 610114
          },
          {
            "name": "临潼",
            "id": 610115
          },
          {
            "name": "长安",
            "id": 610116
          },
          {
            "name": "蓝田",
            "id": 610122
          },
          {
            "name": "周至",
            "id": 610124
          },
          {
            "name": "户县",
            "id": 610125
          },
          {
            "name": "高陵",
            "id": 610126
          }
        ]
      },
      {
        "name": "铜川",
        "id": 610200,
        "child": [
          {
            "name": "王益",
            "id": 610202
          },
          {
            "name": "印台",
            "id": 610203
          },
          {
            "name": "耀州",
            "id": 610204
          },
          {
            "name": "宜君",
            "id": 610222
          }
        ]
      },
      {
        "name": "宝鸡",
        "id": 610300,
        "child": [
          {
            "name": "渭滨",
            "id": 610302
          },
          {
            "name": "金台",
            "id": 610303
          },
          {
            "name": "陈仓",
            "id": 610304
          },
          {
            "name": "凤翔",
            "id": 610322
          },
          {
            "name": "岐山",
            "id": 610323
          },
          {
            "name": "扶风",
            "id": 610324
          },
          {
            "name": "眉县",
            "id": 610326
          },
          {
            "name": "陇县",
            "id": 610327
          },
          {
            "name": "千阳",
            "id": 610328
          },
          {
            "name": "麟游",
            "id": 610329
          },
          {
            "name": "凤县",
            "id": 610330
          },
          {
            "name": "太白",
            "id": 610331
          }
        ]
      },
      {
        "name": "咸阳",
        "id": 610400,
        "child": [
          {
            "name": "秦都",
            "id": 610402
          },
          {
            "name": "杨陵",
            "id": 610403
          },
          {
            "name": "渭城",
            "id": 610404
          },
          {
            "name": "三原",
            "id": 610422
          },
          {
            "name": "泾阳",
            "id": 610423
          },
          {
            "name": "乾县",
            "id": 610424
          },
          {
            "name": "礼泉",
            "id": 610425
          },
          {
            "name": "永寿",
            "id": 610426
          },
          {
            "name": "彬县",
            "id": 610427
          },
          {
            "name": "长武",
            "id": 610428
          },
          {
            "name": "旬邑",
            "id": 610429
          },
          {
            "name": "淳化",
            "id": 610430
          },
          {
            "name": "武功",
            "id": 610431
          },
          {
            "name": "兴平",
            "id": 610481
          }
        ]
      },
      {
        "name": "渭南",
        "id": 610500,
        "child": [
          {
            "name": "临渭",
            "id": 610502
          },
          {
            "name": "华县",
            "id": 610521
          },
          {
            "name": "潼关",
            "id": 610522
          },
          {
            "name": "大荔",
            "id": 610523
          },
          {
            "name": "合阳",
            "id": 610524
          },
          {
            "name": "澄城",
            "id": 610525
          },
          {
            "name": "蒲城",
            "id": 610526
          },
          {
            "name": "白水",
            "id": 610527
          },
          {
            "name": "富平",
            "id": 610528
          },
          {
            "name": "韩城",
            "id": 610581
          },
          {
            "name": "华阴",
            "id": 610582
          }
        ]
      },
      {
        "name": "延安",
        "id": 610600,
        "child": [
          {
            "name": "宝塔",
            "id": 610602
          },
          {
            "name": "延长",
            "id": 610621
          },
          {
            "name": "延川",
            "id": 610622
          },
          {
            "name": "子长",
            "id": 610623
          },
          {
            "name": "安塞",
            "id": 610624
          },
          {
            "name": "志丹",
            "id": 610625
          },
          {
            "name": "吴起",
            "id": 610626
          },
          {
            "name": "甘泉",
            "id": 610627
          },
          {
            "name": "富县",
            "id": 610628
          },
          {
            "name": "洛川",
            "id": 610629
          },
          {
            "name": "宜川",
            "id": 610630
          },
          {
            "name": "黄龙",
            "id": 610631
          },
          {
            "name": "黄陵",
            "id": 610632
          }
        ]
      },
      {
        "name": "汉中",
        "id": 610700,
        "child": [
          {
            "name": "汉台",
            "id": 610702
          },
          {
            "name": "南郑",
            "id": 610721
          },
          {
            "name": "城固",
            "id": 610722
          },
          {
            "name": "洋县",
            "id": 610723
          },
          {
            "name": "西乡",
            "id": 610724
          },
          {
            "name": "勉县",
            "id": 610725
          },
          {
            "name": "宁强",
            "id": 610726
          },
          {
            "name": "略阳",
            "id": 610727
          },
          {
            "name": "镇巴",
            "id": 610728
          },
          {
            "name": "留坝",
            "id": 610729
          },
          {
            "name": "佛坪",
            "id": 610730
          }
        ]
      },
      {
        "name": "榆林",
        "id": 610800,
        "child": [
          {
            "name": "榆阳",
            "id": 610802
          },
          {
            "name": "神木",
            "id": 610821
          },
          {
            "name": "府谷",
            "id": 610822
          },
          {
            "name": "横山",
            "id": 610823
          },
          {
            "name": "靖边",
            "id": 610824
          },
          {
            "name": "定边",
            "id": 610825
          },
          {
            "name": "绥德",
            "id": 610826
          },
          {
            "name": "米脂",
            "id": 610827
          },
          {
            "name": "佳县",
            "id": 610828
          },
          {
            "name": "吴堡",
            "id": 610829
          },
          {
            "name": "清涧",
            "id": 610830
          },
          {
            "name": "子洲",
            "id": 610831
          }
        ]
      },
      {
        "name": "安康",
        "id": 610900,
        "child": [
          {
            "name": "汉滨",
            "id": 610902
          },
          {
            "name": "汉阴",
            "id": 610921
          },
          {
            "name": "石泉",
            "id": 610922
          },
          {
            "name": "宁陕",
            "id": 610923
          },
          {
            "name": "紫阳",
            "id": 610924
          },
          {
            "name": "岚皋",
            "id": 610925
          },
          {
            "name": "平利",
            "id": 610926
          },
          {
            "name": "镇坪",
            "id": 610927
          },
          {
            "name": "旬阳",
            "id": 610928
          },
          {
            "name": "白河",
            "id": 610929
          }
        ]
      },
      {
        "name": "商洛",
        "id": 611000,
        "child": [
          {
            "name": "商州",
            "id": 611002
          },
          {
            "name": "洛南",
            "id": 611021
          },
          {
            "name": "丹凤",
            "id": 611022
          },
          {
            "name": "商南",
            "id": 611023
          },
          {
            "name": "山阳",
            "id": 611024
          },
          {
            "name": "镇安",
            "id": 611025
          },
          {
            "name": "柞水",
            "id": 611026
          }
        ]
      }
    ]
  },
  {
    "name": "甘肃",
    "id": 620000,
    "child": [
      {
        "name": "兰州",
        "id": 620100,
        "child": [
          {
            "name": "城关",
            "id": 620102
          },
          {
            "name": "七里河",
            "id": 620103
          },
          {
            "name": "西固",
            "id": 620104
          },
          {
            "name": "安宁",
            "id": 620105
          },
          {
            "name": "红古",
            "id": 620111
          },
          {
            "name": "永登",
            "id": 620121
          },
          {
            "name": "皋兰",
            "id": 620122
          },
          {
            "name": "榆中",
            "id": 620123
          }
        ]
      },
      {
        "name": "嘉峪关",
        "id": 620200,
        "child": [
          {
            "name": "新城镇",
            "id": 620201100
          },
          {
            "name": "峪泉镇",
            "id": 620201101
          },
          {
            "name": "文殊镇",
            "id": 620201102
          },
          {
            "name": "雄关区",
            "id": 620201401
          },
          {
            "name": "镜铁区",
            "id": 620201402
          },
          {
            "name": "长城区",
            "id": 620201403
          }
        ]
      },
      {
        "name": "金昌",
        "id": 620300,
        "child": [
          {
            "name": "金川",
            "id": 620302
          },
          {
            "name": "永昌",
            "id": 620321
          }
        ]
      },
      {
        "name": "白银",
        "id": 620400,
        "child": [
          {
            "name": "白银",
            "id": 620402
          },
          {
            "name": "平川",
            "id": 620403
          },
          {
            "name": "靖远",
            "id": 620421
          },
          {
            "name": "会宁",
            "id": 620422
          },
          {
            "name": "景泰",
            "id": 620423
          }
        ]
      },
      {
        "name": "天水",
        "id": 620500,
        "child": [
          {
            "name": "秦州",
            "id": 620502
          },
          {
            "name": "麦积",
            "id": 620503
          },
          {
            "name": "清水",
            "id": 620521
          },
          {
            "name": "秦安",
            "id": 620522
          },
          {
            "name": "甘谷",
            "id": 620523
          },
          {
            "name": "武山",
            "id": 620524
          },
          {
            "name": "张家川",
            "id": 620525
          }
        ]
      },
      {
        "name": "武威",
        "id": 620600,
        "child": [
          {
            "name": "凉州",
            "id": 620602
          },
          {
            "name": "民勤",
            "id": 620621
          },
          {
            "name": "古浪",
            "id": 620622
          },
          {
            "name": "天祝",
            "id": 620623
          }
        ]
      },
      {
        "name": "张掖",
        "id": 620700,
        "child": [
          {
            "name": "甘州",
            "id": 620702
          },
          {
            "name": "肃南",
            "id": 620721
          },
          {
            "name": "民乐",
            "id": 620722
          },
          {
            "name": "临泽",
            "id": 620723
          },
          {
            "name": "高台",
            "id": 620724
          },
          {
            "name": "山丹",
            "id": 620725
          }
        ]
      },
      {
        "name": "平凉",
        "id": 620800,
        "child": [
          {
            "name": "崆峒",
            "id": 620802
          },
          {
            "name": "泾川",
            "id": 620821
          },
          {
            "name": "灵台",
            "id": 620822
          },
          {
            "name": "崇信",
            "id": 620823
          },
          {
            "name": "华亭",
            "id": 620824
          },
          {
            "name": "庄浪",
            "id": 620825
          },
          {
            "name": "静宁",
            "id": 620826
          }
        ]
      },
      {
        "name": "酒泉",
        "id": 620900,
        "child": [
          {
            "name": "肃州",
            "id": 620902
          },
          {
            "name": "金塔",
            "id": 620921
          },
          {
            "name": "瓜州",
            "id": 620922
          },
          {
            "name": "肃北",
            "id": 620923
          },
          {
            "name": "阿克塞",
            "id": 620924
          },
          {
            "name": "玉门",
            "id": 620981
          },
          {
            "name": "敦煌",
            "id": 620982
          }
        ]
      },
      {
        "name": "庆阳",
        "id": 621000,
        "child": [
          {
            "name": "西峰",
            "id": 621002
          },
          {
            "name": "庆城",
            "id": 621021
          },
          {
            "name": "环县",
            "id": 621022
          },
          {
            "name": "华池",
            "id": 621023
          },
          {
            "name": "合水",
            "id": 621024
          },
          {
            "name": "正宁",
            "id": 621025
          },
          {
            "name": "宁县",
            "id": 621026
          },
          {
            "name": "镇原",
            "id": 621027
          }
        ]
      },
      {
        "name": "定西",
        "id": 621100,
        "child": [
          {
            "name": "安定",
            "id": 621102
          },
          {
            "name": "通渭",
            "id": 621121
          },
          {
            "name": "陇西",
            "id": 621122
          },
          {
            "name": "渭源",
            "id": 621123
          },
          {
            "name": "临洮",
            "id": 621124
          },
          {
            "name": "漳县",
            "id": 621125
          },
          {
            "name": "岷县",
            "id": 621126
          }
        ]
      },
      {
        "name": "陇南",
        "id": 621200,
        "child": [
          {
            "name": "武都",
            "id": 621202
          },
          {
            "name": "成县",
            "id": 621221
          },
          {
            "name": "文县",
            "id": 621222
          },
          {
            "name": "宕昌",
            "id": 621223
          },
          {
            "name": "康县",
            "id": 621224
          },
          {
            "name": "西和",
            "id": 621225
          },
          {
            "name": "礼县",
            "id": 621226
          },
          {
            "name": "徽县",
            "id": 621227
          },
          {
            "name": "两当",
            "id": 621228
          }
        ]
      },
      {
        "name": "临夏",
        "id": 622900,
        "child": [
          {
            "name": "临夏市",
            "id": 622901
          },
          {
            "name": "临夏县",
            "id": 622921
          },
          {
            "name": "康乐",
            "id": 622922
          },
          {
            "name": "永靖",
            "id": 622923
          },
          {
            "name": "广河",
            "id": 622924
          },
          {
            "name": "和政",
            "id": 622925
          },
          {
            "name": "东乡",
            "id": 622926
          },
          {
            "name": "积石山",
            "id": 622927
          }
        ]
      },
      {
        "name": "甘南",
        "id": 623000,
        "child": [
          {
            "name": "合作",
            "id": 623001
          },
          {
            "name": "临潭",
            "id": 623021
          },
          {
            "name": "卓尼",
            "id": 623022
          },
          {
            "name": "舟曲",
            "id": 623023
          },
          {
            "name": "迭部",
            "id": 623024
          },
          {
            "name": "玛曲",
            "id": 623025
          },
          {
            "name": "碌曲",
            "id": 623026
          },
          {
            "name": "夏河",
            "id": 623027
          }
        ]
      }
    ]
  },
  {
    "name": "青海",
    "id": 630000,
    "child": [
      {
        "name": "西宁",
        "id": 630100,
        "child": [
          {
            "name": "城东",
            "id": 630102
          },
          {
            "name": "城中",
            "id": 630103
          },
          {
            "name": "城西",
            "id": 630104
          },
          {
            "name": "城北",
            "id": 630105
          },
          {
            "name": "大通",
            "id": 630121
          },
          {
            "name": "湟中",
            "id": 630122
          },
          {
            "name": "湟源",
            "id": 630123
          }
        ]
      },
      {
        "name": "海东",
        "id": 632100,
        "child": [
          {
            "name": "平安",
            "id": 632121
          },
          {
            "name": "民和",
            "id": 632122
          },
          {
            "name": "乐都",
            "id": 632123
          },
          {
            "name": "互助",
            "id": 632126
          },
          {
            "name": "化隆",
            "id": 632127
          },
          {
            "name": "循化",
            "id": 632128
          }
        ]
      },
      {
        "name": "海北",
        "id": 632200,
        "child": [
          {
            "name": "门源",
            "id": 632221
          },
          {
            "name": "祁连",
            "id": 632222
          },
          {
            "name": "海晏",
            "id": 632223
          },
          {
            "name": "刚察",
            "id": 632224
          }
        ]
      },
      {
        "name": "黄南",
        "id": 632300,
        "child": [
          {
            "name": "同仁",
            "id": 632321
          },
          {
            "name": "尖扎",
            "id": 632322
          },
          {
            "name": "泽库",
            "id": 632323
          },
          {
            "name": "河南",
            "id": 632324
          }
        ]
      },
      {
        "name": "海南藏族",
        "id": 632500,
        "child": [
          {
            "name": "共和",
            "id": 632521
          },
          {
            "name": "同德",
            "id": 632522
          },
          {
            "name": "贵德",
            "id": 632523
          },
          {
            "name": "兴海",
            "id": 632524
          },
          {
            "name": "贵南",
            "id": 632525
          }
        ]
      },
      {
        "name": "果洛",
        "id": 632600,
        "child": [
          {
            "name": "玛沁",
            "id": 632621
          },
          {
            "name": "班玛",
            "id": 632622
          },
          {
            "name": "甘德",
            "id": 632623
          },
          {
            "name": "达日",
            "id": 632624
          },
          {
            "name": "久治",
            "id": 632625
          },
          {
            "name": "玛多",
            "id": 632626
          }
        ]
      },
      {
        "name": "玉树",
        "id": 632700,
        "child": [
          {
            "name": "玉树",
            "id": 632721
          },
          {
            "name": "杂多",
            "id": 632722
          },
          {
            "name": "称多",
            "id": 632723
          },
          {
            "name": "治多",
            "id": 632724
          },
          {
            "name": "囊谦",
            "id": 632725
          },
          {
            "name": "曲麻莱",
            "id": 632726
          }
        ]
      },
      {
        "name": "海西",
        "id": 632800,
        "child": [
          {
            "name": "格尔木",
            "id": 632801
          },
          {
            "name": "德令哈",
            "id": 632802
          },
          {
            "name": "乌兰",
            "id": 632821
          },
          {
            "name": "都兰",
            "id": 632822
          },
          {
            "name": "天峻",
            "id": 632823
          }
        ]
      }
    ]
  },
  {
    "name": "宁夏",
    "id": 640000,
    "child": [
      {
        "name": "银川",
        "id": 640100,
        "child": [
          {
            "name": "兴庆",
            "id": 640104
          },
          {
            "name": "西夏",
            "id": 640105
          },
          {
            "name": "金凤",
            "id": 640106
          },
          {
            "name": "永宁",
            "id": 640121
          },
          {
            "name": "贺兰",
            "id": 640122
          },
          {
            "name": "灵武",
            "id": 640181
          }
        ]
      },
      {
        "name": "石嘴山",
        "id": 640200,
        "child": [
          {
            "name": "大武口",
            "id": 640202
          },
          {
            "name": "惠农",
            "id": 640205
          },
          {
            "name": "平罗",
            "id": 640221
          }
        ]
      },
      {
        "name": "吴忠",
        "id": 640300,
        "child": [
          {
            "name": "利通",
            "id": 640302
          },
          {
            "name": "红寺堡",
            "id": 640303
          },
          {
            "name": "盐池",
            "id": 640323
          },
          {
            "name": "同心",
            "id": 640324
          },
          {
            "name": "青铜峡",
            "id": 640381
          }
        ]
      },
      {
        "name": "固原",
        "id": 640400,
        "child": [
          {
            "name": "原州",
            "id": 640402
          },
          {
            "name": "西吉",
            "id": 640422
          },
          {
            "name": "隆德",
            "id": 640423
          },
          {
            "name": "泾源",
            "id": 640424
          },
          {
            "name": "彭阳",
            "id": 640425
          }
        ]
      },
      {
        "name": "中卫",
        "id": 640500,
        "child": [
          {
            "name": "沙坡头",
            "id": 640502
          },
          {
            "name": "中宁",
            "id": 640521
          },
          {
            "name": "海原",
            "id": 640522
          }
        ]
      }
    ]
  },
  {
    "name": "新疆",
    "id": 650000,
    "child": [
      {
        "name": "乌鲁木齐",
        "id": 650100,
        "child": [
          {
            "name": "天山",
            "id": 650102
          },
          {
            "name": "沙依巴克",
            "id": 650103
          },
          {
            "name": "新市",
            "id": 650104
          },
          {
            "name": "水磨沟",
            "id": 650105
          },
          {
            "name": "头屯河",
            "id": 650106
          },
          {
            "name": "达坂城",
            "id": 650107
          },
          {
            "name": "米东",
            "id": 650109
          },
          {
            "name": "乌鲁木齐",
            "id": 650121
          }
        ]
      },
      {
        "name": "克拉玛依",
        "id": 650200,
        "child": [
          {
            "name": "独山子",
            "id": 650202
          },
          {
            "name": "克拉玛依",
            "id": 650203
          },
          {
            "name": "白碱滩",
            "id": 650204
          },
          {
            "name": "乌尔禾",
            "id": 650205
          }
        ]
      },
      {
        "name": "吐鲁番",
        "id": 652100,
        "child": [
          {
            "name": "吐鲁番",
            "id": 652101
          },
          {
            "name": "鄯善",
            "id": 652122
          },
          {
            "name": "托克逊",
            "id": 652123
          }
        ]
      },
      {
        "name": "哈密",
        "id": 652200,
        "child": [
          {
            "name": "哈密",
            "id": 652201
          },
          {
            "name": "巴里坤",
            "id": 652222
          },
          {
            "name": "伊吾",
            "id": 652223
          }
        ]
      },
      {
        "name": "昌吉",
        "id": 652300,
        "child": [
          {
            "name": "昌吉",
            "id": 652301
          },
          {
            "name": "阜康",
            "id": 652302
          },
          {
            "name": "呼图壁",
            "id": 652323
          },
          {
            "name": "玛纳斯",
            "id": 652324
          },
          {
            "name": "奇台",
            "id": 652325
          },
          {
            "name": "吉木萨尔",
            "id": 652327
          },
          {
            "name": "木垒",
            "id": 652328
          }
        ]
      },
      {
        "name": "博尔塔拉",
        "id": 652700,
        "child": [
          {
            "name": "博乐",
            "id": 652701
          },
          {
            "name": "阿拉山口",
            "id": 652702
          },
          {
            "name": "精河",
            "id": 652722
          },
          {
            "name": "温泉",
            "id": 652723
          }
        ]
      },
      {
        "name": "巴音郭楞",
        "id": 652800,
        "child": [
          {
            "name": "库尔勒",
            "id": 652801
          },
          {
            "name": "轮台",
            "id": 652822
          },
          {
            "name": "尉犁",
            "id": 652823
          },
          {
            "name": "若羌",
            "id": 652824
          },
          {
            "name": "且末",
            "id": 652825
          },
          {
            "name": "焉耆",
            "id": 652826
          },
          {
            "name": "和静",
            "id": 652827
          },
          {
            "name": "和硕",
            "id": 652828
          },
          {
            "name": "博湖",
            "id": 652829
          }
        ]
      },
      {
        "name": "阿克苏",
        "id": 652900,
        "child": [
          {
            "name": "阿克苏",
            "id": 652901
          },
          {
            "name": "温宿",
            "id": 652922
          },
          {
            "name": "库车",
            "id": 652923
          },
          {
            "name": "沙雅",
            "id": 652924
          },
          {
            "name": "新和",
            "id": 652925
          },
          {
            "name": "拜城",
            "id": 652926
          },
          {
            "name": "乌什",
            "id": 652927
          },
          {
            "name": "阿瓦提",
            "id": 652928
          },
          {
            "name": "柯坪",
            "id": 652929
          }
        ]
      },
      {
        "name": "克孜勒苏柯尔克孜",
        "id": 653000,
        "child": [
          {
            "name": "阿图什",
            "id": 653001
          },
          {
            "name": "阿克陶",
            "id": 653022
          },
          {
            "name": "阿合奇",
            "id": 653023
          },
          {
            "name": "乌恰",
            "id": 653024
          }
        ]
      },
      {
        "name": "喀什",
        "id": 653100,
        "child": [
          {
            "name": "喀什",
            "id": 653101
          },
          {
            "name": "疏附",
            "id": 653121
          },
          {
            "name": "疏勒",
            "id": 653122
          },
          {
            "name": "英吉沙",
            "id": 653123
          },
          {
            "name": "泽普",
            "id": 653124
          },
          {
            "name": "莎车",
            "id": 653125
          },
          {
            "name": "叶城",
            "id": 653126
          },
          {
            "name": "麦盖提",
            "id": 653127
          },
          {
            "name": "岳普湖",
            "id": 653128
          },
          {
            "name": "伽师",
            "id": 653129
          },
          {
            "name": "巴楚",
            "id": 653130
          },
          {
            "name": "塔什库尔干",
            "id": 653131
          }
        ]
      },
      {
        "name": "和田",
        "id": 653200,
        "child": [
          {
            "name": "和田市",
            "id": 653201
          },
          {
            "name": "和田县",
            "id": 653221
          },
          {
            "name": "墨玉",
            "id": 653222
          },
          {
            "name": "皮山",
            "id": 653223
          },
          {
            "name": "洛浦",
            "id": 653224
          },
          {
            "name": "策勒",
            "id": 653225
          },
          {
            "name": "于田",
            "id": 653226
          },
          {
            "name": "民丰",
            "id": 653227
          }
        ]
      },
      {
        "name": "伊犁",
        "id": 654000,
        "child": [
          {
            "name": "伊宁市",
            "id": 654002
          },
          {
            "name": "奎屯",
            "id": 654003
          },
          {
            "name": "伊宁县",
            "id": 654021
          },
          {
            "name": "察布查尔",
            "id": 654022
          },
          {
            "name": "霍城",
            "id": 654023
          },
          {
            "name": "巩留",
            "id": 654024
          },
          {
            "name": "新源",
            "id": 654025
          },
          {
            "name": "昭苏",
            "id": 654026
          },
          {
            "name": "特克斯",
            "id": 654027
          },
          {
            "name": "尼勒克",
            "id": 654028
          }
        ]
      },
      {
        "name": "塔城",
        "id": 654200,
        "child": [
          {
            "name": "塔城",
            "id": 654201
          },
          {
            "name": "乌苏",
            "id": 654202
          },
          {
            "name": "额敏",
            "id": 654221
          },
          {
            "name": "沙湾",
            "id": 654223
          },
          {
            "name": "托里",
            "id": 654224
          },
          {
            "name": "裕民",
            "id": 654225
          },
          {
            "name": "和布克赛尔",
            "id": 654226
          }
        ]
      },
      {
        "name": "阿勒泰",
        "id": 654300,
        "child": [
          {
            "name": "阿勒泰",
            "id": 654301
          },
          {
            "name": "布尔津",
            "id": 654321
          },
          {
            "name": "富蕴",
            "id": 654322
          },
          {
            "name": "福海",
            "id": 654323
          },
          {
            "name": "哈巴河",
            "id": 654324
          },
          {
            "name": "青河",
            "id": 654325
          },
          {
            "name": "吉木乃",
            "id": 654326
          }
        ]
      },
      {
        "name": "石河子",
        "id": 659001,
        "child": [
          {
            "name": "新城街道",
            "id": 659001001
          },
          {
            "name": "向阳街道",
            "id": 659001002
          },
          {
            "name": "红山街道",
            "id": 659001003
          },
          {
            "name": "老街街道",
            "id": 659001004
          },
          {
            "name": "东城街道",
            "id": 659001005
          },
          {
            "name": "北泉镇",
            "id": 659001100
          },
          {
            "name": "石河子乡",
            "id": 659001200
          },
          {
            "name": "兵团一五二团",
            "id": 659001500
          }
        ]
      },
      {
        "name": "阿拉尔",
        "id": 659002,
        "child": [
          {
            "name": "金银川路街道",
            "id": 659002001
          },
          {
            "name": "幸福路街道",
            "id": 659002002
          },
          {
            "name": "青松路街道",
            "id": 659002003
          },
          {
            "name": "南口街道",
            "id": 659002004
          },
          {
            "name": "托喀依乡",
            "id": 659002200
          },
          {
            "name": "工业园区",
            "id": 659002402
          },
          {
            "name": "兵团七团",
            "id": 659002500
          },
          {
            "name": "兵团八团",
            "id": 659002501
          },
          {
            "name": "兵团十团",
            "id": 659002503
          },
          {
            "name": "兵团十一团",
            "id": 659002504
          },
          {
            "name": "兵团十二团",
            "id": 659002505
          },
          {
            "name": "兵团十三团",
            "id": 659002506
          },
          {
            "name": "兵团十四团",
            "id": 659002507
          },
          {
            "name": "兵团十六团",
            "id": 659002509
          },
          {
            "name": "兵团第一师水利水电工程处",
            "id": 659002511
          },
          {
            "name": "兵团第一师塔里木灌区水利管理处",
            "id": 659002512
          },
          {
            "name": "阿拉尔农场",
            "id": 659002513
          },
          {
            "name": "兵团第一师幸福农场",
            "id": 659002514
          },
          {
            "name": "中心监狱",
            "id": 659002515
          }
        ]
      },
      {
        "name": "图木舒克",
        "id": 659003,
        "child": [
          {
            "name": "齐干却勒街道",
            "id": 659003001
          },
          {
            "name": "前海街道",
            "id": 659003002
          },
          {
            "name": "永安坝街道",
            "id": 659003003
          },
          {
            "name": "兵团四十四团",
            "id": 659003504
          },
          {
            "name": "兵团四十九团",
            "id": 659003509
          },
          {
            "name": "兵团五十团",
            "id": 659003510
          },
          {
            "name": "兵团五十一团",
            "id": 659003511
          },
          {
            "name": "兵团五十三团",
            "id": 659003513
          },
          {
            "name": "兵团图木舒克市喀拉拜勒镇",
            "id": 659003514
          },
          {
            "name": "兵团图木舒克市永安坝",
            "id": 659003515
          }
        ]
      },
      {
        "name": "五家渠",
        "id": 659004,
        "child": [
          {
            "name": "军垦路街道",
            "id": 659004001
          },
          {
            "name": "青湖路街道",
            "id": 659004002
          },
          {
            "name": "人民路街道",
            "id": 659004003
          },
          {
            "name": "兵团一零一团",
            "id": 659004500
          },
          {
            "name": "兵团一零二团",
            "id": 659004501
          },
          {
            "name": "兵团一零三团",
            "id": 659004502
          }
        ]
      }
    ]
  }
]